{"url": "https://www.businesswire.com/news/home/20190308005077/en/Enterprise-Financial-Services-Corp-Trinity-Capital-Corporation", "body": "ST. LOUIS--(BUSINESS WIRE)--Enterprise Financial Services Corp (NASDAQ: EFSC) (“Enterprise,” or “EFSC”), the holding company for Enterprise Bank & Trust (“EB&T”), today announced the completion of its merger with Trinity Capital Corporation (“Trinity”) and the merger of EB&T with Trinity’s wholly owned subsidiary, Los Alamos National Bank (“LANB”). The merger adds approximately $1.2 billion in assets, $700 million in loans and $1.1 billion in deposits to Enterprise and makes New Mexico Enterprise’s second largest market. Following this transformational merger, Enterprise will have approximately $7 billion in total assets.\n\n“We are thrilled with the completion of the merger of our two organizations,” said Jim Lally, President and Chief Executive Officer of Enterprise. “We are excited to continue to build upon the extraordinary past performance of both companies’ commitment to their employees, customers and communities. Our combined organization is poised to deliver strong returns and significant value for our shareholders as we continue to provide the highest level of service across all of our communities into the future.”\n\nThe merger further enhances the geographic diversity of Enterprise’s footprint with LANB’s six full-service locations in Los Alamos, Santa Fe, and Albuquerque, New Mexico. The New Mexico locations will continue to operate under LANB’s existing systems until EB&T completes its systems integration, which is expected to be finalized in mid-2019. LANB customers then will have access to the full range of products and services available currently to EB&T customers.\n\nIn connection with completion of the merger, two Trinity directors, Tony Scavuzzo of Castle Creek Capital, LLC and James F. Deutsch of Patriot Financial Partners, LP, have joined EFSC’s board of directors. Additionally, James E. Goodwin, Jr., Chairman of the boards of directors of Trinity and LANB, has joined the board of directors of EB&T.\n\nAdvisors to Transaction\n\nWells Fargo Securities, LLC served as financial advisor to EFSC, and Holland & Knight LLP served as legal counsel to EFSC. Keefe, Bruyette & Woods, A Stifel Company served as financial advisor to Trinity, and Hunton Andrew Kurth LLP served as legal counsel to Trinity.\n\nAbout Enterprise\n\nEnterprise Financial Services Corp (NASDAQ: EFSC), with approximately $7 billion in assets, is a bank holding company headquartered in Clayton, Missouri. Enterprise Bank & Trust, a Missouri state-chartered trust company with banking powers and a wholly owned subsidiary of Enterprise, operates 34 branch offices in Arizona, Kansas, Missouri and New Mexico. Enterprise Bank & Trust offers a range of business and personal banking services and wealth management services. Enterprise Trust, a division of Enterprise Bank & Trust, provides financial planning, estate planning, investment management and trust services to businesses, individuals, institutions, retirement plans and non-profit organizations. Additional information is available at www.enterprisebank.com.\n\nEnterprise Financial Services Corp’s common stock is traded on the Nasdaq Stock Market under the symbol “EFSC.” Please visit our website at www.enterprisebank.com to see our regularly posted material information.\n\nForward-Looking Statements\n\nIn addition to the historical information contained herein, this press release contains “forward-looking statements” within the meaning of, and intended to be covered by, the safe harbor provisions of the U.S. Private Securities Litigation Reform Act of 1995. Forward-looking statements include, but are not limited to, statements about EFSC’s plans, expectations, and projections of future financial and operating results, as well as statements regarding EFSC’s plans, objectives, expectations or consequences of announced transactions. Words such as “may,” “might,” “will,” “should,” “expect,” “plan,” “anticipate,” “believe,” “estimate,” “predict,” “potential,” “could,” “continue,” and “intend,” and variations of such words and similar expressions are intended to identify such forward-looking statements which are not statements of historical fact. Forward-looking statements are inherently subject to risks and uncertainties that could cause actual results to differ materially from those contemplated from such forward-looking statements. Factors that could cause or contribute to such differences include, but are not limited to, EFSC’s ability to efficiently integrate acquisitions into its operations, retain the customers of these businesses and grow the acquired operations, credit risk, changes in the appraised valuation of real estate securing impaired loans, outcomes of litigation and other contingencies, exposure to general and local economic conditions, risks associated with rapid increases or decreases in prevailing interest rates, consolidation in the banking industry, competition from banks and other financial institutions, EFSC’s ability to attract and retain relationship officers and other key personnel, burdens imposed by federal and state regulation, changes in regulatory requirements, changes in accounting regulation or standards applicable to banks, as well as other risk factors described in the EFSC’s 2018 Annual Report on Form 10-K and other filings made by EFSC with the Securities and Exchange Commission (the “SEC”). Forward-looking statements made in this press release or in any documents speak only as of the date they are made. Except as required under the U.S. federal securities laws and the rules and regulations of the SEC, EFSC disclaims any intention or obligation to update any forward-looking statements after the filing of this press release, whether as a result of new information, future events, developments, changes in assumptions or otherwise.", "title": "Enterprise Financial Services Corp and Trinity Capital Corporation (Parent Company of Los Alamos National Bank) Complete Merger", "images": ["https://mms.businesswire.com/media/20190308005077/en/653378/2/EFSC_Logo.jpg", "https://mms.businesswire.com/media/20190308005077/en/653378/23/EFSC_Logo.jpg"], "text": "\n\n![Business Wire](/images/bwlogo_extreme.png)\n\n# Enterprise Financial Services Corp and Trinity Capital Corporation\n(Parent Company of Los Alamos National Bank) Complete Merger\n\nMarch 08, 2019 06:00 AM Eastern Standard Time\n\nST. LOUIS--(BUSINESS WIRE)--Enterprise Financial Services Corp (NASDAQ: EFSC)\n(“Enterprise,” or “EFSC”), the holding company for Enterprise Bank & Trust\n(“EB&T”), today announced the completion of its merger with Trinity Capital\nCorporation (“Trinity”) and the merger of EB&T with Trinity’s wholly owned\nsubsidiary, Los Alamos National Bank (“LANB”). The merger adds approximately\n$1.2 billion in assets, $700 million in loans and $1.1 billion in deposits to\nEnterprise and makes New Mexico Enterprise’s second largest market. Following\nthis transformational merger, Enterprise will have approximately $7 billion in\ntotal assets.\n\n> “We are thrilled with the completion of the merger of our two\norganizations,” said Jim Lally, President and Chief Executive Officer of\nEnterprise. “We are excited to continue to build upon the extraordinary past\nperformance of both companies’ commitment to their employees, customers and\ncommunities. Our combined organization is poised to deliver strong returns and\nsignificant value for our shareholders as we continue to provide the highest\nlevel of service across all of our communities into the future.”\n\nThe merger further enhances the geographic diversity of Enterprise’s footprint\nwith LANB’s six full-service locations in Los Alamos, Santa Fe, and\nAlbuquerque, New Mexico. The New Mexico locations will continue to operate\nunder LANB’s existing systems until EB&T completes its systems integration,\nwhich is expected to be finalized in mid-2019. LANB customers then will have\naccess to the full range of products and services available currently to EB&T\ncustomers.\n\nIn connection with completion of the merger, two Trinity directors, Tony\nScavuzzo of Castle Creek Capital, LLC and James F. Deutsch of Patriot\nFinancial Partners, LP, have joined EFSC’s board of directors. Additionally,\nJames E. Goodwin, Jr., Chairman of the boards of directors of Trinity and\nLANB, has joined the board of directors of EB&T.\n\nAdvisors to Transaction\n\nWells Fargo Securities, LLC served as financial advisor to EFSC, and Holland\n& Knight LLP served as legal counsel to EFSC. Keefe, Bruyette & Woods, _A\nStifel Company_ served as financial advisor to Trinity, and Hunton Andrew\nKurth LLP served as legal counsel to Trinity.\n\nAbout Enterprise\n\nEnterprise Financial Services Corp (NASDAQ: EFSC), with approximately $7\nbillion in assets, is a bank holding company headquartered in Clayton,\nMissouri. Enterprise Bank & Trust, a Missouri state-chartered trust company\nwith banking powers and a wholly owned subsidiary of Enterprise, operates 34\nbranch offices in Arizona, Kansas, Missouri and New Mexico. Enterprise Bank &\nTrust offers a range of business and personal banking services and wealth\nmanagement services. Enterprise Trust, a division of Enterprise Bank & Trust,\nprovides financial planning, estate planning, investment management and trust\nservices to businesses, individuals, institutions, retirement plans and non-\nprofit organizations. Additional information is available at\nwww.enterprisebank.com.\n\nEnterprise Financial Services Corp’s common stock is traded on the Nasdaq\nStock Market under the symbol “EFSC.” Please visit our website at\nwww.enterprisebank.com to see our regularly posted material information.\n\nForward-Looking Statements\n\nIn addition to the historical information contained herein, this press release\ncontains “forward-looking statements” within the meaning of, and intended to\nbe covered by, the safe harbor provisions of the U.S. Private Securities\nLitigation Reform Act of 1995. Forward-looking statements include, but are not\nlimited to, statements about EFSC’s plans, expectations, and projections of\nfuture financial and operating results, as well as statements regarding EFSC’s\nplans, objectives, expectations or consequences of announced transactions.\nWords such as “may,” “might,” “will,” “should,” “expect,” “plan,”\n“anticipate,” “believe,” “estimate,” “predict,” “potential,” “could,”\n“continue,” and “intend,” and variations of such words and similar expressions\nare intended to identify such forward-looking statements which are not\nstatements of historical fact. Forward-looking statements are inherently\nsubject to risks and uncertainties that could cause actual results to differ\nmaterially from those contemplated from such forward-looking statements.\nFactors that could cause or contribute to such differences include, but are\nnot limited to, EFSC’s ability to efficiently integrate acquisitions into its\noperations, retain the customers of these businesses and grow the acquired\noperations, credit risk, changes in the appraised valuation of real estate\nsecuring impaired loans, outcomes of litigation and other contingencies,\nexposure to general and local economic conditions, risks associated with rapid\nincreases or decreases in prevailing interest rates, consolidation in the\nbanking industry, competition from banks and other financial institutions,\nEFSC’s ability to attract and retain relationship officers and other key\npersonnel, burdens imposed by federal and state regulation, changes in\nregulatory requirements, changes in accounting regulation or standards\napplicable to banks, as well as other risk factors described in the EFSC’s\n2018 Annual Report on Form 10-K and other filings made by EFSC with the\nSecurities and Exchange Commission (the “SEC”). Forward-looking statements\nmade in this press release or in any documents speak only as of the date they\nare made. Except as required under the U.S. federal securities laws and the\nrules and regulations of the SEC, EFSC disclaims any intention or obligation\nto update any forward-looking statements after the filing of this press\nrelease, whether as a result of new information, future events, developments,\nchanges in assumptions or otherwise.\n\n## Contacts\n\nEnterprise Financial Services Corp\n\nInvestor Relations: \nKeene Turner, Executive Vice President and Chief Financial Officer \n(314) 512-7251\n\nMedia: \nKaren Loiterstein, Senior Vice President, Marketing \n(314) 512-7141\n\n![](https://mms.businesswire.com/media/20190308005077/en/653378/2/EFSC_Logo.jpg)\n\n## Release Summary\n\nEnterprise Financial Services Corp and Trinity Capital Corporation (Parent\nCompany of Los Alamos National Bank) Complete Merger\n\n## Contacts\n\nEnterprise Financial Services Corp\n\nInvestor Relations: \nKeene Turner, Executive Vice President and Chief Financial Officer \n(314) 512-7251\n\nMedia: \nKaren Loiterstein, Senior Vice President, Marketing \n(314) 512-7141\n\n## Site Navigation\n\n Home\n Home\n Submit a Press Release\n Services\n News\n All News\n News with Multimedia\n News by Industry\n News by Subject\n News by Language\n Tradeshows & Events\n Education\n Overview\n Distribution & Media\n Media & Journalist Tools\n Sample Press Release\n Find Your News Online\n How-to\n Disclosure Resources\n About Us\n Overview\n Become a Member\n Contact Us\n Follow Us\n Careers\n Business Wire Newsroom\n Business Wire Events\n\n## Search\n\nAdvanced News Search\n\nAdvanced News Search ![Search](/images/icons/icon_search.gif)\n\n Log In\n Sign Up\n\n## Follow Us\n\n Twitter\n LinkedIn\n Google+\n\n## More from Business Wire\n\n Blog\n Apps\n UK/Ireland\n Deutschland\n France\n Hong Kong\n Italy\n Japan\n Tradeshownews.com\n\n## Business Wire Information\n\n Contact Us\n UK Tax Strategy\n Privacy Statement\n Terms of Use\n (C) 2019 Business Wire\n\nAccept the use of cookies Learn more\n\nI Accept\n\n", "contact_info": [{"name": "Keene Turner", "other_information": ["Keene Turner, Executive Vice President and Chief Financial Officer"], "phone": "(314) 512-7251"}, {"name": "Karen Loiterstein", "other_information": ["Karen Loiterstein, Senior Vice President, Marketing"], "phone": "(314) 512-7141"}], "date": "March 08, 2019 06:00 AM Eastern Standard Time", "published_date_time": "March 08, 2019 06:00 AM Eastern Standard Time", "entities": [{"company_name": "ST. LOUIS--(BUSINESS WIRE)--Enterprise Financial Services Corp", "stock_name": "NASDAQ: EFSC"}], "company_1": "Enterprise Financial Services Corp", "company_2": "Enterprise Bank"}