{"url": "https://www.businesswire.com/news/home/20190307005895/en/Caseys-Acquires-Fantasys-Convenience-Stores", "body": "ANKENY, Iowa--(BUSINESS WIRE)--Casey's General Stores, Inc. announced today they have acquired the Fantasy’s Convenience stores and Ride the Wave carwashes located in the Omaha, Nebraska metro area. Casey’s plans to perform significant remodels at all nine of the locations that will enable the stores to offer pizza, donuts, made-to-order sub-sandwiches and many other freshly prepared food items. Casey’s plans to leave the very popular touchless tunnel washes in place and continue to use the Ride the Wave brand.\n\n“The acquisition of the Fantasy’s chain is an excellent fit to our existing store base and will expand our presence in the greater Omaha market,” said Terry Handley, President and CEO of Casey’s General Stores, Inc. “They are a very well established and managed chain, and we are excited to welcome the Fantasy’s employees to the Casey’s family.”\n\n“We are very grateful to our loyal customers that we had the pleasure of serving since 1989. We know they, along with our hard working employees, are in great hands with Casey’s,” said Karen Shramek, President of Fantasy’s Inc. “We are excited that Casey’s will continue to use the 'Ride the Wave' carwash branding and that our customers will continue to receive the great service they have come to expect from our stores. In addition, they will soon be able to enjoy Casey’s delicious made-from-scratch pizza as well.”\n\nAbout Casey's General Stores, Inc.\n\nCasey's General Stores, Inc. is a Fortune 500 company (NASDAQ: CASY) operating over 2,100 convenience stores in 16 states in the Midwest and the South. Casey's strives to consistently deliver quality gasoline, freshly-prepared foods, clean environments and friendly service at every retail location. Casey's is currently the fourth largest convenience store chain and the fifth largest pizza chain in the United States.", "title": "Casey's Acquires Fantasy's Convenience Stores", "images": ["https://mms.businesswire.com/media/20190307005895/en/2623/21/Caseyslogo.jpg", "https://mms.businesswire.com/media/20190307005895/en/2623/2/Caseyslogo.jpg"], "text": "\n\n![Business Wire](/images/bwlogo_extreme.png)\n\n# Casey's Acquires Fantasy's Convenience Stores\n\nMarch 07, 2019 05:47 PM Eastern Standard Time\n\nANKENY, Iowa--(BUSINESS WIRE)--Casey's General Stores, Inc. announced today\nthey have acquired the Fantasy’s Convenience stores and Ride the Wave\ncarwashes located in the Omaha, Nebraska metro area. Casey’s plans to perform\nsignificant remodels at all nine of the locations that will enable the stores\nto offer pizza, donuts, made-to-order sub-sandwiches and many other freshly\nprepared food items. Casey’s plans to leave the very popular touchless tunnel\nwashes in place and continue to use the Ride the Wave brand.\n\n> “The acquisition of the Fantasy’s chain is an excellent fit to our existing\nstore base and will expand our presence in the greater Omaha market,” said\nTerry Handley, President and CEO of Casey’s General Stores, Inc. “They are a\nvery well established and managed chain, and we are excited to welcome the\nFantasy’s employees to the Casey’s family.”\n\n“We are very grateful to our loyal customers that we had the pleasure of\nserving since 1989. We know they, along with our hard working employees, are\nin great hands with Casey’s,” said Karen Shramek, President of Fantasy’s Inc.\n“We are excited that Casey’s will continue to use the 'Ride the Wave' carwash\nbranding and that our customers will continue to receive the great service\nthey have come to expect from our stores. In addition, they will soon be able\nto enjoy Casey’s delicious made-from-scratch pizza as well.”\n\nAbout Casey's General Stores, Inc.\n\nCasey's General Stores, Inc. is a Fortune 500 company (NASDAQ: CASY) operating\nover 2,100 convenience stores in 16 states in the Midwest and the South.\nCasey's strives to consistently deliver quality gasoline, freshly-prepared\nfoods, clean environments and friendly service at every retail location.\nCasey's is currently the fourth largest convenience store chain and the fifth\nlargest pizza chain in the United States.\n\n## Contacts\n\nMichael Richardson \n(515) 965-6213 \nm.richardson@caseys.com\n\n![](https://mms.businesswire.com/media/20190307005895/en/2623/2/Caseyslogo.jpg)\n\n## Contacts\n\nMichael Richardson \n(515) 965-6213 \nm.richardson@caseys.com\n\n## Site Navigation\n\n Home\n Home\n Submit a Press Release\n Services\n News\n All News\n News with Multimedia\n News by Industry\n News by Subject\n News by Language\n Tradeshows & Events\n Education\n Overview\n Distribution & Media\n Media & Journalist Tools\n Sample Press Release\n Find Your News Online\n How-to\n Disclosure Resources\n About Us\n Overview\n Become a Member\n Contact Us\n Follow Us\n Careers\n Business Wire Newsroom\n Business Wire Events\n\n## Search\n\nAdvanced News Search\n\nAdvanced News Search ![Search](/images/icons/icon_search.gif)\n\n Log In\n Sign Up\n\n## Follow Us\n\n Twitter\n LinkedIn\n Google+\n\n## More from Business Wire\n\n Blog\n Apps\n UK/Ireland\n Deutschland\n France\n Hong Kong\n Italy\n Japan\n Tradeshownews.com\n\n## Business Wire Information\n\n Contact Us\n UK Tax Strategy\n Privacy Statement\n Terms of Use\n (C) 2019 Business Wire\n\nAccept the use of cookies Learn more\n\nI Accept\n\n", "contact_info": [{"name": "Michael Richardson", "phone": "(515) 965-6213", "email": "m.richardson@caseys.com"}], "date": "March 07, 2019", "time": "05:47 PM", "published_date_time": "March 07, 2019 05:47 PM Eastern Standard Time", "entities": [], "company_1": "Casey's General Stores", "company_2": "the Ride"}