{"url": "https://www.businesswire.com/news/home/20190307005237/en/ResMed-Acquires-HB-Healthcare-Millions-Koreans-Living", "body": "SEOUL--(BUSINESS WIRE)--ResMed (NYSE: RMD, ASX: RMD), a global leader in cloud-connected sleep and respiratory care devices in more than 120 countries, today announced that is has completed the acquisition of HB Healthcare (HBH) to help millions of South Koreans living with sleep apnea, chronic obstructive pulmonary disease (COPD) and other respiratory conditions.\n\nHBH, a fast-growing privately owned South Korean home medical equipment provider, serves both reimbursed and cash-pay customers of sleep and respiratory care devices. ResMed intends to reach millions more patients through HBH and its wider network of trusted distributor partners.\n\n“ResMed has reaffirmed its leading role in Korea’s CPAP and respiratory care market, and commitment to improving millions of Koreans’ breathing and quality of life,” said Kim Ho Kyun, ResMed Korea’s Sales and Marketing director. “With HBH and our valued distribution partners in Korea, ResMed can maximize the number of people who can enjoy the benefits of life-changing cloud-connected sleep and respiratory therapy.”\n\nSleep apnea in Korea\n\nOne in five Korean adults is believed to have sleep apnea, according to a study by Ansan Hospital, Korea University and the Korea Center for Disease Control and Prevention. ResMed believes that the Korean population is highly underserved, and that increased awareness among Koreans and their doctors can lead to better diagnosis rates, treatment and overall health outcomes.\n\nThe Korean government’s July 2018 decision to commence National Health Insurance Service reimbursement for sleep apnea diagnosis and CPAP treatment devices, such as ResMed's AirSense 10 and AirMini (the world’s smallest CPAP), can help encourage people with sleep apnea to seek the in-home treatment they need.\n\nRespiratory care in Korea\n\nKoreans required to use home ventilation to help treat their COPD or other lung disease may be eligible to rent from ResMed’s comprehensive range of ventilators through their health insurance provider.\n\nPlus, a 2018 study showed that combining a home ventilator with home oxygen therapy significantly reduced COPD-related hospital readmissions and – in a rare finding – saved people money over the long term.\n\nResMed provides a comprehensive range of home ventilators through its distribution partners to patients as well. Those ventilators will be cloud-connectable later this year.\n\n“We’re excited to join the ResMed family and, together, help provide life-changing, cloud-connectable devices to millions of Koreans living with sleep apnea, COPD and other chronic diseases,” said Hong Seung Chul, HB Healthcare’s director of patient management.\n\nResMed has sold sleep and respiratory care devices in Korea for more than a decade, and has consistently led efforts in the delivery of quality healthcare services to Korean customers with consistent, innovative services and support for official partners across the country.\n\nAbout ResMed\n\nAt ResMed (NYSE: RMD, ASX: RMD) we pioneer innovative solutions that treat and keep people out of the hospital, empowering them to live healthier, higher-quality lives. Our cloud-connected medical devices transform care for people with sleep apnea, COPD and other chronic diseases. Our comprehensive out-of-hospital software platforms support the professionals and caregivers who help people stay healthy in the home or care setting of their choice. By enabling better care, we improve quality of life, reduce the impact of chronic disease and lower costs for consumers and healthcare systems in more than 120 countries. To learn more, visit ResMed.com and follow @ResMed.", "title": "ResMed Acquires HB Healthcare to Help Millions of Koreans Living with Sleep Apnea, Other Respiratory Conditions", "images": ["https://mms.businesswire.com/media/20190307005237/en/649042/23/ResMed_logo_digital_1024x1024.jpg", "https://mms.businesswire.com/media/20190307005237/en/649042/2/ResMed_logo_digital_1024x1024.jpg"], "text": "\n\n![Business Wire](/images/bwlogo_extreme.png)\n\n# ResMed Acquires HB Healthcare to Help Millions of Koreans Living with\nSleep Apnea, Other Respiratory Conditions\n\nMarch 07, 2019 05:30 PM Eastern Standard Time\n\nSEOUL--(BUSINESS WIRE)--ResMed (NYSE: RMD, ASX: RMD), a global leader in\ncloud-connected sleep and respiratory care devices in more than 120 countries,\ntoday announced that is has completed the acquisition of HB Healthcare (HBH)\nto help millions of South Koreans living with sleep apnea, chronic obstructive\npulmonary disease (COPD) and other respiratory conditions.\n\n> HBH, a fast-growing privately owned South Korean home medical equipment\nprovider, serves both reimbursed and cash-pay customers of sleep and\nrespiratory care devices. ResMed intends to reach millions more patients\nthrough HBH and its wider network of trusted distributor partners.\n\n“ResMed has reaffirmed its leading role in Korea’s CPAP and respiratory care\nmarket, and commitment to improving millions of Koreans’ breathing and quality\nof life,” said Kim Ho Kyun, ResMed Korea’s Sales and Marketing director. “With\nHBH and our valued distribution partners in Korea, ResMed can maximize the\nnumber of people who can enjoy the benefits of life-changing cloud-connected\nsleep and respiratory therapy.”\n\nSleep apnea in Korea\n\nOne in five Korean adults is believed to have sleep apnea, according to a\nstudy by Ansan Hospital, Korea University and the Korea Center for Disease\nControl and Prevention. ResMed believes that the Korean population is highly\nunderserved, and that increased awareness among Koreans and their doctors can\nlead to better diagnosis rates, treatment and overall health outcomes.\n\nThe Korean government’s July 2018 decision to commence National Health\nInsurance Service reimbursement for sleep apnea diagnosis and CPAP treatment\ndevices, such as ResMed's AirSense 10 and AirMini (the world’s smallest CPAP),\ncan help encourage people with sleep apnea to seek the in-home treatment they\nneed.\n\nRespiratory care in Korea\n\nKoreans required to use home ventilation to help treat their COPD or other\nlung disease may be eligible to rent from ResMed’s comprehensive range of\nventilators through their health insurance provider.\n\nPlus, a 2018 study showed that combining a home ventilator with home oxygen\ntherapy significantly reduced COPD-related hospital readmissions and – in a\nrare finding – saved people money over the long term.\n\nResMed provides a comprehensive range of home ventilators through its\ndistribution partners to patients as well. Those ventilators will be cloud-\nconnectable later this year.\n\n“We’re excited to join the ResMed family and, together, help provide life-\nchanging, cloud-connectable devices to millions of Koreans living with sleep\napnea, COPD and other chronic diseases,” said Hong Seung Chul, HB Healthcare’s\ndirector of patient management.\n\nResMed has sold sleep and respiratory care devices in Korea for more than a\ndecade, and has consistently led efforts in the delivery of quality healthcare\nservices to Korean customers with consistent, innovative services and support\nfor official partners across the country.\n\nAbout ResMed\n\nAt ResMed (NYSE: RMD, ASX: RMD) we pioneer innovative solutions that treat and\nkeep people out of the hospital, empowering them to live healthier, higher-\nquality lives. Our cloud-connected medical devices transform care for people\nwith sleep apnea, COPD and other chronic diseases. Our comprehensive out-of-\nhospital software platforms support the professionals and caregivers who help\npeople stay healthy in the home or care setting of their choice. By enabling\nbetter care, we improve quality of life, reduce the impact of chronic disease\nand lower costs for consumers and healthcare systems in more than 120\ncountries. To learn more, visit ResMed.com and follow @ResMed.\n\n## Contacts\n\nFor media: \nIn Korea: \nHyeLim Lee \n+82 2311.4702 \nHyeLim.Lee@resmed.com.au\n\nOutside Korea: \nJayme Rubenstein \n+1 858.836.6798 \nnews@resmed.com\n\nFor investors: \nAmy Wakeham \n+1 858.836.5000 \ninvestorrelations@resmed.com\n\n![](https://mms.businesswire.com/media/20190307005237/en/649042/2/ResMed_logo_digital_1024x1024.jpg)\n\n## Release Summary\n\nWith HB Healthcare and other valued distribution partners, ResMed seeks to\nprovide cloud-connected sleep and respiratory therapy to millions more.\n\n## #Hashtags\n\n #digitalhealth\n #CPAP\n #COPD\n #sleepapnea\n\n## $Cashtags\n\n $RMD\n\n## Social Media Profiles\n\n ResMed on Facebook\n ResMed on Twitter\n ResMed on LinkedIn\n\n## Contacts\n\nFor media: \nIn Korea: \nHyeLim Lee \n+82 2311.4702 \nHyeLim.Lee@resmed.com.au\n\nOutside Korea: \nJayme Rubenstein \n+1 858.836.6798 \nnews@resmed.com\n\nFor investors: \nAmy Wakeham \n+1 858.836.5000 \ninvestorrelations@resmed.com\n\n## Site Navigation\n\n Home\n Home\n Submit a Press Release\n Services\n News\n All News\n News with Multimedia\n News by Industry\n News by Subject\n News by Language\n Tradeshows & Events\n Education\n Overview\n Distribution & Media\n Media & Journalist Tools\n Sample Press Release\n Find Your News Online\n How-to\n Disclosure Resources\n About Us\n Overview\n Become a Member\n Contact Us\n Follow Us\n Careers\n Business Wire Newsroom\n Business Wire Events\n\n## Search\n\nAdvanced News Search\n\nAdvanced News Search ![Search](/images/icons/icon_search.gif)\n\n Log In\n Sign Up\n\n## Follow Us\n\n Twitter\n LinkedIn\n Google+\n\n## More from Business Wire\n\n Blog\n Apps\n UK/Ireland\n Deutschland\n France\n Hong Kong\n Italy\n Japan\n Tradeshownews.com\n\n## Business Wire Information\n\n Contact Us\n UK Tax Strategy\n Privacy Statement\n Terms of Use\n (C) 2019 Business Wire\n\nAccept the use of cookies Learn more\n\nI Accept\n\n", "contact_info": [{"name": "Lee", "other_information": ["HyeLim Lee"], "phone": "2311.4702", "email": "HyeLim.Lee@resmed.com.au"}, {"name": "Jayme Rubenstein", "phone": "+1 858.836.6798", "email": "news@resmed.com"}, {"name": "Amy Wakeham", "phone": "+1 858.836.5000", "email": "investorrelations@resmed.com"}], "date": "March 07, 2019", "time": "05:30 PM Eastern Standard Time", "published_date_time": "March 07, 2019 05:30 PM Eastern Standard Time", "entities": [], "company_1": "ResMed", "company_2": "HB Healthcare"}