{"url": "https://www.businesswire.com/news/home/20190307005884/en/Hess-Infrastructure-Partners-LP-Announces-Closing-Acquisition", "body": "HOUSTON--(BUSINESS WIRE)--Hess Infrastructure Partners LP (“HIP” or the “Partnership”), a midstream energy joint venture between Hess Corporation (“Hess”) (NYSE: HES) and Global Infrastructure Partners (“GIP”) and the sponsor of Hess Midstream Partners LP, a publicly traded master limited partnership (“Hess Midstream”), today announced that it has closed the previously announced acquisition of Hess’ existing Bakken water services business for a total cash consideration of $225 million, subject to customary adjustments. The Partnership has provided Hess Midstream a right of first offer to acquire the water services business in the event the Partnership decides to sell the water services business in the future.\n\nThe scope of the water services business includes substantially all of Hess’ Bakken produced water gathering assets and saltwater disposal services in North Dakota, which currently consist of over 150 miles of existing Hess water gathering pipelines capturing approximately 30,000 barrels per day of produced water. The water services business is supported by a long-term contract that includes minimum volume commitments for both produced water gathering and disposal services, and annual tariff rate recalculations for the produced water gathering services.\n\nIn addition, on February 26, 2019, HIP announced an agreement to acquire approximately 75 miles of produced water gathering pipelines from Summit Midstream Partners. This acquisition will be incorporated into HIP’s existing long-term water contract and is expected to close in the first quarter of 2019.\n\nAbout Hess Infrastructure Partners LP\n\nHIP is a midstream energy joint venture between Hess and GIP. The Partnership owns interests in various operating companies that provide a diverse mix of midstream oil and natural gas services in the core of the Bakken and Three Forks shale plays in the Williston Basin area of North Dakota. The Partnership also owns a 100% interest in the general partner of Hess Midstream.\n\nAbout Hess Midstream Partners LP\n\nHess Midstream is a fee-based, growth-oriented, traditional master limited partnership that was formed to own, operate, develop and acquire a diverse set of midstream assets to provide services to Hess and third-party customers. Hess Midstream’s assets are primarily located in the Bakken and Three Forks Shale plays in the Williston Basin area of North Dakota.\n\nAbout Hess Corporation and Global Infrastructure Partners\n\nHess is a global independent energy company engaged in the exploration and production of crude oil and natural gas. GlP is an independent infrastructure fund that invests in infrastructure assets and businesses across three core sectors: energy, transportation and water/waste.\n\nCautionary Statement Relevant to Forward-Looking Information\n\nThis press release includes forward-looking statements regarding future events. These forward-looking statements are based on the Partnership’s current plans and expectations and involve a number of risks and uncertainties that could cause actual results and events to vary materially from the results and events anticipated or implied by such forward-looking statements. These risks include the possibility that the proposed acquisition of Summit’s water gathering assets will not be consummated on the expected timeline, or at all, that HIP may elect not to offer the water services business for sale in the future, and that produced water volumes in the Bakken do not grow as expected, or at all. While the Partnership may elect to update these forward-looking statements at some point in the future, it specifically disclaims any obligation to do so, even if new information becomes available in the future. You are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date of this press release.", "title": "Hess Infrastructure Partners LP Announces Closing of Acquisition of Hess Corporation’s Bakken Water Business", "images": ["https://mms.businesswire.com/media/20190307005884/en/709531/2/23758957_hessUntitled.jpg", "https://mms.businesswire.com/media/20190307005884/en/709531/23/23758957_hessUntitled.jpg"], "text": "\n\n![Business Wire](/images/bwlogo_extreme.png)\n\n# Hess Infrastructure Partners LP Announces Closing of Acquisition of Hess\nCorporation’s Bakken Water Business\n\nMarch 07, 2019 05:25 PM Eastern Standard Time\n\nHOUSTON--(BUSINESS WIRE)--Hess Infrastructure Partners LP (“HIP” or the\n“Partnership”), a midstream energy joint venture between Hess Corporation\n(“Hess”) (NYSE: HES) and Global Infrastructure Partners (“GIP”) and the\nsponsor of Hess Midstream Partners LP, a publicly traded master limited\npartnership (“Hess Midstream”), today announced that it has closed the\npreviously announced acquisition of Hess’ existing Bakken water services\nbusiness for a total cash consideration of $225 million, subject to customary\nadjustments. The Partnership has provided Hess Midstream a right of first\noffer to acquire the water services business in the event the Partnership\ndecides to sell the water services business in the future.\n\nThe scope of the water services business includes substantially all of Hess’\nBakken produced water gathering assets and saltwater disposal services in\nNorth Dakota, which currently consist of over 150 miles of existing Hess water\ngathering pipelines capturing approximately 30,000 barrels per day of produced\nwater. The water services business is supported by a long-term contract that\nincludes minimum volume commitments for both produced water gathering and\ndisposal services, and annual tariff rate recalculations for the produced\nwater gathering services.\n\nIn addition, on February 26, 2019, HIP announced an agreement to acquire\napproximately 75 miles of produced water gathering pipelines from Summit\nMidstream Partners. This acquisition will be incorporated into HIP’s existing\nlong-term water contract and is expected to close in the first quarter of\n2019.\n\nAbout Hess Infrastructure Partners LP\n\nHIP is a midstream energy joint venture between Hess and GIP. The Partnership\nowns interests in various operating companies that provide a diverse mix of\nmidstream oil and natural gas services in the core of the Bakken and Three\nForks shale plays in the Williston Basin area of North Dakota. The Partnership\nalso owns a 100% interest in the general partner of Hess Midstream.\n\nAbout Hess Midstream Partners LP\n\nHess Midstream is a fee-based, growth-oriented, traditional master limited\npartnership that was formed to own, operate, develop and acquire a diverse set\nof midstream assets to provide services to Hess and third-party customers.\nHess Midstream’s assets are primarily located in the Bakken and Three Forks\nShale plays in the Williston Basin area of North Dakota.\n\nAbout Hess Corporation and Global Infrastructure Partners\n\nHess is a global independent energy company engaged in the exploration and\nproduction of crude oil and natural gas. GlP is an independent infrastructure\nfund that invests in infrastructure assets and businesses across three core\nsectors: energy, transportation and water/waste.\n\nCautionary Statement Relevant to Forward-Looking Information\n\nThis press release includes forward-looking statements regarding future\nevents. These forward-looking statements are based on the Partnership’s\ncurrent plans and expectations and involve a number of risks and uncertainties\nthat could cause actual results and events to vary materially from the results\nand events anticipated or implied by such forward-looking statements. These\nrisks include the possibility that the proposed acquisition of Summit’s water\ngathering assets will not be consummated on the expected timeline, or at all,\nthat HIP may elect not to offer the water services business for sale in the\nfuture, and that produced water volumes in the Bakken do not grow as expected,\nor at all. While the Partnership may elect to update these forward-looking\nstatements at some point in the future, it specifically disclaims any\nobligation to do so, even if new information becomes available in the future.\nYou are cautioned not to place undue reliance on these forward-looking\nstatements, which speak only as of the date of this press release.\n\n## Contacts\n\nInvestors: \nJennifer Gordon \nDirector – Investor Relations \n(212) 536-8244\n\nMedia: \nRobert Young \n(346) 319-8783\n\n![](https://mms.businesswire.com/media/20190307005884/en/709531/2/23758957_hessUntitled.jpg)\n\n## Release Summary\n\nHess Infrastructure Partners LP Announces Closing of Acquisition of Hess\nCorporation's Bakken Water Business\n\n## $Cashtags\n\n $HESM\n\n## Contacts\n\nInvestors: \nJennifer Gordon \nDirector – Investor Relations \n(212) 536-8244\n\nMedia: \nRobert Young \n(346) 319-8783\n\n## Site Navigation\n\n Home\n Home\n Submit a Press Release\n Services\n News\n All News\n News with Multimedia\n News by Industry\n News by Subject\n News by Language\n Tradeshows & Events\n Education\n Overview\n Distribution & Media\n Media & Journalist Tools\n Sample Press Release\n Find Your News Online\n How-to\n Disclosure Resources\n About Us\n Overview\n Become a Member\n Contact Us\n Follow Us\n Careers\n Business Wire Newsroom\n Business Wire Events\n\n## Search\n\nAdvanced News Search\n\nAdvanced News Search ![Search](/images/icons/icon_search.gif)\n\n Log In\n Sign Up\n\n## Follow Us\n\n Twitter\n LinkedIn\n Google+\n\n## More from Business Wire\n\n Blog\n Apps\n UK/Ireland\n Deutschland\n France\n Hong Kong\n Italy\n Japan\n Tradeshownews.com\n\n## Business Wire Information\n\n Contact Us\n UK Tax Strategy\n Privacy Statement\n Terms of Use\n (C) 2019 Business Wire\n\nAccept the use of cookies Learn more\n\nI Accept\n\n", "contact_info": [{"name": "Jennifer Gordon", "other_information": ["Director – Investor Relations"], "phone": "(212) 536-8244"}, {"name": "Robert Young", "phone": "(346) 319-8783"}], "date": "March 07, 2019 05:25", "published_date_time": "March 07, 2019 05:25 PM Eastern Standard Time", "entities": [{"company_name": "", "stock_name": "NYSE: HES"}], "company_1": "Hess Infrastructure Partners LP", "company_2": "Hess Corporation"}