{"url": "https://www.businesswire.com/news/home/20190307005846/en/Indiana-American-Water-Acquires-Charlestown-Water-System", "body": "GREENWOOD, Ind.--(BUSINESS WIRE)--Indiana American Water President Deborah Dewey today announced the company’s acquisition of Charlestown Water, a municipal water utility located in southern Indiana. The purchase of the system adds approximately 2,900 customers to the company’s customer base, which represents a population of more than 7,800 residents.\n\n“ The acquisition of this system will provide Charlestown customers with access to operations and capital management water professionals and a number of customer service options and payment methods,” said Dewey. “ Indiana American Water already provides water to several nearby communities, so this is a good fit for us and a continuation of our efforts to help provide cost-effective solutions for communities all across Indiana.”\n\n“ Many communities like Charlestown are looking for new and innovative ways to deal with challenges they’re facing and hold the bottom-line on expenses, and this acquisition is a great solution for the utility and its customers,” Dewey continued.\n\nThe acquisition of the Charlestown system for approximately $13.4 million was approved by the Indiana Utility Regulatory Commission last year and closed by Indiana American Water and the City of Charlestown on Tuesday, March 5, 2019. The Charlestown system will be incorporated into the company’s Southern Indiana district, which currently serves approximately 100,000 residents.\n\nCharlestown Mayor Bob Hall is also enthusiastic in his support of the acquisition. “ Our community was facing tremendous capital costs to address water quality and local infrastructure needs,” said Hall. “ This acquisition will help us to address these concerns at a lower overall cost than we would otherwise be able to do and also provide funds to help us address other pressing priorities in our community. We appreciate the experience, knowledge and resources that Indiana American Water brings to the table and look forward to working with them.”\n\nAbout Indiana American Water\n\nIndiana American Water, a subsidiary of American Water (NYSE: AWK), is the largest investor-owned water utility in the state, providing high-quality and reliable water and/or wastewater services to approximately 1.3 million people. With a history dating back to 1886, American Water is the largest and most geographically diverse U.S. publicly traded water and wastewater utility company. The company employs more than 7,100 dedicated professionals who provide regulated and market-based drinking water, wastewater and other related services to more than 14 million people in 46 states and Ontario, Canada. American Water provides safe, clean, affordable and reliable water services to our customers to make sure we keep their lives flowing. For more information, visit amwater.com and follow American Water on Twitter, Facebook and LinkedIn.", "title": "Indiana American Water Acquires Charlestown Water System in Southern Indiana", "images": [], "text": "\n\n![Business Wire](/images/bwlogo_extreme.png)\n\n# Indiana American Water Acquires Charlestown Water System in Southern\nIndiana\n\nMarch 07, 2019 04:44 PM Eastern Standard Time\n\nGREENWOOD, Ind.--(BUSINESS WIRE)--Indiana American Water President Deborah\nDewey today announced the company’s acquisition of Charlestown Water, a\nmunicipal water utility located in southern Indiana. The purchase of the\nsystem adds approximately 2,900 customers to the company’s customer base,\nwhich represents a population of more than 7,800 residents.\n\n“The acquisition of this system will provide Charlestown customers with access\nto operations and capital management water professionals and a number of\ncustomer service options and payment methods,” said Dewey. “Indiana American\nWater already provides water to several nearby communities, so this is a good\nfit for us and a continuation of our efforts to help provide cost-effective\nsolutions for communities all across Indiana.”\n\n“Many communities like Charlestown are looking for new and innovative ways to\ndeal with challenges they’re facing and hold the bottom-line on expenses, and\nthis acquisition is a great solution for the utility and its customers,” Dewey\ncontinued.\n\nThe acquisition of the Charlestown system for approximately $13.4 million was\napproved by the Indiana Utility Regulatory Commission last year and closed by\nIndiana American Water and the City of Charlestown on Tuesday, March 5, 2019.\nThe Charlestown system will be incorporated into the company’s Southern\nIndiana district, which currently serves approximately 100,000 residents.\n\nCharlestown Mayor Bob Hall is also enthusiastic in his support of the\nacquisition. “Our community was facing tremendous capital costs to address\nwater quality and local infrastructure needs,” said Hall. “This acquisition\nwill help us to address these concerns at a lower overall cost than we would\notherwise be able to do and also provide funds to help us address other\npressing priorities in our community. We appreciate the experience, knowledge\nand resources that Indiana American Water brings to the table and look forward\nto working with them.”\n\nAbout Indiana American Water\n\nIndiana American Water, a subsidiary of American Water (NYSE: AWK), is the\nlargest investor-owned water utility in the state, providing high-quality and\nreliable water and/or wastewater services to approximately 1.3 million people.\nWith a history dating back to 1886, American Water is the largest and most\ngeographically diverse U.S. publicly traded water and wastewater utility\ncompany. The company employs more than 7,100 dedicated professionals who\nprovide regulated and market-based drinking water, wastewater and other\nrelated services to more than 14 million people in 46 states and Ontario,\nCanada. American Water provides safe, clean, affordable and reliable water\nservices to our customers to make sure we keep their lives flowing. For more\ninformation, visit amwater.com and follow American Water on Twitter, Facebook\nand LinkedIn.\n\n## Contacts\n\nJoe Loughmiller \nOffice 317-885-2434 \nCell 317-903-7431 \njoe.loughmiller@amwater.com\n\n## Release Summary\n\nIndiana American Water has acquired Charlestown Water, a municipal water\nutility located in southern Indiana.\n\n## Contacts\n\nJoe Loughmiller \nOffice 317-885-2434 \nCell 317-903-7431 \njoe.loughmiller@amwater.com\n\n## Site Navigation\n\n Home\n Home\n Submit a Press Release\n Services\n News\n All News\n News with Multimedia\n News by Industry\n News by Subject\n News by Language\n Tradeshows & Events\n Education\n Overview\n Distribution & Media\n Media & Journalist Tools\n Sample Press Release\n Find Your News Online\n How-to\n Disclosure Resources\n About Us\n Overview\n Become a Member\n Contact Us\n Follow Us\n Careers\n Business Wire Newsroom\n Business Wire Events\n\n## Search\n\nAdvanced News Search\n\nAdvanced News Search ![Search](/images/icons/icon_search.gif)\n\n Log In\n Sign Up\n\n## Follow Us\n\n Twitter\n LinkedIn\n Google+\n\n## More from Business Wire\n\n Blog\n Apps\n UK/Ireland\n Deutschland\n France\n Hong Kong\n Italy\n Japan\n Tradeshownews.com\n\n## Business Wire Information\n\n Contact Us\n UK Tax Strategy\n Privacy Statement\n Terms of Use\n (C) 2019 Business Wire\n\nAccept the use of cookies Learn more\n\nI Accept\n\n", "contact_info": [{"name": "Joe Loughmiller", "phone": "317-903-7431", "email": "joe.loughmiller@amwater.com"}], "date": "March 07, 2019", "time": "04:44 PM", "published_date_time": "March 07, 2019 04:44 PM Eastern Standard Time", "entities": [], "company_1": "Indiana American Water President Deborah Dewey", "company_2": "Charlestown Water"}