{"url": "https://www.businesswire.com/news/home/20190307005817/en/Okta-Acquire-Azuqua-Connect-Business-Applications-Enterprise", "body": "SAN FRANCISCO--(BUSINESS WIRE)--Okta, Inc. (NASDAQ:OKTA), the leading independent provider of identity for the enterprise, today announced it has entered into a definitive agreement to acquire Azuqua, a leader in no-code, cloud-based business application integration and workflow automation. Together, Okta and Azuqua will provide organizations with a neutral, independent control center for automating the business processes and the flow of identities between applications and services for everyone in an organization— from employees to partners, and customers. The proposed acquisition is expected to close during Okta’s fiscal first quarter, subject to the satisfaction of certain closing conditions.\n\nAs every company transforms itself into a technology company, the proliferation of apps and services that power the modern business must drive efficiency, innovation and seamless end user experiences across disparate systems. According to Okta’s 2019 Businesses at Work Report, the average Okta customer has 83 cloud apps, and 9% of customers have more than 200 cloud apps. As organizations choose and adopt best-of-breed technologies, they often struggle to make all of their different applications and technologies work together, and to manage them at scale. Typically, IT organizations are forced to build and maintain custom integrations or rely on manual processes. The cost and friction involved has been a huge barrier to the adoption of new technology.\n\nOkta invested early in automation for provisioning and deprovisioning apps and services with Okta’s Lifecycle Management product. With Azuqua, connectors are pre-built and maintained, and workflows can be defined without code — ultimately enabling companies to deliver connected digital experiences across the organization and deliver tailored, repeatable customer journeys. The unifying power of identity through the Okta Identity Cloud combined with Azuqua’s modern, simple integration platform will enable customers to automate more of their business processes and connect to even more apps. IT teams will be able to use pre-built connectors and logic to create streamlined processes and increase operational speed. Product teams will be able to embed this technology in their own applications alongside Okta’s core authentication and user management technology to build delightful, integrated customer experiences.\n\n“Only a neutral, independent platform like the Okta Identity Cloud has the capacity to ensure that every app in an organization is tightly integrated, so businesses can optimize productivity and deliver delightful customer experiences. Identity is the unifying component that can make all of these technologies interact seamlessly and securely. Identity will power the next wave of movement to best-in-breed technology,” said Frederic Kerrest, Chief Operating Officer and co-founder of Okta. “Azuqua’s power to connect applications will multiply the benefits of the The Okta Integration Network for Okta’s customers, enabling them to unlock data, create seamless business processes and eliminate cloud silos. We look forward to bringing on the Azuqua team to further our vision to enable any organization to use any technology.”\n\n\"PlanGrid is used on more than 1.5 million construction projects, and teams around the world rely on our software to collaborate and increase productivity,” said Tracy Young, head of PlanGrid at Autodesk. \"Okta and Azuqua play an integral role in connecting the people and technology that brings PlanGrid into field workers' daily workflow. Azuqua helps us break down data silos and Okta provides unprecedented security. Together they will become an industry standard, and deliver the scale our customers demand.”\n\nFounded in 2013, Azuqua is pioneering cloud-based integration and automation. Collectively, the Azuqua team has decades of experience building enterprise technology products, coming from companies like Microsoft, Tableau, VMware, Telstra and IBM. Nikhil Hasija, founder and chief product officer, will join Okta’s engineering team to help lead the company’s workflow automation strategy, beginning with the integration of Azuqua’s workflow offering into Okta's Lifecycle Management product.\n\nCautionary Language Concerning Forward-Looking Statements\n\nThis press release contains forward-looking statements relating to expectations, plans, and prospects including expectations relating to the benefits that will be derived from this transaction. These forward-looking statements are based upon the current expectations and beliefs of Okta’s management as of the date of this release, and are subject to certain risks and uncertainties that could cause actual results to differ materially from those described in the forward-looking statements including, without limitation, the risk of adverse and unpredictable macro-economic conditions and risks related to integration of the companies. All forward-looking statements in this press release are based on information available to the Company as of the date hereof, and Okta disclaims any obligation to update these forward-looking statements.\n\nAbout Okta\n\nOkta is the leading independent provider of identity for the enterprise. The Okta Identity Cloud enables organizations to securely connect the right people to the right technologies at the right time. With over 6,000 pre-built integrations to applications and infrastructure providers, Okta customers can easily and securely use the best technologies for their business. Over 6,100 organizations, including 20th Century Fox, JetBlue, Nordstrom, Slack, Teach for America and Twilio, trust Okta to help protect the identities of their workforces and customers.", "title": "Okta to Acquire Azuqua to Connect Business Applications in the Enterprise", "images": [], "text": "\n\n![Business Wire](/images/bwlogo_extreme.png)\n\n# Okta to Acquire Azuqua to Connect Business Applications in the\nEnterprise\n\n_Acquisition will further identity leader’s innovation in lifecycle\nmanagement, application workflows and automation_\n\nMarch 07, 2019 04:11 PM Eastern Standard Time\n\nSAN FRANCISCO--(BUSINESS WIRE)--Okta, Inc. (NASDAQ:OKTA), the leading\nindependent provider of identity for the enterprise, today announced it has\nentered into a definitive agreement to acquire Azuqua, a leader in no-code,\ncloud-based business application integration and workflow automation.\nTogether, Okta and Azuqua will provide organizations with a neutral,\nindependent control center for automating the business processes and the flow\nof identities between applications and services for everyone in an\norganization— from employees to partners, and customers. The proposed\nacquisition is expected to close during Okta’s fiscal first quarter, subject\nto the satisfaction of certain closing conditions.\n\n> As every company transforms itself into a technology company, the\nproliferation of apps and services that power the modern business must drive\nefficiency, innovation and seamless end user experiences across disparate\nsystems. According to Okta’s 2019 Businesses at Work Report, the average Okta\ncustomer has 83 cloud apps, and 9% of customers have more than 200 cloud apps.\nAs organizations choose and adopt best-of-breed technologies, they often\nstruggle to make all of their different applications and technologies work\ntogether, and to manage them at scale. Typically, IT organizations are forced\nto build and maintain custom integrations or rely on manual processes. The\ncost and friction involved has been a huge barrier to the adoption of new\ntechnology.\n\nOkta invested early in automation for provisioning and deprovisioning apps and\nservices with Okta’s Lifecycle Management product. With Azuqua, connectors are\npre-built and maintained, and workflows can be defined without code —\nultimately enabling companies to deliver connected digital experiences across\nthe organization and deliver tailored, repeatable customer journeys. The\nunifying power of identity through the Okta Identity Cloud combined with\nAzuqua’s modern, simple integration platform will enable customers to automate\nmore of their business processes and connect to even more apps. IT teams will\nbe able to use pre-built connectors and logic to create streamlined processes\nand increase operational speed. Product teams will be able to embed this\ntechnology in their own applications alongside Okta’s core authentication and\nuser management technology to build delightful, integrated customer\nexperiences.\n\n“Only a neutral, independent platform like the Okta Identity Cloud has the\ncapacity to ensure that every app in an organization is tightly integrated, so\nbusinesses can optimize productivity and deliver delightful customer\nexperiences. Identity is the unifying component that can make all of these\ntechnologies interact seamlessly and securely. Identity will power the next\nwave of movement to best-in-breed technology,” said Frederic Kerrest, Chief\nOperating Officer and co-founder of Okta. “Azuqua’s power to connect\napplications will multiply the benefits of the The Okta Integration Network\nfor Okta’s customers, enabling them to unlock data, create seamless business\nprocesses and eliminate cloud silos. We look forward to bringing on the Azuqua\nteam to further our vision to enable any organization to use any technology.”\n\n\"PlanGrid is used on more than 1.5 million construction projects, and teams\naround the world rely on our software to collaborate and increase\nproductivity,” said Tracy Young, head of PlanGrid at Autodesk. \"Okta and\nAzuqua play an integral role in connecting the people and technology that\nbrings PlanGrid into field workers' daily workflow. Azuqua helps us break down\ndata silos and Okta provides unprecedented security. Together they will become\nan industry standard, and deliver the scale our customers demand.”\n\nFounded in 2013, Azuqua is pioneering cloud-based integration and automation.\nCollectively, the Azuqua team has decades of experience building enterprise\ntechnology products, coming from companies like Microsoft, Tableau, VMware,\nTelstra and IBM. Nikhil Hasija, founder and chief product officer, will join\nOkta’s engineering team to help lead the company’s workflow automation\nstrategy, beginning with the integration of Azuqua’s workflow offering into\nOkta's Lifecycle Management product.\n\nCautionary Language Concerning Forward-Looking Statements\n\nThis press release contains forward-looking statements relating to\nexpectations, plans, and prospects including expectations relating to the\nbenefits that will be derived from this transaction. These forward-looking\nstatements are based upon the current expectations and beliefs of Okta’s\nmanagement as of the date of this release, and are subject to certain risks\nand uncertainties that could cause actual results to differ materially from\nthose described in the forward-looking statements including, without\nlimitation, the risk of adverse and unpredictable macro-economic conditions\nand risks related to integration of the companies. All forward-looking\nstatements in this press release are based on information available to the\nCompany as of the date hereof, and Okta disclaims any obligation to update\nthese forward-looking statements.\n\nAbout Okta\n\nOkta is the leading independent provider of identity for the enterprise. The\nOkta Identity Cloud enables organizations to securely connect the right people\nto the right technologies at the right time. With over 6,000 pre-built\nintegrations to applications and infrastructure providers, Okta customers can\neasily and securely use the best technologies for their business. Over 6,100\norganizations, including 20th Century Fox, JetBlue, Nordstrom, Slack, Teach\nfor America and Twilio, trust Okta to help protect the identities of their\nworkforces and customers.\n\n## Contacts\n\nJenna Kozel King \npress@okta.com\n\n## Contacts\n\nJenna Kozel King \npress@okta.com\n\n## Site Navigation\n\n Home\n Home\n Submit a Press Release\n Services\n News\n All News\n News with Multimedia\n News by Industry\n News by Subject\n News by Language\n Tradeshows & Events\n Education\n Overview\n Distribution & Media\n Media & Journalist Tools\n Sample Press Release\n Find Your News Online\n How-to\n Disclosure Resources\n About Us\n Overview\n Become a Member\n Contact Us\n Follow Us\n Careers\n Business Wire Newsroom\n Business Wire Events\n\n## Search\n\nAdvanced News Search\n\nAdvanced News Search ![Search](/images/icons/icon_search.gif)\n\n Log In\n Sign Up\n\n## Follow Us\n\n Twitter\n LinkedIn\n Google+\n\n## More from Business Wire\n\n Blog\n Apps\n UK/Ireland\n Deutschland\n France\n Hong Kong\n Italy\n Japan\n Tradeshownews.com\n\n## Business Wire Information\n\n Contact Us\n UK Tax Strategy\n Privacy Statement\n Terms of Use\n (C) 2019 Business Wire\n\nAccept the use of cookies Learn more\n\nI Accept\n\n", "contact_info": [{"name": "Jenna Kozel King", "email": "press@okta.com"}], "date": "March 07, 2019", "time": "04:11 PM", "published_date_time": "March 07, 2019 04:11 PM Eastern Standard Time", "sub_title": "Acquisition will further identity leader’s innovation in lifecycle \n      management, application workflows and automation", "entities": [{"company_name": "SAN FRANCISCO--(BUSINESS WIRE)--Okta, Inc.", "stock_name": "NASDAQ:OKTA"}], "company_1": "Okta", "company_2": "Azuqua"}