{"url": "https://www.businesswire.com/news/home/20190307005772/en/SugarCRM-Acquires-Collabspot-Email-Integration-Products", "body": "CUPERTINO, Calif.--(BUSINESS WIRE)--SugarCRM Inc.®, the company that helps organizations build better business relationships, today announced that it has acquired the Collabspot email integration products from Collabspot Pte Ltd. These tools provide improved integration with email, taking another step towards SugarCRM’s vision to deliver the most intuitive and collaborative user experience whilst eliminating all data entry.\n\nCollabspot, which launched in Singapore in 2012, integrates CRM systems with well-known email providers like Google and Microsoft, synchronizing emails, contacts and calendars to provide a 360-degree view of customers and communication with prospects.\n\nThe acquisition represents further progress for SugarCRM in its mission to develop an intuitive, collaborative tool that provides high quality actionable insights and recommendations based purely on the real time analysis of communications and information. It follows SugarCRM’s launch of Hint Insights last month, a tool that pushes proactive relevant signals and alerts to users via multiple channels to enable better decision-making.\n\nThe acquisition represents a strong signal in the SugarCRM growth story. Last week the business appointed Craig Charlton as its new CEO to lead its next stage of growth through a strategy of acquisition, an expanded product portfolio and organic growth.\n\nCharlton commented: “This acquisition represents a significant tech step forward as we look to further integrate business productivity suites and CRM, two of the biggest communication data sources for businesses.\n\n“Not only will it improve the quality of insight by ensuring that CRM is at the center of data and conversation, it also makes Sugar even more convenient and user-friendly for our customers. Looking forward, we’re excited about the prospect of integrating Collabspot into our core tools and future AI and predictive offerings.\n\n“The acquisition makes great sense for the business and for our users, who told us that they wanted a product like this to be part of our core offering. By maintaining our focus on innovation and listening to our customers’ needs we’ll continue to provide a market-leading CRM experience and grow by adding real value to the many businesses we support around the world.”\n\nFor more information, visit SugarCRM’s website at: https://www.sugarcrm.com/\n\nFor further information and interview opportunities, please contact Tom Coates at tom.coates@jaywingpr.com or 0044 113 323 5797 or Leigh Greenwood at leigh.greenwood@jaywingpr.com or 0044 113 323 5798.\n\nAbout SugarCRM\n\nSugarCRM enables businesses to create extraordinary customer relationships with the most empowering, adaptable and affordable customer relationship management (CRM) solution on the market. Unlike traditional CRM solutions that focus primarily on management and reporting, Sugar empowers the individual, coordinating the actions of customer-facing employees and equipping them with the right information at the right time to transform the customer experience.\n\nBased in Silicon Valley, SugarCRM is backed by Accel-KKR. More than 2 million individuals in over 120 countries rely on SugarCRM.\n\nTo learn more visit http://www.sugarcrm.com or follow @SugarCRM.\n\nNOTE: SugarCRM and the SugarCRM logo are registered trademarks of SugarCRM Inc. Third-party trademarks mentioned are the property of their respective owners.", "title": "SugarCRM Acquires Collabspot Email Integration Products", "images": [], "text": "\n\n![Business Wire](/images/bwlogo_extreme.png)\n\n# SugarCRM Acquires Collabspot Email Integration Products\n\nMarch 07, 2019 03:33 PM Eastern Standard Time\n\nCUPERTINO, Calif.--(BUSINESS WIRE)--SugarCRM Inc.®, the company that helps\norganizations build better business relationships, today announced that it has\nacquired the Collabspot email integration products from Collabspot Pte Ltd.\nThese tools provide improved integration with email, taking another step\ntowards SugarCRM’s vision to deliver the most intuitive and collaborative user\nexperience whilst eliminating all data entry.\n\n> Collabspot, which launched in Singapore in 2012, integrates CRM systems with\nwell-known email providers like Google and Microsoft, synchronizing emails,\ncontacts and calendars to provide a 360-degree view of customers and\ncommunication with prospects.\n\nThe acquisition represents further progress for SugarCRM in its mission to\ndevelop an intuitive, collaborative tool that provides high quality actionable\ninsights and recommendations based purely on the real time analysis of\ncommunications and information. It follows SugarCRM’s launch of Hint Insights\nlast month, a tool that pushes proactive relevant signals and alerts to users\nvia multiple channels to enable better decision-making.\n\nThe acquisition represents a strong signal in the SugarCRM growth story. Last\nweek the business appointed Craig Charlton as its new CEO to lead its next\nstage of growth through a strategy of acquisition, an expanded product\nportfolio and organic growth.\n\nCharlton commented: “This acquisition represents a significant tech step\nforward as we look to further integrate business productivity suites and CRM,\ntwo of the biggest communication data sources for businesses.\n\n“Not only will it improve the quality of insight by ensuring that CRM is at\nthe center of data and conversation, it also makes Sugar even more convenient\nand user-friendly for our customers. Looking forward, we’re excited about the\nprospect of integrating Collabspot into our core tools and future AI and\npredictive offerings.\n\n“The acquisition makes great sense for the business and for our users, who\ntold us that they wanted a product like this to be part of our core offering.\nBy maintaining our focus on innovation and listening to our customers’ needs\nwe’ll continue to provide a market-leading CRM experience and grow by adding\nreal value to the many businesses we support around the world.”\n\nFor more information, visit SugarCRM’s website at: https://www.sugarcrm.com/\n\nFor further information and interview opportunities, please contact Tom Coates\nat tom.coates@jaywingpr.com or 0044 113 323 5797 or Leigh Greenwood at\nleigh.greenwood@jaywingpr.com or 0044 113 323 5798.\n\nAbout SugarCRM\n\nSugarCRM enables businesses to create extraordinary customer relationships\nwith the most empowering, adaptable and affordable customer relationship\nmanagement (CRM) solution on the market. Unlike traditional CRM solutions that\nfocus primarily on management and reporting, Sugar empowers the individual,\ncoordinating the actions of customer-facing employees and equipping them with\nthe right information at the right time to transform the customer experience.\n\nBased in Silicon Valley, SugarCRM is backed by Accel-KKR. More than 2 million\nindividuals in over 120 countries rely on SugarCRM.\n\nTo learn more visit http://www.sugarcrm.com or follow @SugarCRM.\n\n_NOTE: SugarCRM and the SugarCRM logo are registered trademarks of\nSugarCRM Inc. Third-party trademarks mentioned are the property of their\nrespective owners._\n\n## Contacts\n\nTom Coates \ntom.coates@jaywingpr.com \n0044 113 323 5797 \nor \nLeigh Greenwood \nleigh.greenwood@jaywingpr.com \n0044 113 323 5798\n\n## Contacts\n\nTom Coates \ntom.coates@jaywingpr.com \n0044 113 323 5797 \nor \nLeigh Greenwood \nleigh.greenwood@jaywingpr.com \n0044 113 323 5798\n\n## Site Navigation\n\n Home\n Home\n Submit a Press Release\n Services\n News\n All News\n News with Multimedia\n News by Industry\n News by Subject\n News by Language\n Tradeshows & Events\n Education\n Overview\n Distribution & Media\n Media & Journalist Tools\n Sample Press Release\n Find Your News Online\n How-to\n Disclosure Resources\n About Us\n Overview\n Become a Member\n Contact Us\n Follow Us\n Careers\n Business Wire Newsroom\n Business Wire Events\n\n## Search\n\nAdvanced News Search\n\nAdvanced News Search ![Search](/images/icons/icon_search.gif)\n\n Log In\n Sign Up\n\n## Follow Us\n\n Twitter\n LinkedIn\n Google+\n\n## More from Business Wire\n\n Blog\n Apps\n UK/Ireland\n Deutschland\n France\n Hong Kong\n Italy\n Japan\n Tradeshownews.com\n\n## Business Wire Information\n\n Contact Us\n UK Tax Strategy\n Privacy Statement\n Terms of Use\n (C) 2019 Business Wire\n\nAccept the use of cookies Learn more\n\nI Accept\n\n", "contact_info": [{"name": "Tom Coates", "email": "tom.coates@jaywingpr.com", "phone": "113 323 5797"}, {"name": "Leigh Greenwood", "email": "leigh.greenwood@jaywingpr.com", "phone": "113 323 5798"}], "date": "March 07, 2019", "time": "03:33 PM Eastern Standard Time", "published_date_time": "March 07, 2019 03:33 PM Eastern Standard Time", "entities": [], "company_1": null, "company_2": "Collabspot Pte Ltd."}