{"url": "https://www.businesswire.com/news/home/20190307005743/en/Tribal-Acquires-Canada%E2%80%99s-AFN-Insurance-Brokers", "body": "NEWPORT BEACH, Calif.--(BUSINESS WIRE)--Tribal First, a division of Alliant Underwriting Solutions, has acquired AFN Insurance Brokerage. The acquisition pairs Canada’s First Nations insurance leader with the largest provider of insurance solutions to Tribal Nations in the U.S., expanding Tribal First’s geographical reach and service profile.\n\n“Tribal First is dedicated to providing customized insurance solutions to Native governments across North America,” said Sean McConlogue, President of Alliant Underwriting Solutions. “AFN brings a longstanding legacy of integrity and strength to our platform, and this alliance will enable us to provide powerful services and solutions that are new to the Canadian market.”\n\n“The AFN name is synonymous with strength, customization, and a careful attention to addressing the needs of Canada’s First Nations and stands in direct alignment with Tribal First’s longstanding mission in the U.S.,” said Robert Shearer, Executive Vice President and leader of Tribal First.\n\nFounded in 1998, AFN is a nationally incorporated insurance brokerage dedicated exclusively to serving First Nations across Canada. The Ottawa-based brokerage provides a full suite of products and services that include insurance, risk management, consulting, and employee benefits. AFN has access to leading international carriers and works directly with a large base of retail broker partners.\n\n“This is a powerful strategic alliance that will add considerable strength to the AFN team,” said Gil Saunders, Principal at AFN. “Tribal First’s large platform, strong market relationships, and dedicated team of specialists will enable us to provide significant value and results to both our broker partners and First Nations clients. Most importantly, Tribal First shares our core objective of designing and delivering customized solutions that are in the best interest of Canada’s First Nations.”\n\nThe acquisition continues the Northern expansion of Tribal First. In 2017, the firm acquired American Indian Health Services, an American Indian-owned organization dedicated to addressing the distinct healthcare needs of American Indian and Alaska Native Tribes and related enterprises.\n\nSaunders and the AFN team will join Alliant and continue to service clients from AFN’s Ottawa location. Terms of the agreement were not disclosed.\n\nAbout Tribal First\n\nTribal First, a specialized program of Alliant Underwriting Solutions, has focused exclusively on meeting the insurance and risk management needs of Native governments and enterprises since 1993. Tribal First is the largest provider of insurance solutions to Native America and a leader in the specialty areas of tribal business enterprises, including gaming, alternative energy, construction, and housing authorities. Tribal First’s TribalCare division provides a full range of health services customized for the needs of Tribal Nations.\n\nAbout Alliant Insurance Services\n\nHeadquartered in Newport Beach, CA, Alliant Insurance Services, Inc. provides property and casualty, workers’ compensation, employee benefits, surety, and financial products and services to clients nationwide, including public entities, tribal nations, healthcare, energy, law firms, real estate, construction, and other industry groups. More information is available on the company’s website at www.alliant.com.", "title": "Tribal First Acquires Canada’s AFN Insurance Brokers", "images": ["https://mms.businesswire.com/media/20190307005743/en/586992/21/AlliantLogo_155x114.jpg", "https://mms.businesswire.com/media/20190307005743/en/586992/2/AlliantLogo_155x114.jpg"], "text": "\n\n![Business Wire](/images/bwlogo_extreme.png)\n\n# Tribal First Acquires Canada’s AFN Insurance Brokers\n\nLongtime First Nations insurance leader joins Tribal First amid Northern\nexpansion\n\nMarch 07, 2019 03:01 PM Eastern Standard Time\n\nNEWPORT BEACH, Calif.--(BUSINESS WIRE)--Tribal First, a division of\nAlliant Underwriting Solutions, has acquired AFN Insurance Brokerage.\nThe acquisition pairs Canada’s First Nations insurance leader with the largest\nprovider of insurance solutions to Tribal Nations in the U.S., expanding\nTribal First’s geographical reach and service profile.\n\n> “Tribal First is dedicated to providing customized insurance solutions to\nNative governments across North America,” said Sean McConlogue, President of\nAlliant Underwriting Solutions. “AFN brings a longstanding legacy of integrity\nand strength to our platform, and this alliance will enable us to provide\npowerful services and solutions that are new to the Canadian market.”\n\n“The AFN name is synonymous with strength, customization, and a careful\nattention to addressing the needs of Canada’s First Nations and stands in\ndirect alignment with Tribal First’s longstanding mission in the U.S.,” said\nRobert Shearer, Executive Vice President and leader of Tribal First.\n\nFounded in 1998, AFN is a nationally incorporated insurance brokerage\ndedicated exclusively to serving First Nations across Canada. The Ottawa-based\nbrokerage provides a full suite of products and services that include\ninsurance, risk management, consulting, and employee benefits. AFN has access\nto leading international carriers and works directly with a large base of\nretail broker partners.\n\n“This is a powerful strategic alliance that will add considerable strength to\nthe AFN team,” said Gil Saunders, Principal at AFN. “Tribal First’s large\nplatform, strong market relationships, and dedicated team of specialists will\nenable us to provide significant value and results to both our broker partners\nand First Nations clients. Most importantly, Tribal First shares our core\nobjective of designing and delivering customized solutions that are in the\nbest interest of Canada’s First Nations.”\n\nThe acquisition continues the Northern expansion of Tribal First. In 2017, the\nfirm acquired American Indian Health Services, an American Indian-owned\norganization dedicated to addressing the distinct healthcare needs of American\nIndian and Alaska Native Tribes and related enterprises.\n\nSaunders and the AFN team will join Alliant and continue to service clients\nfrom AFN’s Ottawa location. Terms of the agreement were not disclosed.\n\nAbout Tribal First\n\nTribal First, a specialized program of Alliant Underwriting Solutions, has\nfocused exclusively on meeting the insurance and risk management needs of\nNative governments and enterprises since 1993. Tribal First is the largest\nprovider of insurance solutions to Native America and a leader in the\nspecialty areas of tribal business enterprises, including gaming, alternative\nenergy, construction, and housing authorities. Tribal First’s TribalCare\ndivision provides a full range of health services customized for the needs of\nTribal Nations.\n\nAbout Alliant Insurance Services\n\nHeadquartered in Newport Beach, CA, Alliant Insurance Services, Inc. provides\nproperty and casualty, workers’ compensation, employee benefits, surety, and\nfinancial products and services to clients nationwide, including public\nentities, tribal nations, healthcare, energy, law firms, real estate,\nconstruction, and other industry groups. More information is available on the\ncompany’s website at www.alliant.com.\n\n## Contacts\n\nLynda Lane \nSenior Vice President and Corporate Director \nMarketing and Corporate Communications \n(949) 260-5050 \nllane@alliant.com\n\n![](https://mms.businesswire.com/media/20190307005743/en/586992/2/AlliantLogo_155x114.jpg)\n\n## Release Summary\n\nTribal First, a division of Alliant Underwriting Solutions, has acquired\nCanada's AFN Insurance Brokerage.\n\n## Contacts\n\nLynda Lane \nSenior Vice President and Corporate Director \nMarketing and Corporate Communications \n(949) 260-5050 \nllane@alliant.com\n\n## Site Navigation\n\n Home\n Home\n Submit a Press Release\n Services\n News\n All News\n News with Multimedia\n News by Industry\n News by Subject\n News by Language\n Tradeshows & Events\n Education\n Overview\n Distribution & Media\n Media & Journalist Tools\n Sample Press Release\n Find Your News Online\n How-to\n Disclosure Resources\n About Us\n Overview\n Become a Member\n Contact Us\n Follow Us\n Careers\n Business Wire Newsroom\n Business Wire Events\n\n## Search\n\nAdvanced News Search\n\nAdvanced News Search ![Search](/images/icons/icon_search.gif)\n\n Log In\n Sign Up\n\n## Follow Us\n\n Twitter\n LinkedIn\n Google+\n\n## More from Business Wire\n\n Blog\n Apps\n UK/Ireland\n Deutschland\n France\n Hong Kong\n Italy\n Japan\n Tradeshownews.com\n\n## Business Wire Information\n\n Contact Us\n UK Tax Strategy\n Privacy Statement\n Terms of Use\n (C) 2019 Business Wire\n\nAccept the use of cookies Learn more\n\nI Accept\n\n", "contact_info": [{"name": "Lynda Lane", "other_information": ["Senior Vice President and Corporate Director", "Marketing and Corporate Communications"], "phone": "(949) 260-5050", "email": "llane@alliant.com"}], "date": "March 07, 2019", "time": "03:01 PM Eastern Standard Time", "published_date_time": "March 07, 2019 03:01 PM Eastern Standard Time", "sub_title": "Longtime First Nations insurance leader joins Tribal First amid \n      Northern expansion", "entities": [], "company_1": "Tribal First", "company_2": "Alliant Underwriting Solutions"}