{"url": "https://www.businesswire.com/news/home/20190308005308/en/Mastercard-Advances-Cross-Border-Capabilities-Acquisition-Transfast", "body": "PURCHASE, N.Y.--(BUSINESS WIRE)--Mastercard (NYSE: MA) today announced it has entered into an agreement to acquire Transfast, a global cross-border account-to-account money transfer network.\n\nTransfast will complement Mastercard’s wide range of payment solutions by increasing worldwide connectivity in the account-to-account space, enhancing compliance capabilities and offering more robust foreign exchange tools. Transfast currently supports the Mastercard Send solution for business-to-business and person-to-person payment services.\n\n“We believe Transfast gives us the strongest platform to immediately enhance our cross-border capabilities and further deliver on our strategy,” said Michael Miebach, chief product officer for Mastercard. “The addition of Transfast adds to our leading position in meeting business, government and consumer payments needs – whether B2B, P2P or other flows. Today’s news cements our collaboration and sets the stage to provide our customers a unique, ready-to-go solution upon closing.”\n\nGreater Transparency, Enhanced Connectivity\n\nWhen businesses send cross-border payments to their vendors and partners, they face higher costs, compliance requirements, and limited predictability of when the transaction will be completed. The combination of Mastercard and Transfast will offer applications that solve these challenges and provide greater transparency and certainty in such transactions.\n\nIt will also support financial institutions, digital platforms and other partners as they provide people and businesses the ability to send and receive money how and when they want to virtually any end point across more than 100 markets.\n\n“There are substantial synergies with Mastercard for even further growth across our products,” said Samish Kumar, CEO of Transfast. “Over the past 12 years, we have grown our capabilities to connect, track and settle transactions with almost every bank around the world via our curated and extensive network. We’ve worked in support of Mastercard Send and this feels like the natural next step in our relationship.”\n\nPrior to this announcement, Mastercard lapsed its offer for Earthport in order to focus on the integration and expansion of Transfast.\n\nTerms of the agreement were not disclosed. The transaction, which is anticipated to close in the second half of 2019, is subject to customary closing conditions.\n\nAbout Mastercard\n\nMastercard (NYSE: MA), www.mastercard.com, is a technology company in the global payments industry. Our global payments processing network connects consumers, financial institutions, merchants, governments and businesses in more than 210 countries and territories. Mastercard products and solutions make everyday commerce activities – such as shopping, traveling, running a business and managing finances – easier, more secure and more efficient for everyone. Follow us on Twitter @MastercardNews, join the discussion on the Beyond the Transaction Blog and subscribe for the latest news on the Engagement Bureau.\n\nAbout Transfast\n\nTransfast is a global cross-border payments network provider that covers over 125 countries across Asia, Europe, Africa, Americas and Australia. Our proprietary payment network, consisting of direct integrations with 300+ banks and other financial institutions enables person-to-person, business-to-person and business-to-business payments services to our partners via APIs, SFTP, web and mobile product applications. Our applications deliver compliance, risk management, currency conversion, liquidity management and multi-format messaging solutions to our clients, which include banks, financial institutions, e-commerce companies, and service marketplaces, as well as small businesses and individual consumers.\n\nTransfast is backed by GCP Capital Partners, a private equity investment firm managing three active funds with $1.4 billion in committed capital with financial technology as one of its core focus areas, and Apis Partners, a private equity investment firm managing two active funds focused on growth stage financial services, financial technology and financial infrastructure businesses.\n\nForward-Looking Statements\n\nThis press release contains forward-looking statements pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. All statements other than statements of historical facts may be forward-looking statements. When used in this press release, the words “believe,” “expect,” “could,” “may,” “would,” “will,” “trend” and similar words are intended to identify forward-looking statements. Examples of forward-looking statements include, but are not limited to, statements that relate to Mastercard’s future prospects, developments and business strategies, as well as Mastercard’s acquisition and operation of Transfast’s business. We caution you to not place undue reliance on these forward-looking statements, as they speak only as of the date they are made. Except for the company’s ongoing obligations under the U.S. federal securities laws, the company does not intend to update or otherwise revise the forward-looking information to reflect actual results of operations, changes in financial condition, changes in estimates, expectations or assumptions, changes in general economic or industry conditions or other circumstances arising and/or existing since the preparation of this press release or to reflect the occurrence of any unanticipated events.\n\nMany factors and uncertainties relating to the proposed transaction, our operations and our business environment, all of which are difficult to predict and many of which are outside of our control, influence whether any forward-looking statements can or will be achieved. Any one of these factors could cause our actual results or the impact of the acquisition to differ materially from those expressed or implied in writing in any forward-looking statements made by Mastercard or on its behalf. Such factors related to the completion and impact of the acquisition include, but are not limited to, whether all necessary conditions will be met, and whether the transaction will close on agreed terms and in a timely manner.\n\nFor additional information on other factors related to Mastercard’s overall business that could cause Mastercard’s actual results to differ materially from expected results, please see the company’s filings with the Securities and Exchange Commission, including the company’s Annual Report on Form 10-K for the year ended December 31, 2018, and any subsequent reports on Forms 10-Q and 8-K.", "title": "Mastercard Advances Cross-Border Capabilities with Acquisition of Transfast", "images": ["https://mms.businesswire.com/media/20190308005308/en/703302/2/Mastercard_Symbol_Brand.jpg", "https://mms.businesswire.com/media/20190308005308/en/703302/23/Mastercard_Symbol_Brand.jpg"], "text": "\n\n![Business Wire](/images/bwlogo_extreme.png)\n\n# Mastercard Advances Cross-Border Capabilities with Acquisition of\nTransfast\n\n_Proven P2P and B2B Network to Accelerate Scale and Growth_\n\nMarch 08, 2019 10:26 AM Eastern Standard Time\n\nPURCHASE, N.Y.--(BUSINESS WIRE)--Mastercard (NYSE: MA) today announced it has\nentered into an agreement to acquire Transfast, a global cross-border account-\nto-account money transfer network.\n\n> Transfast will complement Mastercard’s wide range of payment solutions by\nincreasing worldwide connectivity in the account-to-account space, enhancing\ncompliance capabilities and offering more robust foreign exchange tools.\nTransfast currently supports the Mastercard Send solution for business-to-\nbusiness and person-to-person payment services.\n\n“We believe Transfast gives us the strongest platform to immediately enhance\nour cross-border capabilities and further deliver on our strategy,” said\nMichael Miebach, chief product officer for Mastercard. “The addition of\nTransfast adds to our leading position in meeting business, government and\nconsumer payments needs – whether B2B, P2P or other flows. Today’s news\ncements our collaboration and sets the stage to provide our customers a\nunique, ready-to-go solution upon closing.”\n\nGreater Transparency, Enhanced Connectivity\n\nWhen businesses send cross-border payments to their vendors and partners, they\nface higher costs, compliance requirements, and limited predictability of when\nthe transaction will be completed. The combination of Mastercard and Transfast\nwill offer applications that solve these challenges and provide greater\ntransparency and certainty in such transactions.\n\nIt will also support financial institutions, digital platforms and other\npartners as they provide people and businesses the ability to send and receive\nmoney how and when they want to virtually any end point across more than 100\nmarkets.\n\n“There are substantial synergies with Mastercard for even further growth\nacross our products,” said Samish Kumar, CEO of Transfast. “Over the past 12\nyears, we have grown our capabilities to connect, track and settle\ntransactions with almost every bank around the world via our curated and\nextensive network. We’ve worked in support of Mastercard Send and this feels\nlike the natural next step in our relationship.”\n\nPrior to this announcement, Mastercard lapsed its offer for Earthport in order\nto focus on the integration and expansion of Transfast.\n\nTerms of the agreement were not disclosed. The transaction, which is\nanticipated to close in the second half of 2019, is subject to customary\nclosing conditions.\n\nAbout Mastercard\n\nMastercard (NYSE: MA), www.mastercard.com, is a technology company in the\nglobal payments industry. Our global payments processing network connects\nconsumers, financial institutions, merchants, governments and businesses in\nmore than 210 countries and territories. Mastercard products and solutions\nmake everyday commerce activities – such as shopping, traveling, running a\nbusiness and managing finances – easier, more secure and more efficient for\neveryone. Follow us on Twitter @MastercardNews, join the discussion on the\nBeyond the Transaction Blog and subscribe for the latest news on the\nEngagement Bureau.\n\nAbout Transfast\n\nTransfast is a global cross-border payments network provider that covers over\n125 countries across Asia, Europe, Africa, Americas and Australia. Our\nproprietary payment network, consisting of direct integrations with 300+ banks\nand other financial institutions enables person-to-person, business-to-person\nand business-to-business payments services to our partners via APIs, SFTP, web\nand mobile product applications. Our applications deliver compliance, risk\nmanagement, currency conversion, liquidity management and multi-format\nmessaging solutions to our clients, which include banks, financial\ninstitutions, e-commerce companies, and service marketplaces, as well as small\nbusinesses and individual consumers.\n\nTransfast is backed by GCP Capital Partners, a private equity investment firm\nmanaging three active funds with $1.4 billion in committed capital with\nfinancial technology as one of its core focus areas, and Apis Partners, a\nprivate equity investment firm managing two active funds focused on growth\nstage financial services, financial technology and financial infrastructure\nbusinesses.\n\nForward-Looking Statements\n\nThis press release contains forward-looking statements pursuant to the safe\nharbor provisions of the Private Securities Litigation Reform Act of 1995. All\nstatements other than statements of historical facts may be forward-looking\nstatements. When used in this press release, the words “believe,” “expect,”\n“could,” “may,” “would,” “will,” “trend” and similar words are intended to\nidentify forward-looking statements. Examples of forward-looking statements\ninclude, but are not limited to, statements that relate to Mastercard’s future\nprospects, developments and business strategies, as well as Mastercard’s\nacquisition and operation of Transfast’s business. We caution you to not place\nundue reliance on these forward-looking statements, as they speak only as of\nthe date they are made. Except for the company’s ongoing obligations under the\nU.S. federal securities laws, the company does not intend to update or\notherwise revise the forward-looking information to reflect actual results of\noperations, changes in financial condition, changes in estimates, expectations\nor assumptions, changes in general economic or industry conditions or other\ncircumstances arising and/or existing since the preparation of this press\nrelease or to reflect the occurrence of any unanticipated events.\n\nMany factors and uncertainties relating to the proposed transaction, our\noperations and our business environment, all of which are difficult to predict\nand many of which are outside of our control, influence whether any forward-\nlooking statements can or will be achieved. Any one of these factors could\ncause our actual results or the impact of the acquisition to differ materially\nfrom those expressed or implied in writing in any forward-looking statements\nmade by Mastercard or on its behalf. Such factors related to the completion\nand impact of the acquisition include, but are not limited to, whether all\nnecessary conditions will be met, and whether the transaction will close on\nagreed terms and in a timely manner.\n\nFor additional information on other factors related to Mastercard’s overall\nbusiness that could cause Mastercard’s actual results to differ materially\nfrom expected results, please see the company’s filings with the Securities\nand Exchange Commission, including the company’s Annual Report on Form 10-K\nfor the year ended December 31, 2018, and any subsequent reports on Forms 10-Q\nand 8-K.\n\n## Contacts\n\n_Investor Relations: Gina Accordino,_ _investor.relations@mastercard.com_ _,\n914-249-4565_ \n _Communications: Seth Eisen,_ _Seth.Eisen@mastercard.com_ _, 914-249-3153_\n\n![](https://mms.businesswire.com/media/20190308005308/en/703302/2/Mastercard_Symbol_Brand.jpg)\n\n## Release Summary\n\nMastercard today announced it has entered into an agreement to acquire\nTransfast, a global cross-border account-to-account money transfer network.\n\n## Contacts\n\n_Investor Relations: Gina Accordino,_ _investor.relations@mastercard.com_ _,\n914-249-4565_ \n _Communications: Seth Eisen,_ _Seth.Eisen@mastercard.com_ _, 914-249-3153_\n\n## Site Navigation\n\n Home\n Home\n Submit a Press Release\n Services\n News\n All News\n News with Multimedia\n News by Industry\n News by Subject\n News by Language\n Tradeshows & Events\n Education\n Overview\n Distribution & Media\n Media & Journalist Tools\n Sample Press Release\n Find Your News Online\n How-to\n Disclosure Resources\n About Us\n Overview\n Become a Member\n Contact Us\n Follow Us\n Careers\n Business Wire Newsroom\n Business Wire Events\n\n## Search\n\nAdvanced News Search\n\nAdvanced News Search ![Search](/images/icons/icon_search.gif)\n\n Log In\n Sign Up\n\n## Follow Us\n\n Twitter\n LinkedIn\n Google+\n\n## More from Business Wire\n\n Blog\n Apps\n UK/Ireland\n Deutschland\n France\n Hong Kong\n Italy\n Japan\n Tradeshownews.com\n\n## Business Wire Information\n\n Contact Us\n UK Tax Strategy\n Privacy Statement\n Terms of Use\n (C) 2019 Business Wire\n\nAccept the use of cookies Learn more\n\nI Accept\n\n", "contact_info": [{"name": "Gina Accordino", "email": "_investor.relations@mastercard.com", "phone": "914-249-4565"}, {"name": "Seth Eisen", "phone": "914-249-3153", "email": "_Seth.Eisen@mastercard.com"}], "date": "March 08, 2019", "time": "10:26 AM Eastern Standard Time", "published_date_time": "March 08, 2019 10:26 AM Eastern Standard Time", "sub_title": "Proven P2P and B2B Network to Accelerate Scale and Growth", "entities": [{"company_name": "PURCHASE, N.Y.--(BUSINESS WIRE)--Mastercard", "stock_name": "NYSE: MA"}], "company_1": null, "company_2": "Transfast"}