{"url": "https://www.businesswire.com/news/home/20190307005409/en/CORRECTING-REPLACING-Stockholders-Civitas-Solutions-Approve-Merger", "body": "BOSTON--(BUSINESS WIRE)--Please replace the release with the following corrected version due to multiple revisions.\n\nThe corrected release reads:\n\nSTOCKHOLDERS OF CIVITAS SOLUTIONS, INC. APPROVE MERGER WITH AN AFFILIATE OF CENTERBRIDGE PARTNERS, L.P.\n\nCivitas Solutions, Inc. (“Civitas” or the “Company”) (NYSE:CIVI) today announced that its stockholders approved the proposed merger of Civitas and Celtic Tier II Corp. (“Merger Sub”), a wholly owned subsidiary of Celtic Intermediate Corp. (“Parent”) and an affiliate of Centerbridge Partners, L.P., pursuant to the Agreement and Plan of Merger, dated as of December 18, 2018 (the “Merger Agreement”), by and among the Company, Merger Sub and Parent. Subject to the terms of the Merger Agreement, at the effective time of the merger, Merger Sub will merge with and into Civitas, with Civitas surviving the merger as a wholly-owned subsidiary of Parent.\n\nFinal voting results for Civitas’ special meeting of stockholders will be disclosed in a Form 8-K to be filed with the Securities and Exchange Commission (the “SEC”). The merger is expected to close on March 8, 2019, subject to the satisfaction of customary closing conditions.\n\nAbout Civitas\n\nCivitas Solutions, Inc. is the leading national provider of home- and community-based health and human services to must-serve individuals with intellectual, developmental, physical or behavioral disabilities and other special needs. Since its founding in 1980, it has evolved from a single residential program to a diversified national network offering an array of quality services in 36 states.\n\nAbout Centerbridge Partners\n\nCenterbridge Partners, L.P. is a private investment management firm employing a flexible approach across investment disciplines – from private equity to credit and related strategies, and real estate – in an effort to find the most attractive opportunities for our investors and business partners. The firm was founded in 2005 and as of September 2018 had approximately $27 billion in capital under management with offices in New York and London. Centerbridge is dedicated to partnering with world-class management teams across targeted industry sectors and geographies to help companies achieve their operating and financial objectives. For more information, please visit www.centerbridge.com.\n\nForward-Looking Statements\n\nCertain statements contained in this release may be considered forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, including statements regarding the expected timing and likelihood of completion of the transaction and other statements that are not historical facts. These forward-looking statements generally include statements that are predictive in nature and depend upon or refer to future events or conditions, and include words such as “believes,” “plans,” “anticipates,” “projects,” “estimates,” “expects,” “intends,” “strategy,” “future,” “opportunity,” “may,” “will,” “should,” “could,” “potential,” or similar expressions. Forward-looking statements are based on current beliefs and assumptions that are subject to risks and uncertainties. Forward-looking statements speak only as of the date they are made, and Civitas undertakes no obligation to update any of them publicly in light of new information or future events. Actual results could differ materially from those contained in any forward-looking statement as a result of various factors, including, without limitation: (1) conditions to the closing of the transaction may not be satisfied; (2) the transaction may involve unexpected costs, liabilities or delays; (3) the outcome of any legal proceedings related to the transaction; (4) the occurrence of any event, change or other circumstances that could give rise to the termination of the Merger Agreement; (5) the failure to obtain the necessary debt financing arrangements set forth in the commitment letters received in connection with the transaction; and (6) other risks to consummation of the transaction, including the risk that the transaction will not be consummated within the expected time period or at all. If the transaction is consummated, Civitas’ stockholders will cease to have any equity interest in Civitas and will have no right to participate in its earnings and future growth. Additional factors that may affect the future results of Civitas are set forth in its filings with the SEC, including its Annual Report on Form 10-K for the year ended September 30, 2018 and its Quarterly Report on Form 10-Q for the quarter ended December 31, 2018, which are available on the SEC’s website at www.sec.gov. Readers are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date hereof.", "title": "CORRECTING and REPLACING Stockholders of Civitas Solutions, Inc. Approve Merger with an Affiliate of Centerbridge Partners, L.P.", "images": ["https://mms.businesswire.com/media/20190307005409/en/446145/2/Civitas_1200_color-larger-01.jpg", "https://mms.businesswire.com/media/20190307005409/en/446145/21/Civitas_1200_color-larger-01.jpg"], "text": "\n\n![Business Wire](/images/bwlogo_extreme.png)\n\n# CORRECTING and REPLACING Stockholders of Civitas Solutions, Inc. Approve\nMerger with an Affiliate of Centerbridge Partners, L.P.\n\nCORRECTION...by Civitas Solutions, Inc.\n\nMarch 07, 2019 02:38 PM Eastern Standard Time\n\nBOSTON--(BUSINESS WIRE)--Please replace the release with the following\ncorrected version due to multiple revisions.\n\nThe corrected release reads:\n\nSTOCKHOLDERS OF CIVITAS SOLUTIONS, INC. APPROVE MERGER WITH AN AFFILIATE OF\nCENTERBRIDGE PARTNERS, L.P.\n\nCivitas Solutions, Inc. (“Civitas” or the “Company”) (NYSE:CIVI) today\nannounced that its stockholders approved the proposed merger of Civitas and\nCeltic Tier II Corp. (“Merger Sub”), a wholly owned subsidiary of Celtic\nIntermediate Corp. (“Parent”) and an affiliate of Centerbridge Partners, L.P.,\npursuant to the Agreement and Plan of Merger, dated as of December 18, 2018\n(the “Merger Agreement”), by and among the Company, Merger Sub and Parent.\nSubject to the terms of the Merger Agreement, at the effective time of the\nmerger, Merger Sub will merge with and into Civitas, with Civitas surviving\nthe merger as a wholly-owned subsidiary of Parent.\n\nFinal voting results for Civitas’ special meeting of stockholders will be\ndisclosed in a Form 8-K to be filed with the Securities and Exchange\nCommission (the “SEC”). The merger is expected to close on March 8, 2019,\nsubject to the satisfaction of customary closing conditions.\n\nAbout Civitas\n\nCivitas Solutions, Inc. is the leading national provider of home- and\ncommunity-based health and human services to must-serve individuals with\nintellectual, developmental, physical or behavioral disabilities and other\nspecial needs. Since its founding in 1980, it has evolved from a single\nresidential program to a diversified national network offering an array of\nquality services in 36 states.\n\nAbout Centerbridge Partners\n\nCenterbridge Partners, L.P. is a private investment management firm employing\na flexible approach across investment disciplines – from private equity to\ncredit and related strategies, and real estate – in an effort to find the most\nattractive opportunities for our investors and business partners. The firm was\nfounded in 2005 and as of September 2018 had approximately $27 billion in\ncapital under management with offices in New York and London. Centerbridge is\ndedicated to partnering with world-class management teams across targeted\nindustry sectors and geographies to help companies achieve their operating and\nfinancial objectives. For more information, please visit www.centerbridge.com.\n\nForward-Looking Statements\n\nCertain statements contained in this release may be considered forward-looking\nstatements within the meaning of Section 27A of the Securities Act of 1933, as\namended, and Section 21E of the Securities Exchange Act of 1934, as amended,\nincluding statements regarding the expected timing and likelihood of\ncompletion of the transaction and other statements that are not historical\nfacts. These forward-looking statements generally include statements that are\npredictive in nature and depend upon or refer to future events or conditions,\nand include words such as “believes,” “plans,” “anticipates,” “projects,”\n“estimates,” “expects,” “intends,” “strategy,” “future,” “opportunity,” “may,”\n“will,” “should,” “could,” “potential,” or similar expressions. Forward-\nlooking statements are based on current beliefs and assumptions that are\nsubject to risks and uncertainties. Forward-looking statements speak only as\nof the date they are made, and Civitas undertakes no obligation to update any\nof them publicly in light of new information or future events. Actual results\ncould differ materially from those contained in any forward-looking statement\nas a result of various factors, including, without limitation: (1) conditions\nto the closing of the transaction may not be satisfied; (2) the transaction\nmay involve unexpected costs, liabilities or delays; (3) the outcome of any\nlegal proceedings related to the transaction; (4) the occurrence of any event,\nchange or other circumstances that could give rise to the termination of the\nMerger Agreement; (5) the failure to obtain the necessary debt financing\narrangements set forth in the commitment letters received in connection with\nthe transaction; and (6) other risks to consummation of the transaction,\nincluding the risk that the transaction will not be consummated within the\nexpected time period or at all. If the transaction is consummated, Civitas’\nstockholders will cease to have any equity interest in Civitas and will have\nno right to participate in its earnings and future growth. Additional factors\nthat may affect the future results of Civitas are set forth in its filings\nwith the SEC, including its Annual Report on Form 10-K for the year ended\nSeptember 30, 2018 and its Quarterly Report on Form 10-Q for the quarter ended\nDecember 31, 2018, which are available on the SEC’s website at www.sec.gov.\nReaders are cautioned not to place undue reliance on these forward-looking\nstatements, which speak only as of the date hereof.\n\n## Contacts\n\nFor Civitas Solutions, Inc.: \nDwight Robson \nChief Public Strategy and Marketing Officer \n617-790-4800 \ndwight.robson@civitas-solutions.com\n\nFor Centerbridge: \nJeremy Fielding / Anntal Silver \nKekst CNC \n212-521-4800\n\n![](https://mms.businesswire.com/media/20190307005409/en/446145/2/Civitas_1200_color-\nlarger-01.jpg)\n\n## Contacts\n\nFor Civitas Solutions, Inc.: \nDwight Robson \nChief Public Strategy and Marketing Officer \n617-790-4800 \ndwight.robson@civitas-solutions.com\n\nFor Centerbridge: \nJeremy Fielding / Anntal Silver \nKekst CNC \n212-521-4800\n\n## Site Navigation\n\n Home\n Home\n Submit a Press Release\n Services\n News\n All News\n News with Multimedia\n News by Industry\n News by Subject\n News by Language\n Tradeshows & Events\n Education\n Overview\n Distribution & Media\n Media & Journalist Tools\n Sample Press Release\n Find Your News Online\n How-to\n Disclosure Resources\n About Us\n Overview\n Become a Member\n Contact Us\n Follow Us\n Careers\n Business Wire Newsroom\n Business Wire Events\n\n## Search\n\nAdvanced News Search\n\nAdvanced News Search ![Search](/images/icons/icon_search.gif)\n\n Log In\n Sign Up\n\n## Follow Us\n\n Twitter\n LinkedIn\n Google+\n\n## More from Business Wire\n\n Blog\n Apps\n UK/Ireland\n Deutschland\n France\n Hong Kong\n Italy\n Japan\n Tradeshownews.com\n\n## Business Wire Information\n\n Contact Us\n UK Tax Strategy\n Privacy Statement\n Terms of Use\n (C) 2019 Business Wire\n\nAccept the use of cookies Learn more\n\nI Accept\n\n", "contact_info": [{"name": "Dwight Robson", "other_information": ["Chief Public Strategy and Marketing Officer"], "phone": "617-790-4800", "email": "dwight.robson@civitas-solutions.com"}, {"name": "Jeremy Fielding / Anntal", "other_information": ["Jeremy Fielding / Anntal Silver", "Kekst CNC"], "phone": "212-521-4800"}], "date": "March 07, 2019", "time": "02:38 PM", "published_date_time": "March 07, 2019 02:38 PM Eastern Standard Time", "entities": [], "company_1": "The corrected release", "company_2": "L.P.\n\nCivitas Solutions"}