{"url": "https://www.businesswire.com/news/home/20190307005562/en/Glenmont-Acquires-Multifamily-Site-Greenville", "body": "NEW YORK--(BUSINESS WIRE)--Glenmont Capital Management, LLC, a New York-based real estate investment firm led by Managing Principal Lawrence A. Kestin, and Arlington Properties, Inc., a Birmingham-based real estate development firm led by Jim Dixon, announced the acquisition of a 19-acre site in the Verdae master-planned community of Greenville, South Carolina, for the development of Verdae III, a 276-unit Class-A apartment community. The planned development follows the success of Glenmont and Arlington’s development of Velo Verdae, a 262-unit Class A apartment immediately adjacent to the new site which was recently sold.\n\nThe property acquired in Verdae offers unparalleled convenience and is situated along two major roads, less than five miles from downtown Greenville. Verdae III will offer unit sizes, features, and amenities not feasible in Downtown Greenville, while maintaining a significant rent discount to Class-A product Downtown. Furthermore, the popular Swamp Rabbit Trail multimodal path is being extended and will run immediately adjacent to Verdae III, benefitting residents with direct access.\n\nConstruction will begin in Q1 2019, with move-ins scheduled to begin 12 months thereafter. Verdae III will represent the thirteenth multifamily project by Glenmont and Arlington since 2002.\n\n“Glenmont believes in the long-term prospects for Greenville. Development opportunities in strong secondary markets like it provide compelling risk-adjusted returns for sophisticated investors,” Mr. Kestin said. “The project is representative of Glenmont’s strategy to develop best-in-class, stabilized income-producing real estate assets, with increasing institutional support.”\n\nAbout Glenmont Capital Management\n\nGlenmont Capital Management, LLC, founded in 2000 by Lawrence A. Kestin, is a New York-based real estate private equity fund manager focused on real estate investments throughout the United States. Glenmont targets middle market turnaround situations and select new development investments in strong secondary cities with outstanding economic and demographic growth which offer the best long-term prospects. Glenmont manages a series of closed-end, institutionally-backed investment funds and direct investment vehicles.\n\nFor more information about Glenmont, visit www.glenmontcapital.com\n\nAbout Arlington Properties\n\nBirmingham, Alabama-based Arlington Properties Inc. is a leader in the acquisition, development, redevelopment, and management of multifamily and mixed-use properties. Founded in 1969, the stability and longevity of the company's associates creates satisfying long-term relationships with owners, residents, and investors. Arlington currently manages over 15,000 multifamily units across 10 states and has developed or rehabilitated nearly 30,000 multifamily units since its formation.\n\nFor more information about Arlington, visit www.arlingtonproperties.net", "title": "Glenmont Acquires Multifamily Site in Greenville", "images": [], "text": "\n\n![Business Wire](/images/bwlogo_extreme.png)\n\n# Glenmont Acquires Multifamily Site in Greenville\n\nMarch 07, 2019 11:59 AM Eastern Standard Time\n\nNEW YORK--(BUSINESS WIRE)--Glenmont Capital Management, LLC, a New York-based\nreal estate investment firm led by Managing Principal Lawrence A. Kestin, and\nArlington Properties, Inc., a Birmingham-based real estate development firm\nled by Jim Dixon, announced the acquisition of a 19-acre site in the Verdae\nmaster-planned community of Greenville, South Carolina, for the development of\nVerdae III, a 276-unit Class-A apartment community. The planned development\nfollows the success of Glenmont and Arlington’s development of Velo Verdae, a\n262-unit Class A apartment immediately adjacent to the new site which was\nrecently sold.\n\n> The property acquired in Verdae offers unparalleled convenience and is\nsituated along two major roads, less than five miles from downtown Greenville.\nVerdae III will offer unit sizes, features, and amenities not feasible in\nDowntown Greenville, while maintaining a significant rent discount to Class-A\nproduct Downtown. Furthermore, the popular Swamp Rabbit Trail multimodal path\nis being extended and will run immediately adjacent to Verdae III, benefitting\nresidents with direct access.\n\nConstruction will begin in Q1 2019, with move-ins scheduled to begin 12 months\nthereafter. Verdae III will represent the thirteenth multifamily project by\nGlenmont and Arlington since 2002.\n\n“Glenmont believes in the long-term prospects for Greenville. Development\nopportunities in strong secondary markets like it provide compelling risk-\nadjusted returns for sophisticated investors,” Mr. Kestin said. “The project\nis representative of Glenmont’s strategy to develop best-in-class, stabilized\nincome-producing real estate assets, with increasing institutional support.”\n\nAbout Glenmont Capital Management\n\nGlenmont Capital Management, LLC, founded in 2000 by Lawrence A. Kestin, is a\nNew York-based real estate private equity fund manager focused on real estate\ninvestments throughout the United States. Glenmont targets middle market\nturnaround situations and select new development investments in strong\nsecondary cities with outstanding economic and demographic growth which offer\nthe best long-term prospects. Glenmont manages a series of closed-end,\ninstitutionally-backed investment funds and direct investment vehicles.\n\nFor more information about Glenmont, visit www.glenmontcapital.com\n\nAbout Arlington Properties\n\nBirmingham, Alabama-based Arlington Properties Inc. is a leader in the\nacquisition, development, redevelopment, and management of multifamily and\nmixed-use properties. Founded in 1969, the stability and longevity of the\ncompany's associates creates satisfying long-term relationships with owners,\nresidents, and investors. Arlington currently manages over 15,000 multifamily\nunits across 10 states and has developed or rehabilitated nearly 30,000\nmultifamily units since its formation.\n\nFor more information about Arlington, visit www.arlingtonproperties.net\n\n## Contacts\n\nLawrence Kestin, Managing Principal \nlkestin@glenmontcapital.com\n\n## Contacts\n\nLawrence Kestin, Managing Principal \nlkestin@glenmontcapital.com\n\n## Site Navigation\n\n Home\n Home\n Submit a Press Release\n Services\n News\n All News\n News with Multimedia\n News by Industry\n News by Subject\n News by Language\n Tradeshows & Events\n Education\n Overview\n Distribution & Media\n Media & Journalist Tools\n Sample Press Release\n Find Your News Online\n How-to\n Disclosure Resources\n About Us\n Overview\n Become a Member\n Contact Us\n Follow Us\n Careers\n Business Wire Newsroom\n Business Wire Events\n\n## Search\n\nAdvanced News Search\n\nAdvanced News Search ![Search](/images/icons/icon_search.gif)\n\n Log In\n Sign Up\n\n## Follow Us\n\n Twitter\n LinkedIn\n Google+\n\n## More from Business Wire\n\n Blog\n Apps\n UK/Ireland\n Deutschland\n France\n Hong Kong\n Italy\n Japan\n Tradeshownews.com\n\n## Business Wire Information\n\n Contact Us\n UK Tax Strategy\n Privacy Statement\n Terms of Use\n (C) 2019 Business Wire\n\nAccept the use of cookies Learn more\n\nI Accept\n\n", "contact_info": [{"name": "Lawrence Kestin", "other_information": ["Lawrence Kestin, Managing Principal"], "email": "lkestin@glenmontcapital.com"}], "date": "March 07, 2019 11:59 AM Eastern Standard Time", "published_date_time": "March 07, 2019 11:59 AM Eastern Standard Time", "entities": [], "company_1": "Glenmont Capital Management", "company_2": "Principal Lawrence A. Kestin"}