{"url": "https://www.businesswire.com/news/home/20190307005499/en/Guidepost-Solutions-Acquires-Custom-Information-Services", "body": "WASHINGTON--(BUSINESS WIRE)--Guidepost Solutions, a global leader in compliance, investigations, and security consulting, today announced the acquisition of Custom Information Services (CIS), a specialized provider of bespoke investigation, intelligence, and reputation management services in the Americas. CIS’s deep experience in Latin America significantly expands upon Guidepost Solutions’ existing offering in the region for clients facing a broad range of investigations challenges.\n\nWith staff based in Miami, Bogota, Los Angeles, and New York, and resources throughout the Latam region, CIS provides private investigations and intelligence for companies and governments. Most of its efforts are focused upon high-risk cross-border litigation and complex business disputes of great impact in Latin America, the United States, and international arbitration settings. Clients include law firms, corporate lawyers, and multinational companies, in addition to senior executives and business leaders requiring critical information to ensure effective decision-making processes.\n\n“ With this strategic acquisition, we’ve made a strong investment in the Latin American region, continuing to develop our footprint there to meet our clients’ growing needs across global markets,” said Guidepost Solutions CEO Julie Myers Wood. “ CIS has an outstanding reputation for its unique experience, depth of knowledge, and record of achieving results and we’re pleased to integrate its team into ours. The acquisition also expands our ability to service the Miami and South Florida areas, markets which we believe are poised for growth.”\n\nCIS was founded in 2011 by Sam Anson, a veteran investigator and former head of Latin America for Kroll. He is joined on the CIS leadership team by Yohir Akerman, Andres Otero, and Robert Jenkins. Akerman, a lawyer, political scientist, and economist by training, was a Latin American focused journalist before becoming an investigator. Otero is a lawyer by training. His experience includes president and co-founder of ON Partners, a consulting firm that advised the Mexican government and private sector clients on security, integrity, and compliance issues. Jenkins is a career investigator, who formerly served as the director of operations for a leading investigative services firm. The firm’s strength lies in handling complex cases and finding information in the most demanding environments.\n\n“ We are excited to join forces with an industry leader like Guidepost Solutions and are confident our expertise and global perspective will provide significant benefits to the firm and its clients,” said Mr. Anson. “ Our clients have always relied upon us for professional judgment in order to better evaluate risks, procure hard-to-find information, and offer tailored solutions to their problems.”\n\nWith this acquisition, Guidepost Solutions builds upon the growth the firm has undergone over the past several years in Spanish-speaking markets. A natural extension of Guidepost Solutions’ existing capabilities in Latin America and South Florida, the addition of employees in these key markets will strengthen the firm’s ability to offer top-end investigative services in areas such as litigation support, transnational investigations, due diligence, and internal fraud and anti-corruption investigations.\n\nAbout Guidepost Solutions LLC\n\nIn a world where change is certain, experience is the best protection. Guidepost Solutions offers global investigations, compliance and monitoring, and security and technology consulting solutions in a wide range of industries. With headquarters in New York, Guidepost Solutions maintains offices in key markets including Bogota; Boston; Chicago; Dallas; Honolulu; London; Los Angeles; Miami, Oakland; Palm Beach; Sacramento; San Francisco; Seattle; Singapore; and Washington, D.C. For more information, visit www.guidepostsolutions.com.", "title": "Guidepost Solutions Acquires Custom Information Services", "images": [], "text": "\n\n![Business Wire](/images/bwlogo_extreme.png)\n\n# Guidepost Solutions Acquires Custom Information Services\n\n_Expands Presence in Latin America and Miami With Acquisition of Global\nInvestigations Firm_\n\nMarch 07, 2019 11:03 AM Eastern Standard Time\n\nWASHINGTON--(BUSINESS WIRE)--Guidepost Solutions, a global leader in\ncompliance, investigations, and security consulting, today announced the\nacquisition of Custom Information Services (CIS), a specialized provider of\nbespoke investigation, intelligence, and reputation management services in the\nAmericas. CIS’s deep experience in Latin America significantly expands upon\nGuidepost Solutions’ existing offering in the region for clients facing a\nbroad range of investigations challenges.\n\nWith staff based in Miami, Bogota, Los Angeles, and New York, and resources\nthroughout the Latam region, CIS provides private investigations and\nintelligence for companies and governments. Most of its efforts are focused\nupon high-risk cross-border litigation and complex business disputes of great\nimpact in Latin America, the United States, and international arbitration\nsettings. Clients include law firms, corporate lawyers, and multinational\ncompanies, in addition to senior executives and business leaders requiring\ncritical information to ensure effective decision-making processes.\n\n“With this strategic acquisition, we’ve made a strong investment in the Latin\nAmerican region, continuing to develop our footprint there to meet our\nclients’ growing needs across global markets,” said Guidepost Solutions CEO\nJulie Myers Wood. “CIS has an outstanding reputation for its unique\nexperience, depth of knowledge, and record of achieving results and we’re\npleased to integrate its team into ours. The acquisition also expands our\nability to service the Miami and South Florida areas, markets which we believe\nare poised for growth.”\n\nCIS was founded in 2011 by Sam Anson, a veteran investigator and former head\nof Latin America for Kroll. He is joined on the CIS leadership team by Yohir\nAkerman, Andres Otero, and Robert Jenkins. Akerman, a lawyer, political\nscientist, and economist by training, was a Latin American focused journalist\nbefore becoming an investigator. Otero is a lawyer by training. His experience\nincludes president and co-founder of ON Partners, a consulting firm that\nadvised the Mexican government and private sector clients on security,\nintegrity, and compliance issues. Jenkins is a career investigator, who\nformerly served as the director of operations for a leading investigative\nservices firm. The firm’s strength lies in handling complex cases and finding\ninformation in the most demanding environments.\n\n“We are excited to join forces with an industry leader like Guidepost\nSolutions and are confident our expertise and global perspective will provide\nsignificant benefits to the firm and its clients,” said Mr. Anson. “Our\nclients have always relied upon us for professional judgment in order to\nbetter evaluate risks, procure hard-to-find information, and offer tailored\nsolutions to their problems.”\n\nWith this acquisition, Guidepost Solutions builds upon the growth the firm has\nundergone over the past several years in Spanish-speaking markets. A natural\nextension of Guidepost Solutions’ existing capabilities in Latin America and\nSouth Florida, the addition of employees in these key markets will strengthen\nthe firm’s ability to offer top-end investigative services in areas such as\nlitigation support, transnational investigations, due diligence, and internal\nfraud and anti-corruption investigations.\n\nAbout Guidepost Solutions LLC\n\nIn a world where change is certain, experience is the best protection.\nGuidepost Solutions offers global investigations, compliance and monitoring,\nand security and technology consulting solutions in a wide range of\nindustries. With headquarters in New York, Guidepost Solutions maintains\noffices in key markets including Bogota; Boston; Chicago; Dallas; Honolulu;\nLondon; Los Angeles; Miami, Oakland; Palm Beach; Sacramento; San Francisco;\nSeattle; Singapore; and Washington, D.C. For more information, visit\nwww.guidepostsolutions.com.\n\n## Contacts\n\nPerry Goldman, Montieth & Company \n646.864.3568, pgoldman@montiethco.com\n\n## Release Summary\n\nGuidepost Solutions acquires global investigations firm Custom Information\nServices, expanding presence in Latin America and Miami.\n\n## Contacts\n\nPerry Goldman, Montieth & Company \n646.864.3568, pgoldman@montiethco.com\n\n## Site Navigation\n\n Home\n Home\n Submit a Press Release\n Services\n News\n All News\n News with Multimedia\n News by Industry\n News by Subject\n News by Language\n Tradeshows & Events\n Education\n Overview\n Distribution & Media\n Media & Journalist Tools\n Sample Press Release\n Find Your News Online\n How-to\n Disclosure Resources\n About Us\n Overview\n Become a Member\n Contact Us\n Follow Us\n Careers\n Business Wire Newsroom\n Business Wire Events\n\n## Search\n\nAdvanced News Search\n\nAdvanced News Search ![Search](/images/icons/icon_search.gif)\n\n Log In\n Sign Up\n\n## Follow Us\n\n Twitter\n LinkedIn\n Google+\n\n## More from Business Wire\n\n Blog\n Apps\n UK/Ireland\n Deutschland\n France\n Hong Kong\n Italy\n Japan\n Tradeshownews.com\n\n## Business Wire Information\n\n Contact Us\n UK Tax Strategy\n Privacy Statement\n Terms of Use\n (C) 2019 Business Wire\n\nAccept the use of cookies Learn more\n\nI Accept\n\n", "contact_info": [{"name": "Perry Goldman", "other_information": ["Perry Goldman, Montieth & Company"], "phone": "646.864.3568", "email": "pgoldman@montiethco.com"}], "date": "March 07, 2019", "time": "11:03 AM Eastern Standard Time", "published_date_time": "March 07, 2019 11:03 AM Eastern Standard Time", "sub_title": "Expands Presence in Latin America and Miami With Acquisition of \n      Global Investigations Firm", "entities": [], "company_1": "Guidepost Solutions", "company_2": "Custom Information Services"}