{"url": "https://www.businesswire.com/news/home/20190304005438/en/Newmont-Board-Unanimously-Determines-Barrick%E2%80%99s-Unsolicited-Negative", "body": "DENVER--(BUSINESS WIRE)--Newmont Mining Corporation (NYSE: NEM) (Newmont or the Company) today announced that its Board of Directors has unanimously determined that Barrick Gold Corporation’s (Barrick) (NYSE: GOLD) (TSX: ABX) unsolicited, all-stock negative premium proposal to acquire Newmont is not in the best interests of Newmont’s shareholders.\n\nAfter a comprehensive review conducted in consultation with its financial and legal advisors, Newmont’s Board unanimously concluded that Barrick’s proposal does not constitute, and would not reasonably be expected to constitute, a Newmont Superior Proposal (as such term is defined in the arrangement agreement between Newmont and Goldcorp Inc. (NYSE: GG, TSX: G) (Goldcorp)). The Company’s previously announced combination with Goldcorp represents a superior value creation opportunity to generate long-term value through an unmatched portfolio of world class operations, projects, exploration opportunities, reserves and talent.\n\n“Our thorough review of Barrick’s unsolicited proposal and its associated risks has reaffirmed our conclusion that the combination of Newmont and Goldcorp represents the best opportunity to create value for Newmont’s shareholders and deliver industry-leading returns for decades to come,” said Gary Goldberg, Newmont’s Chief Executive Officer. “Unlike Barrick, Newmont Goldcorp will be centered in the world’s most favorable mining jurisdictions and gold districts. The combination with Goldcorp is significantly more accretive to Newmont’s shareholders on all relevant metrics compared to Barrick’s proposal, even when factoring in Barrick’s own synergy estimates. Realizing value through Barrick’s proposal for Newmont’s shareholders hinges entirely on a new management team that lacks global operating experience and is only two months into its own transformational integration.”\n\nNewmont Goldcorp Combination Represents Superior Value Creation Opportunity Over Barrick’s Proposal\n\nThe Newmont Board of Directors’ unanimous determination that the combination with Goldcorp represents a superior value creation opportunity over Barrick’s unsolicited proposal is based on the following:\n\nThe Goldcorp transaction generates twice the accretion to Newmont’s Net Asset Value (NAV) per share compared to Barrick’s proposal, even when factoring in Barrick’s unsubstantiated synergy assumptions.\n\nBarrick’s proposal is four percent (4%) dilutive to Newmont’s NAV per share, before any synergies. i\n\nThe value creation claimed in Barrick’s proposal relies entirely on the delivery of synergies from a management team that lacks global operating experience and is only two months into its integration effort with Randgold Resources Ltd.\n\nBarrick’s portfolio includes numerous unfavorable and high-risk jurisdictions with several ongoing and significant operational and sustainability problems.\n\nBy contrast, Newmont Goldcorp’s assets will be located in favorable mining jurisdictions and prolific gold districts on four continents.\n\nCompleting the Newmont transaction with Goldcorp does not preclude Newmont or Barrick from achieving the available synergies in Nevada through a joint venture and may permit them to be realized sooner.\n\nBecause Newmont’s Board determined that the Barrick proposal is not a “Newmont Superior Proposal” under the Goldcorp arrangement agreement, Newmont is prohibited under the provisions of that agreement from engaging with Barrick in relation to its proposal.\n\nProposed Nevada Joint Venture with Barrick\n\nTo realize the savings from Newmont’s and Barrick’s Nevada-related operations, Newmont today submitted a joint venture proposal to Barrick. The terms of the proposal are modeled on similar terms to other successful joint ventures, including ones that Barrick has with Newmont and Goldcorp.\n\nMr. Goldberg continued, “Newmont has consistently expressed to Barrick that we are open to a joint venture for our operations in Nevada. In that regard, today we have submitted a term sheet to Barrick proposing a Nevada joint venture. This proposal would enable both companies’ shareholders to realize the available synergies while avoiding the significant risks and complexities associated with Barrick’s unsolicited proposal.”\n\nKey terms of the joint venture proposal to combine the Nevada-related operations of Newmont Goldcorp and Barrick include:\n\nEconomic Interests : Barrick to hold an economic interest equal to 55 percent and Newmont Goldcorp to hold a 45 percent economic interest. The proposed economic interests are based upon analyst consensus Net Present Values for each company’s Nevada-related assets and an equal split of Barrick’s estimated Nevada synergies.\n\n: Barrick to hold an economic interest equal to 55 percent and Newmont Goldcorp to hold a 45 percent economic interest. The proposed economic interests are based upon analyst consensus Net Present Values for each company’s Nevada-related assets and an equal split of Barrick’s estimated Nevada synergies. Governance: Newmont Goldcorp and Barrick will have an equal number of representatives on the Management and Technical Committees. Decisions by the Management Committee shall be determined by majority vote, with the voting power of the parties’ representatives based on their respective economic interests, subject to a list of customary material matters requiring joint approval. The proposed joint venture’s Operational Management will be jointly appointed by both parties and will be responsible for day-to-day operations.\n\n“We are confident that Newmont’s demonstrated technical expertise and consistent execution will be critical in realizing the synergy opportunities of the proposed joint venture,” said Tom Palmer, Newmont’s President and Chief Operating Officer.\n\nNewmont Goldcorp\n\nNewmont has also filed an updated investor presentation regarding the compelling value creation opportunity of the Newmont Goldcorp transaction. Newmont’s proposed combination with Goldcorp is expected to close in the second quarter of 2019.\n\nOn day one after the transaction closes, Newmont Goldcorp will:\n\nBe accretive to Newmont’s NAV per share by 27 percent and 34 percent accretive to 2020 cash flow per share; i\n\nBegin delivering a combined $365 million in expected annual pre-tax synergies, supply chain efficiencies and Full Potential improvements representing the opportunity to create $4.4 billion in Net Present Value (pre-tax); ii\n\nTarget 6-7 million ounces of steady-state gold production over a decades-long time horizon; i\n\nHave the largest gold Reserves and Resources in the gold sector, including on a per share basis;\n\nBe located in favorable mining jurisdictions and prolific gold districts on four continents;\n\nDeliver the highest dividend among senior gold producers; iii\n\nOffer financial flexibility and an investment-grade balance sheet to advance the most promising projects generating a targeted Internal Rate of Return (IRR) of at least 15 percent; iv\n\nFeature a deep bench of accomplished business leaders and high-performing technical teams and other talent with extensive mining industry experience; and\n\nMaintain industry leadership in environmental, social and governance performance.\n\nNewmont today sent the following letter to Barrick’s Executive Chairman, John L. Thornton, and President and Chief Executive Officer, Mark Bristow:\n\nNewmont Mining\n\nCorporation 6363 South\n\nFiddlers Green Circle\n\nGreenwood Village, CO\n\n80111\n\nT (303) 863-7414\n\nF (303) 837-5837\n\nwww.newmont.com\n\nMarch 4, 2019\n\nBoard of Directors\n\nBARRICK GOLD CORPORATION\n\nTD Canada Trust Tower 161 Bay\n\nStreet, Suite 3700\n\nToronto, ON M5J 2S1 Canada\n\nAttn.: John L. Thornton, Executive Chairman Mark Bristow, President and Chief Executive Officer\n\nDear John and Mark:\n\nRe: February 25, 2019 Letter\n\nOur board of directors and senior management, with the assistance of our advisors, have undertaken an intensive and detailed review and analysis of your February 25, 2019 letter proposing to acquire all of the outstanding shares of common stock of Newmont Mining Corporation. Consistent with its focus on the best interests of our company and its stakeholders and on maximizing stockholder value for the long-term, our board has determined that the proposal set forth in your letter does not constitute, and would not reasonably be expected to constitute, a Newmont Superior Proposal (as such term is defined in the arrangement agreement dated January 14, 2019 between Newmont and Goldcorp Inc., as amended on February 19, 2019). Accordingly, Newmont is not permitted to engage in discussions and negotiations with Barrick Gold Corporation with respect to its proposal, nor are such actions required by the fiduciary duties of our board of directors. Therefore, in accordance with our contractual obligations under the Goldcorp arrangement agreement and consistent with our judgment as to the best interests of Newmont’s stockholders, we will proceed with our transaction with Goldcorp. We believe that transaction provides greater value to the Newmont stockholders and is superior from the perspective of Newmont’s other stakeholders.\n\nWe believe that the transaction you are proposing would reduce, rather than enhance, Newmont stockholder value. Your “at market” proposal is at a material discount to current market values, and any potential value creation depends entirely on Barrick’s execution. Since previous merger discussions terminated in 2014, Newmont has significantly outperformed Barrick on almost every metric. Our management team has a consistent, long-standing track record of delivering superior execution (including productivity improvements and cost reduction measures) through a proven, scalable operating model and deep bench strength supporting thoughtful and structured succession planning. In contrast, Barrick’s underperformance highlights its ineffective operating model, poor record on delivering stockholder returns, and significant jurisdictional risk. The basis for our board’s determinations have been and will continue to be detailed in our public disclosures.\n\nThe value creation of Barrick’s proposal relies entirely upon the delivery of synergies from a management team that was put in place just two months ago. This new team has never managed a global portfolio the size of Barrick, let alone the size of a potential Newmont and Barrick combination. From a stockholder perspective, how a company conducts its business is an important component of value. In addition to compelling economic performance, Newmont has maintained industry leadership in environmental, social and governance performance and, unlike Barrick and Randgold Resources Ltd., has generally avoided material operational, governmental and investment pitfalls. Moreover, Newmont is committed to strong governance practices and has been recognized for having a culture that values responsible corporate citizenship, inclusion and diversity. Barrick’s expressed disdain for process and oversight, and its absence of diversity of leadership, including in its board room, runs contrary to the expressed values of Newmont, our employees, our stockholders and our other valued stakeholders. For all of these reasons, we strongly believe that our stockholders are far better off as owners of Newmont Goldcorp Corporation than as holders of a minority stake in Barrick, a far less attractive entity.\n\nWe recognize that there are value-creation opportunities available in Nevada if we work together. We have always been, and we remain, prepared to explore these opportunities, despite your public comments to the contrary. Achieving these opportunities does not require Newmont to be acquired by Barrick, and for our stockholders to be exposed to the many risks inherent in Barrick. To facilitate the realization of the potential synergies, we are providing you with a term sheet for a joint venture that would combine our Nevada operations and create value for both sets of stockholders. We are prepared to move forward with you on this basis expeditiously.\n\nOur board of directors, our management team and our thousands of employees around the world are dedicated to creating value for all of our stockholders and that is exactly what we will continue to do by executing on our strategic plan and completing our pending transaction with Goldcorp.\n\nOn behalf of our board of directors,\n\nNoreen Doyle\n\nChair\n\nGary J. Goldberg\n\nChief Executive Officer\n\nAdvisors and counsel\n\nIn connection with the transaction, Newmont has retained BMO Capital Markets, Citi and Goldman Sachs as financial advisors, and Wachtell, Lipton, Rosen & Katz, Goodmans LLP, and White & Case LLP as legal counsel.\n\nConference Call and Webcast\n\nNewmont will host a conference call and a webcast on Monday, March 4, 2019 at 9:00 AM Eastern Time. Presentation slides will accompany the live webcast and can be accessed on the Newmont website, www.newmont.com and https://event.on24.com/wcc/r/1952473/C5AC3067BE6C7740A2D324BE629DA649.\n\nConference Call Details Dial-In Number 1-855-209-8210 Intl Dial-In Number 1-412-317-5213 Canada Toll Free Conference Name 1-855-669-9658 Newmont Mining Replay Number 1-877-344-7529 Intl Replay Number 1-412-317-0088 Replay Access Code 10129346\n\nAbout Newmont\n\nNewmont is a leading gold and copper producer. The Company’s operations are primarily in the United States, Australia, Ghana, Peru and Suriname. Newmont is the only gold producer listed in the S&P 500 Index and was named the mining industry leader by the Dow Jones Sustainability World Index in 2015, 2016, 2017 and 2018. The Company is an industry leader in value creation, supported by its leading technical, environmental, social and safety performance. Newmont was founded in 1921 and has been publicly traded since 1925.\n\nCautionary Statement Regarding Forward-Looking Statements:\n\nThis press release contains “forward-looking statements” within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, which are intended to be covered by the safe harbor created by such sections and other applicable laws and “forward-looking information” within the meaning of applicable Canadian securities laws. Where a forward-looking statement expresses or implies an expectation or belief as to future events or results, such expectation or belief is expressed in good faith and believed to have a reasonable basis. However, such statements are subject to risks, uncertainties and other factors, which could cause actual results to differ materially from future results expressed, projected or implied by the forward-looking statements. Forward-looking statements often address our expected future business and financial performance and financial condition, and often contain words such as “anticipate,” “intend,” “plan,” “will,” “would,” “estimate,” “expect,” “believe,” “target,” “indicative,” “preliminary,” or “potential.” Forward-looking statements in this press release may include, without limitation: (i) statements relating to Newmont’s planned acquisition of Goldcorp (the “proposed transaction”) and the expected terms, timing and closing of the proposed transaction, including receipt of required approvals and satisfaction of other customary closing conditions; (ii) estimates of future production and sales, including expected annual production range; (iii) estimates of future costs applicable to sales and all-in sustaining costs; (iv) expectations regarding accretion; (v) estimates of future capital expenditures; (vi) estimates of future cost reductions, efficiencies and synergies; (vii) expectations regarding future exploration and the development, growth and potential of Newmont’s and Goldcorp’s operations, project pipeline and investments, including, without limitation, project returns, expected average IRR, schedule, decision dates, mine life, commercial start, first production, capital average production, average costs and upside potential; (viii) expectations regarding future investments or divestitures; (ix) expectations of future dividends and returns to stockholders; (x) expectations of future free cash flow generation, liquidity, balance sheet strength and credit ratings; (xi) expectations of future equity and enterprise value; (xii) expectations of future plans and benefits; (xiii) expectations regarding future mineralization, including, without limitation, expectations regarding reserves and resources, grade and recoveries; (xiv) estimates of future closure costs and liabilities; (xv) statements relating to the proposed acquisition of Newmont by Barrick, including potential dilution, synergies and value creation, and (xvi) the possible joint venture in Nevada, including the potential terms and benefits thereof. Estimates or expectations of future events or results are based upon certain assumptions, which may prove to be incorrect. Such assumptions, include, but are not limited to: (i) there being no significant change to current geotechnical, metallurgical, hydrological and other physical conditions; (ii) permitting, development, operations and expansion of Newmont’s and Goldcorp’s operations and projects being consistent with current expectations and mine plans, including, without limitation, receipt of export approvals; (iii) political developments in any jurisdiction in which Newmont and Goldcorp operate being consistent with its current expectations; (iv) certain exchange rate assumptions for the Australian dollar or the Canadian dollar to the U.S. dollar, as well as other exchange rates being approximately consistent with current levels; (v) certain price assumptions for gold, copper, silver, zinc, lead and oil; (vi) prices for key supplies being approximately consistent with current levels; (vii) the accuracy of current mineral reserve, mineral resource and mineralized material estimates; and (viii) other planning assumptions. Risks relating to forward-looking statements in regard to the Newmont’s and Goldcorp’s business and future performance may include, but are not limited to, gold and other metals price volatility, currency fluctuations, operational risks, increased production costs and variances in ore grade or recovery rates from those assumed in mining plans, political risk, community relations, conflict resolution governmental regulation and judicial outcomes and other risks. In addition, material risks that could cause actual results to differ from forward-looking statements include: the inherent uncertainty associated with financial or other projections; the prompt and effective integration of Newmont’s and Goldcorp’s businesses and the ability to achieve the anticipated synergies and value-creation contemplated by the proposed transaction; the risk associated with Newmont’s and Goldcorp’s ability to obtain the approval of the proposed transaction by their stockholders required to consummate the proposed transaction and the timing of the closing of the proposed transaction, including the risk that the conditions to the transaction are not satisfied on a timely basis or at all and the failure of the transaction to close for any other reason; the risk that a consent or authorization that may be required for the proposed transaction is not obtained or is obtained subject to conditions that are not anticipated; the outcome of any legal proceedings that may be instituted against the parties and others related to the arrangement agreement; unanticipated difficulties or expenditures relating to the transaction, the response of business partners and retention as a result of the announcement and pendency of the transaction; potential volatility in the price of Newmont Common Stock due to the proposed transaction; the anticipated size of the markets and continued demand for Newmont’s and Goldcorp’s resources and the impact of competitive responses to the announcement of the transaction; and the diversion of management time on transaction-related issues. For a more detailed discussion of such risks and other factors, see Newmont’s 2018 Annual Report on Form 10-K, filed with the Securities and Exchange Commission (SEC) as well as the Company’s other SEC filings, available on the SEC website or www.newmont.com, Goldcorp’s most recent annual information form as well as Goldcorp’s other filings made with Canadian securities regulatory authorities and available on SEDAR, on the SEC website or www.goldcorp.com. Newmont is not affirming or adopting any statements or reports attributed to Goldcorp (including prior mineral reserve and resource declaration) in this press release or made by Goldcorp outside of this press release. Goldcorp is not affirming or adopting any statements or reports attributed to Newmont (including prior mineral reserve and resource declaration) in this press release or made by Newmont outside of this press release. Newmont and Goldcorp do not undertake any obligation to release publicly revisions to any “forward-looking statement,” including, without limitation, outlook, to reflect events or circumstances after the date of this press release, or to reflect the occurrence of unanticipated events, except as may be required under applicable securities laws. Investors should not assume that any lack of update to a previously issued “forward-looking statement” constitutes a reaffirmation of that statement. Continued reliance on “forward-looking statements” is at investors’ own risk.\n\nAdditional information about the proposed transaction and where to find it\n\nThis communication is not intended to and does not constitute an offer to sell or the solicitation of an offer to subscribe for or buy or an invitation to purchase or subscribe for any securities or the solicitation of any vote or approval in any jurisdiction, nor shall there be any sale, issuance or transfer of securities in any jurisdiction in contravention of applicable law. This communication is being made in respect of the proposed transaction involving the Company and Goldcorp pursuant to the terms of an Arrangement Agreement by and among the Company and Goldcorp and may be deemed to be soliciting material relating to the proposed transaction. In connection with the proposed transaction, the Company will file a proxy statement relating to a special meeting of its stockholders with the Securities and Exchange Commission (the “SEC”). Additionally, the Company will file other relevant materials in connection with the proposed transaction with the SEC. Security holders of the Company are urged to read the proxy statement regarding the proposed transaction and any other relevant materials carefully in their entirety when they become available before making any voting or investment decision with respect to the proposed transaction because they will contain important information about the proposed transaction and the parties to the transaction. The definitive proxy statement will be mailed to the Company’s stockholders. Stockholders of the Company will be able to obtain a copy of the proxy statement, the filings with the SEC that will be incorporated by reference into the proxy statement as well as other filings containing information about the proposed transaction and the parties to the transaction made by the Company with the SEC free of charge at the SEC’s website at www.sec.gov, on the Company’s website at www.newmont.com/investor-relations/default.aspx or by contacting the Company’s Investor Relations department at jessica.largent@newmont.com or by calling 303-837-5484. Copies of the documents filed with the SEC by Goldcorp will be available free of charge at the SEC’s website at www.sec.gov.\n\nParticipants in the proposed transaction solicitation\n\nThe Company and its directors, its executive officers, members of its management, its employees and other persons, under SEC rules, may be deemed to be participants in the solicitation of proxies of the Company’s stockholders in connection with the proposed transaction. Investors and security holders may obtain more detailed information regarding the names, affiliations and interests of certain of the Company’s executive officers and directors in the solicitation by reading the Company’s 2018 Annual Report on Form 10-K filed with the SEC on February 21, 2019, its proxy statement relating to its 2018 Annual Meeting of Stockholders filed with the SEC on March 9, 2018 and other relevant materials filed with the SEC when they become available. Additional information regarding the interests of such potential participants in the solicitation of proxies in connection with the proposed transaction will be set forth in the proxy statement filed with the SEC relating to the transaction when it becomes available. Additional information concerning Goldcorp’ executive officers and directors is set forth in its 2017 Annual Report on Form 40-F filed with the SEC on March 23, 2018, its management information circular relating to its 2018 Annual Meeting of Stockholders filed with the SEC on March 16, 2018 and other relevant materials filed with the SEC when they become available.\n\ni Caution Regarding Projections: Projections used in this release are considered “forward looking statements”. See cautionary statement above regarding forward-looking statements. Forward-looking information representing post-closing expectations is inherently uncertain. Estimates such as expected accretion, NAV, Net Present Value creation, synergies, expected future production, IRR, financial flexibility and balance sheet strength are preliminary in nature. There can be no assurance that the proposed transaction will close or that the forward-looking information will prove to be accurate.\n\nii Net Present Value (NPV) creation as used in this release is a management estimate provided for illustrative purposes, and should not be considered a GAAP or non-GAAP financial measure. NPV creation represents management’s combined estimate of pre-tax synergies, supply chain efficiencies and Full Potential improvements, as a result of the proposed transaction that have been monetized and projected over a twenty year period for purposes of the estimation, applying a discount rate of 5 percent. Such estimates are necessarily imprecise and are based on numerous judgments and assumptions. Expected NPV creation is a “forward-looking statement” subject to risks, uncertainties and other factors which could cause actual value creation to differ from expected value creation.\n\niii 2019 dividends beyond Q1 2019 have not yet been approved or declared by the Board of Directors. Management’s expectations with respect to future dividends or annualized dividends are “forward-looking statements” within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, which are intended to be covered by the safe harbor created by such sections and other applicable laws. Investors are cautioned that such statements with respect to future dividends are non-binding. The declaration and payment of future dividends remain at the discretion of the Board of Directors and will be determined based on Newmont’s financial results, balance sheet strength, cash and liquidity requirements, future prospects, gold and commodity prices, and other factors deemed relevant by the Board. The Board of Directors reserves all powers related to the declaration and payment of dividends. Consequently, in determining the dividend to be declared and paid on the common stock of the Company, the Board of Directors may revise or terminate the payment level at any time without prior notice. As a result, investors should not place undue reliance on such statements.\n\niv IRR targets on projects are calculated using an assumed $1,200 gold price.", "title": "Newmont Board Unanimously Determines that Barrick’s Unsolicited, Negative Premium Proposal Is Not in Newmont Shareholders’ Best Interests", "images": ["https://mms.businesswire.com/media/20190304005438/en/708631/2/Newmont_Logo.jpg", "https://mms.businesswire.com/media/20190304005438/en/708631/23/Newmont_Logo.jpg"], "text": "\n\n![Business Wire](/images/bwlogo_extreme.png)\n\n# Newmont Board Unanimously Determines that Barrick’s Unsolicited, Negative\nPremium Proposal Is Not in Newmont Shareholders’ Best Interests\n\n Goldcorp Combination Represents Superior Value Creation Opportunity \n Barrick’s Proposal Presents Significant Risks to Newmont Shareholders \n Provides Term Sheet for Nevada Joint Venture with Barrick to Realize Synergies \n Files Investor Presentation Responding to Barrick Claims and Providing Long-Term Outlook for Newmont Goldcorp \n Company to Host Conference Call at 9:00 AM ET \n\nMarch 04, 2019 08:00 AM Eastern Standard Time\n\nDENVER--(BUSINESS WIRE)--Newmont Mining Corporation (NYSE: NEM) (Newmont or\nthe Company) today announced that its Board of Directors has unanimously\ndetermined that Barrick Gold Corporation’s (Barrick) (NYSE: GOLD) (TSX: ABX)\nunsolicited, all-stock negative premium proposal to acquire Newmont is not in\nthe best interests of Newmont’s shareholders.\n\n> After a comprehensive review conducted in consultation with its financial\nand legal advisors, Newmont’s Board unanimously concluded that Barrick’s\nproposal does not constitute, and would not reasonably be expected to\nconstitute, a Newmont Superior Proposal (as such term is defined in the\narrangement agreement between Newmont and Goldcorp Inc. (NYSE: GG, TSX: G)\n(Goldcorp)). The Company’s previously announced combination with Goldcorp\nrepresents a superior value creation opportunity to generate long-term value\nthrough an unmatched portfolio of world class operations, projects,\nexploration opportunities, reserves and talent.\n\n“Our thorough review of Barrick’s unsolicited proposal and its associated\nrisks has reaffirmed our conclusion that the combination of Newmont and\nGoldcorp represents the best opportunity to create value for Newmont’s\nshareholders and deliver industry-leading returns for decades to come,” said\nGary Goldberg, Newmont’s Chief Executive Officer. “Unlike Barrick, Newmont\nGoldcorp will be centered in the world’s most favorable mining jurisdictions\nand gold districts. The combination with Goldcorp is significantly more\naccretive to Newmont’s shareholders on all relevant metrics compared to\nBarrick’s proposal, even when factoring in Barrick’s own synergy estimates.\nRealizing value through Barrick’s proposal for Newmont’s shareholders hinges\nentirely on a new management team that lacks global operating experience and\nis only two months into its own transformational integration.”\n\nNewmont Goldcorp Combination Represents Superior Value Creation\nOpportunity Over Barrick’s Proposal\n\nThe Newmont Board of Directors’ unanimous determination that the combination\nwith Goldcorp represents a superior value creation opportunity over Barrick’s\nunsolicited proposal is based on the following:\n\n The Goldcorp transaction generates twice the accretion to Newmont’s Net Asset Value (NAV) per share compared to Barrick’s proposal, even when factoring in Barrick’s unsubstantiated synergy assumptions. \n Barrick’s proposal is four percent (4%) dilutive to Newmont’s NAV per share, before any synergies. i\n The value creation claimed in Barrick’s proposal relies entirely on the delivery of synergies from a management team that lacks global operating experience and is only two months into its integration effort with Randgold Resources Ltd. \n Barrick’s portfolio includes numerous unfavorable and high-risk jurisdictions with several ongoing and significant operational and sustainability problems. \n By contrast, Newmont Goldcorp’s assets will be located in favorable mining jurisdictions and prolific gold districts on four continents. \n Completing the Newmont transaction with Goldcorp does not preclude Newmont or Barrick from achieving the available synergies in Nevada through a joint venture and may permit them to be realized sooner. \n\nBecause Newmont’s Board determined that the Barrick proposal is not a “Newmont\nSuperior Proposal” under the Goldcorp arrangement agreement, Newmont is\nprohibited under the provisions of that agreement from engaging with Barrick\nin relation to its proposal.\n\nProposed Nevada Joint Venture with Barrick\n\nTo realize the savings from Newmont’s and Barrick’s Nevada-related operations,\nNewmont today submitted a joint venture proposal to Barrick. The terms of the\nproposal are modeled on similar terms to other successful joint ventures,\nincluding ones that Barrick has with Newmont and Goldcorp.\n\nMr. Goldberg continued, “Newmont has consistently expressed to Barrick that we\nare open to a joint venture for our operations in Nevada. In that regard,\ntoday we have submitted a term sheet to Barrick proposing a Nevada joint\nventure. This proposal would enable both companies’ shareholders to realize\nthe available synergies while avoiding the significant risks and complexities\nassociated with Barrick’s unsolicited proposal.”\n\nKey terms of the joint venture proposal to combine the Nevada-related\noperations of Newmont Goldcorp and Barrick include:\n\n Economic Interests : Barrick to hold an economic interest equal to 55 percent and Newmont Goldcorp to hold a 45 percent economic interest. The proposed economic interests are based upon analyst consensus Net Present Values for each company’s Nevada-related assets and an equal split of Barrick’s estimated Nevada synergies. \n Governance: Newmont Goldcorp and Barrick will have an equal number of representatives on the Management and Technical Committees. Decisions by the Management Committee shall be determined by majority vote, with the voting power of the parties’ representatives based on their respective economic interests, subject to a list of customary material matters requiring joint approval. The proposed joint venture’s Operational Management will be jointly appointed by both parties and will be responsible for day-to-day operations. \n\n“We are confident that Newmont’s demonstrated technical expertise and\nconsistent execution will be critical in realizing the synergy opportunities\nof the proposed joint venture,” said Tom Palmer, Newmont’s President and Chief\nOperating Officer.\n\nNewmont Goldcorp\n\nNewmont has also filed an updated investor presentation regarding the\ncompelling value creation opportunity of the Newmont Goldcorp transaction.\nNewmont’s proposed combination with Goldcorp is expected to close in the\nsecond quarter of 2019.\n\nOn day one after the transaction closes, Newmont Goldcorp will:\n\n Be accretive to Newmont’s NAV per share by 27 percent and 34 percent accretive to 2020 cash flow per share; i\n Begin delivering a combined $365 million in expected annual pre-tax synergies, supply chain efficiencies and Full Potential improvements representing the opportunity to create $4.4 billion in Net Present Value (pre-tax);ii\n Target 6-7 million ounces of steady-state gold production over a decades-long time horizon;i\n Have the largest gold Reserves and Resources in the gold sector, including on a per share basis; \n Be located in favorable mining jurisdictions and prolific gold districts on four continents; \n Deliver the highest dividend among senior gold producers;iii\n Offer financial flexibility and an investment-grade balance sheet to advance the most promising projects generating a targeted Internal Rate of Return (IRR) of at least 15 percent;iv\n Feature a deep bench of accomplished business leaders and high-performing technical teams and other talent with extensive mining industry experience; and \n Maintain industry leadership in environmental, social and governance performance. \n\nNewmont today sent the following letter to Barrick’s Executive Chairman, John\nL. Thornton, and President and Chief Executive Officer, Mark Bristow:\n\nNewmont Mining \n Corporation 6363 South \nFiddlers Green Circle \nGreenwood Village, CO \n80111\n\nT (303) 863-7414\n\nF (303) 837-5837\n\nwww.newmont.com\n\nMarch 4, 2019\n\nBoard of Directors \nBARRICK GOLD CORPORATION\n\nTD Canada Trust Tower 161 Bay \nStreet, Suite 3700\n\nToronto, ON M5J 2S1 Canada\n\nAttn.: | | | | John L. Thornton, Executive Chairman \n---|---|---|---|--- \n| | | | Mark Bristow, President and Chief Executive Officer \n \nDear John and Mark:\n\nRe: February 25, 2019 Letter\n\nOur board of directors and senior management, with the assistance of our\nadvisors, have undertaken an intensive and detailed review and analysis of\nyour February 25, 2019 letter proposing to acquire all of the outstanding\nshares of common stock of Newmont Mining Corporation. Consistent with its\nfocus on the best interests of our company and its stakeholders and on\nmaximizing stockholder value for the long-term, our board has determined that\nthe proposal set forth in your letter does not constitute, and would not\nreasonably be expected to constitute, a Newmont Superior Proposal (as such\nterm is defined in the arrangement agreement dated January 14, 2019 between\nNewmont and Goldcorp Inc., as amended on February 19, 2019). Accordingly,\nNewmont is not permitted to engage in discussions and negotiations with\nBarrick Gold Corporation with respect to its proposal, nor are such actions\nrequired by the fiduciary duties of our board of directors. Therefore, in\naccordance with our contractual obligations under the Goldcorp arrangement\nagreement and consistent with our judgment as to the best interests of\nNewmont’s stockholders, we will proceed with our transaction with Goldcorp. We\nbelieve that transaction provides greater value to the Newmont stockholders\nand is superior from the perspective of Newmont’s other stakeholders.\n\nWe believe that the transaction you are proposing would reduce, rather than\nenhance, Newmont stockholder value. Your “at market” proposal is at a material\ndiscount to current market values, and any potential value creation depends\nentirely on Barrick’s execution. Since previous merger discussions terminated\nin 2014, Newmont has significantly outperformed Barrick on almost every\nmetric. Our management team has a consistent, long-standing track record of\ndelivering superior execution (including productivity improvements and cost\nreduction measures) through a proven, scalable operating model and deep bench\nstrength supporting thoughtful and structured succession planning. In\ncontrast, Barrick’s underperformance highlights its ineffective operating\nmodel, poor record on delivering stockholder returns, and significant\njurisdictional risk. The basis for our board’s determinations have been and\nwill continue to be detailed in our public disclosures.\n\nThe value creation of Barrick’s proposal relies entirely upon the delivery of\nsynergies from a management team that was put in place just two months ago.\nThis new team has never managed a global portfolio the size of Barrick, let\nalone the size of a potential Newmont and Barrick combination. From a\nstockholder perspective, how a company conducts its business is an important\ncomponent of value. In addition to compelling economic performance, Newmont\nhas maintained industry leadership in environmental, social and governance\nperformance and, unlike Barrick and Randgold Resources Ltd., has generally\navoided material operational, governmental and investment pitfalls. Moreover,\nNewmont is committed to strong governance practices and has been recognized\nfor having a culture that values responsible corporate citizenship, inclusion\nand diversity. Barrick’s expressed disdain for process and oversight, and its\nabsence of diversity of leadership, including in its board room, runs contrary\nto the expressed values of Newmont, our employees, our stockholders and our\nother valued stakeholders. For all of these reasons, we strongly believe that\nour stockholders are far better off as owners of Newmont Goldcorp Corporation\nthan as holders of a minority stake in Barrick, a far less attractive entity.\n\nWe recognize that there are value-creation opportunities available in Nevada\nif we work together. We have always been, and we remain, prepared to explore\nthese opportunities, despite your public comments to the contrary. Achieving\nthese opportunities does not require Newmont to be acquired by Barrick, and\nfor our stockholders to be exposed to the many risks inherent in Barrick. To\nfacilitate the realization of the potential synergies, we are providing you\nwith a term sheet for a joint venture that would combine our Nevada operations\nand create value for both sets of stockholders. We are prepared to move\nforward with you on this basis expeditiously.\n\nOur board of directors, our management team and our thousands of employees\naround the world are dedicated to creating value for all of our stockholders\nand that is exactly what we will continue to do by executing on our strategic\nplan and completing our pending transaction with Goldcorp.\n\nOn behalf of our board of directors,\n\nNoreen Doyle \n _Chair_\n\nGary J. Goldberg \n _Chief Executive Officer_\n\nAdvisors and counsel\n\nIn connection with the transaction, Newmont has retained BMO Capital Markets,\nCiti and Goldman Sachs as financial advisors, and Wachtell, Lipton, Rosen &\nKatz, Goodmans LLP, and White & Case LLP as legal counsel.\n\nConference Call and Webcast\n\nNewmont will host a conference call and a webcast on Monday, March 4, 2019 at\n9:00 AM Eastern Time. Presentation slides will accompany the live webcast and\ncan be accessed on the Newmont website, www.newmont.com and\nhttps://event.on24.com/wcc/r/1952473/C5AC3067BE6C7740A2D324BE629DA649.\n\nConference Call Details \n \n--- \n| | | | Dial-In Number | | | | 1-855-209-8210 \n| | | | Intl Dial-In Number | | | | 1-412-317-5213 \n| | | | Canada Toll Free\n\nConference Name\n\n| | | | 1-855-669-9658\n\nNewmont Mining \n \n| | | | Replay Number | | | | 1-877-344-7529 \n| | | | Intl Replay Number | | | | 1-412-317-0088 \n| | | | Replay Access Code | | | | 10129346 \n \nAbout Newmont\n\nNewmont is a leading gold and copper producer. The Company’s operations are\nprimarily in the United States, Australia, Ghana, Peru and Suriname. Newmont\nis the only gold producer listed in the S &P 500 Index and was named the\nmining industry leader by the Dow Jones Sustainability World Index in 2015,\n2016, 2017 and 2018. The Company is an industry leader in value creation,\nsupported by its leading technical, environmental, social and safety\nperformance. Newmont was founded in 1921 and has been publicly traded since\n1925.\n\nCautionary Statement Regarding Forward-Looking Statements:\n\nThis press release contains “forward-looking statements” within the meaning of\nSection 27A of the Securities Act of 1933, as amended, and Section 21E of the\nSecurities Exchange Act of 1934, as amended, which are intended to be covered\nby the safe harbor created by such sections and other applicable laws and\n“forward-looking information” within the meaning of applicable Canadian\nsecurities laws. Where a forward-looking statement expresses or implies an\nexpectation or belief as to future events or results, such expectation or\nbelief is expressed in good faith and believed to have a reasonable basis.\nHowever, such statements are subject to risks, uncertainties and other\nfactors, which could cause actual results to differ materially from future\nresults expressed, projected or implied by the forward-looking statements.\nForward-looking statements often address our expected future business and\nfinancial performance and financial condition, and often contain words such as\n“anticipate,” “intend,” “plan,” “will,” “would,” “estimate,” “expect,”\n“believe,” “target,” “indicative,” “preliminary,” or “potential.” Forward-\nlooking statements in this press release may include, without limitation: (i)\nstatements relating to Newmont’s planned acquisition of Goldcorp (the\n“proposed transaction”) and the expected terms, timing and closing of the\nproposed transaction, including receipt of required approvals and satisfaction\nof other customary closing conditions; (ii) estimates of future production and\nsales, including expected annual production range; (iii) estimates of future\ncosts applicable to sales and all-in sustaining costs; (iv) expectations\nregarding accretion; (v) estimates of future capital expenditures; (vi)\nestimates of future cost reductions, efficiencies and synergies; (vii)\nexpectations regarding future exploration and the development, growth and\npotential of Newmont’s and Goldcorp’s operations, project pipeline and\ninvestments, including, without limitation, project returns, expected average\nIRR, schedule, decision dates, mine life, commercial start, first production,\ncapital average production, average costs and upside potential; (viii)\nexpectations regarding future investments or divestitures; (ix) expectations\nof future dividends and returns to stockholders; (x) expectations of future\nfree cash flow generation, liquidity, balance sheet strength and credit\nratings; (xi) expectations of future equity and enterprise value; (xii)\nexpectations of future plans and benefits; (xiii) expectations regarding\nfuture mineralization, including, without limitation, expectations regarding\nreserves and resources, grade and recoveries; (xiv) estimates of future\nclosure costs and liabilities; (xv) statements relating to the proposed\nacquisition of Newmont by Barrick, including potential dilution, synergies and\nvalue creation, and (xvi) the possible joint venture in Nevada, including the\npotential terms and benefits thereof. Estimates or expectations of future\nevents or results are based upon certain assumptions, which may prove to be\nincorrect. Such assumptions, include, but are not limited to: (i) there being\nno significant change to current geotechnical, metallurgical, hydrological and\nother physical conditions; (ii) permitting, development, operations and\nexpansion of Newmont’s and Goldcorp’s operations and projects being consistent\nwith current expectations and mine plans, including, without limitation,\nreceipt of export approvals; (iii) political developments in any jurisdiction\nin which Newmont and Goldcorp operate being consistent with its current\nexpectations; (iv) certain exchange rate assumptions for the Australian dollar\nor the Canadian dollar to the U.S. dollar, as well as other exchange rates\nbeing approximately consistent with current levels; (v) certain price\nassumptions for gold, copper, silver, zinc, lead and oil; (vi) prices for key\nsupplies being approximately consistent with current levels; (vii) the\naccuracy of current mineral reserve, mineral resource and mineralized material\nestimates; and (viii) other planning assumptions. Risks relating to forward-\nlooking statements in regard to the Newmont’s and Goldcorp’s business and\nfuture performance may include, but are not limited to, gold and other metals\nprice volatility, currency fluctuations, operational risks, increased\nproduction costs and variances in ore grade or recovery rates from those\nassumed in mining plans, political risk, community relations, conflict\nresolution governmental regulation and judicial outcomes and other risks. In\naddition, material risks that could cause actual results to differ from\nforward-looking statements include: the inherent uncertainty associated with\nfinancial or other projections; the prompt and effective integration of\nNewmont’s and Goldcorp’s businesses and the ability to achieve the anticipated\nsynergies and value-creation contemplated by the proposed transaction; the\nrisk associated with Newmont’s and Goldcorp’s ability to obtain the approval\nof the proposed transaction by their stockholders required to consummate the\nproposed transaction and the timing of the closing of the proposed\ntransaction, including the risk that the conditions to the transaction are not\nsatisfied on a timely basis or at all and the failure of the transaction to\nclose for any other reason; the risk that a consent or authorization that may\nbe required for the proposed transaction is not obtained or is obtained\nsubject to conditions that are not anticipated; the outcome of any legal\nproceedings that may be instituted against the parties and others related to\nthe arrangement agreement; unanticipated difficulties or expenditures relating\nto the transaction, the response of business partners and retention as a\nresult of the announcement and pendency of the transaction; potential\nvolatility in the price of Newmont Common Stock due to the proposed\ntransaction; the anticipated size of the markets and continued demand for\nNewmont’s and Goldcorp’s resources and the impact of competitive responses to\nthe announcement of the transaction; and the diversion of management time on\ntransaction-related issues. For a more detailed discussion of such risks and\nother factors, see Newmont’s 2018 Annual Report on Form 10-K, filed with the\nSecurities and Exchange Commission (SEC) as well as the Company’s other SEC\nfilings, available on the SEC website or www.newmont.com, Goldcorp’s most\nrecent annual information form as well as Goldcorp’s other filings made with\nCanadian securities regulatory authorities and available on SEDAR, on the SEC\nwebsite or www.goldcorp.com. Newmont is not affirming or adopting any\nstatements or reports attributed to Goldcorp (including prior mineral reserve\nand resource declaration) in this press release or made by Goldcorp outside of\nthis press release. Goldcorp is not affirming or adopting any statements or\nreports attributed to Newmont (including prior mineral reserve and resource\ndeclaration) in this press release or made by Newmont outside of this press\nrelease. Newmont and Goldcorp do not undertake any obligation to release\npublicly revisions to any “forward-looking statement,” including, without\nlimitation, outlook, to reflect events or circumstances after the date of this\npress release, or to reflect the occurrence of unanticipated events, except as\nmay be required under applicable securities laws. Investors should not assume\nthat any lack of update to a previously issued “forward-looking statement”\nconstitutes a reaffirmation of that statement. Continued reliance on “forward-\nlooking statements” is at investors’ own risk.\n\nAdditional information about the proposed transaction and where to find it\n\nThis communication is not intended to and does not constitute an offer to sell\nor the solicitation of an offer to subscribe for or buy or an invitation to\npurchase or subscribe for any securities or the solicitation of any vote or\napproval in any jurisdiction, nor shall there be any sale, issuance or\ntransfer of securities in any jurisdiction in contravention of applicable law.\nThis communication is being made in respect of the proposed transaction\ninvolving the Company and Goldcorp pursuant to the terms of an Arrangement\nAgreement by and among the Company and Goldcorp and may be deemed to be\nsoliciting material relating to the proposed transaction. In connection with\nthe proposed transaction, the Company will file a proxy statement relating to\na special meeting of its stockholders with the Securities and Exchange\nCommission (the “SEC”). Additionally, the Company will file other relevant\nmaterials in connection with the proposed transaction with the SEC. Security\nholders of the Company are urged to read the proxy statement regarding the\nproposed transaction and any other relevant materials carefully in their\nentirety when they become available before making any voting or investment\ndecision with respect to the proposed transaction because they will contain\nimportant information about the proposed transaction and the parties to the\ntransaction. The definitive proxy statement will be mailed to the Company’s\nstockholders. Stockholders of the Company will be able to obtain a copy of the\nproxy statement, the filings with the SEC that will be incorporated by\nreference into the proxy statement as well as other filings containing\ninformation about the proposed transaction and the parties to the transaction\nmade by the Company with the SEC free of charge at the SEC’s website at\nwww.sec.gov, on the Company’s website at www.newmont.com/investor-\nrelations/default.aspx or by contacting the Company’s Investor Relations\ndepartment at jessica.largent@newmont.com or by calling 303-837-5484. Copies\nof the documents filed with the SEC by Goldcorp will be available free of\ncharge at the SEC’s website at www.sec.gov.\n\nParticipants in the proposed transaction solicitation\n\nThe Company and its directors, its executive officers, members of its\nmanagement, its employees and other persons, under SEC rules, may be deemed to\nbe participants in the solicitation of proxies of the Company’s stockholders\nin connection with the proposed transaction. Investors and security holders\nmay obtain more detailed information regarding the names, affiliations and\ninterests of certain of the Company’s executive officers and directors in the\nsolicitation by reading the Company’s 2018 Annual Report on Form 10-K filed\nwith the SEC on February 21, 2019, its proxy statement relating to its 2018\nAnnual Meeting of Stockholders filed with the SEC on March 9, 2018 and other\nrelevant materials filed with the SEC when they become available. Additional\ninformation regarding the interests of such potential participants in the\nsolicitation of proxies in connection with the proposed transaction will be\nset forth in the proxy statement filed with the SEC relating to the\ntransaction when it becomes available. Additional information concerning\nGoldcorp’ executive officers and directors is set forth in its 2017 Annual\nReport on Form 40-F filed with the SEC on March 23, 2018, its management\ninformation circular relating to its 2018 Annual Meeting of Stockholders filed\nwith the SEC on March 16, 2018 and other relevant materials filed with the SEC\nwhen they become available.\n\ni Caution Regarding Projections: Projections used in this release are\nconsidered “forward looking statements”. See cautionary statement above\nregarding forward-looking statements. Forward-looking information representing\npost-closing expectations is inherently uncertain. Estimates such as expected\naccretion, NAV, Net Present Value creation, synergies, expected future\nproduction, IRR, financial flexibility and balance sheet strength are\npreliminary in nature. There can be no assurance that the proposed transaction\nwill close or that the forward-looking information will prove to be accurate.\n\nii Net Present Value (NPV) creation as used in this release is a management\nestimate provided for illustrative purposes, and should not be considered a\nGAAP or non-GAAP financial measure. NPV creation represents management’s\ncombined estimate of pre-tax synergies, supply chain efficiencies and Full\nPotential improvements, as a result of the proposed transaction that have been\nmonetized and projected over a twenty year period for purposes of the\nestimation, applying a discount rate of 5 percent. Such estimates are\nnecessarily imprecise and are based on numerous judgments and assumptions.\nExpected NPV creation is a “forward-looking statement” subject to risks,\nuncertainties and other factors which could cause actual value creation to\ndiffer from expected value creation.\n\niii 2019 dividends beyond Q1 2019 have not yet been approved or declared by\nthe Board of Directors. Management’s expectations with respect to future\ndividends or annualized dividends are “forward-looking statements” within the\nmeaning of Section 27A of the Securities Act of 1933, as amended, and Section\n21E of the Securities Exchange Act of 1934, as amended, which are intended to\nbe covered by the safe harbor created by such sections and other applicable\nlaws. Investors are cautioned that such statements with respect to future\ndividends are non-binding. The declaration and payment of future dividends\nremain at the discretion of the Board of Directors and will be determined\nbased on Newmont’s financial results, balance sheet strength, cash and\nliquidity requirements, future prospects, gold and commodity prices, and other\nfactors deemed relevant by the Board. The Board of Directors reserves all\npowers related to the declaration and payment of dividends. Consequently, in\ndetermining the dividend to be declared and paid on the common stock of the\nCompany, the Board of Directors may revise or terminate the payment level at\nany time without prior notice. As a result, investors should not place undue\nreliance on such statements.\n\niv IRR targets on projects are calculated using an assumed $1,200 gold price.\n\n## Contacts\n\nInvestor Contact \nJessica Largent, 303.837.5484 \njessica.largent@newmont.com\n\nMedia Contact \nOmar Jabara, 303.837.5114 \nomar.jabara@newmont.com\n\n![](https://mms.businesswire.com/media/20190304005438/en/708631/2/Newmont_Logo.jpg)\n\n## Release Summary\n\nNewmont Board Unanimously Determines that Barrick's Unsolicited, Negative\nPremium Proposal Is Not in Newmont Shareholders' Best Interests\n\n## $Cashtags\n\n $NEM\n\n## Contacts\n\nInvestor Contact \nJessica Largent, 303.837.5484 \njessica.largent@newmont.com\n\nMedia Contact \nOmar Jabara, 303.837.5114 \nomar.jabara@newmont.com\n\n## Site Navigation\n\n Home\n Home\n Submit a Press Release\n Services\n News\n All News\n News with Multimedia\n News by Industry\n News by Subject\n News by Language\n Tradeshows & Events\n Education\n Overview\n Distribution & Media\n Media & Journalist Tools\n Sample Press Release\n Find Your News Online\n How-to\n Disclosure Resources\n About Us\n Overview\n Become a Member\n Contact Us\n Follow Us\n Careers\n Business Wire Newsroom\n Business Wire Events\n\n## Search\n\nAdvanced News Search\n\nAdvanced News Search ![Search](/images/icons/icon_search.gif)\n\n Log In\n Sign Up\n\n## Follow Us\n\n Twitter\n LinkedIn\n Google+\n\n## More from Business Wire\n\n Blog\n Apps\n UK/Ireland\n Deutschland\n France\n Hong Kong\n Italy\n Japan\n Tradeshownews.com\n\n## Business Wire Information\n\n Contact Us\n UK Tax Strategy\n Privacy Statement\n Terms of Use\n (C) 2019 Business Wire\n\nAccept the use of cookies Learn more\n\nI Accept\n\n", "contact_info": [{"name": "Jessica Largent", "phone": "303.837.5484", "email": "jessica.largent@newmont.com"}, {"name": "Omar Jabara", "phone": "303.837.5114", "email": "omar.jabara@newmont.com"}], "date": "March 04, 2019 08:00", "published_date_time": "March 04, 2019 08:00 AM Eastern Standard Time", "sub_title": "Goldcorp Combination Represents Superior Value Creation Opportunity\n      \n\n        Barrick’s Proposal Presents Significant Risks to Newmont Shareholders\n      \n\n        Provides Term \n        Sheet for Nevada Joint Venture with Barrick to Realize Synergies\n      \n\n        Files Investor \n        Presentation Responding to Barrick Claims and Providing Long-Term \n        Outlook for Newmont Goldcorp\n      \n\n        Company to Host Conference Call at 9:00 AM ET", "entities": [{"company_name": "DENVER--(BUSINESS WIRE)--Newmont Mining Corporation", "stock_name": "NYSE: NEM"}, {"company_name": "", "stock_name": "NYSE: GOLD"}, {"company_name": "", "stock_name": "TSX: ABX"}], "company_1": "Newmont Mining Corporation", "company_2": "Directors"}