{"url": "https://www.businesswire.com/news/home/20190307005427/en/Lisa-Narrell-Mead-Acquire-Everett-Advisory-Partners", "body": "JENKS, Okla.--(BUSINESS WIRE)--Lisa Narrell-Mead has entered into a definitive agreement to acquire Everett Advisory Partners LLC (“Everett”) through the firm she founded, Workplace Advisors, LLC. Lisa Narrell-Mead will serve as the Chief Executive Officer of the combined company, which will continue under the Everett Advisory Partners’ name. Stephen Curry founded Everett in 2009 and built it into a leading consulting firm specializing in community and regional banking and financial services.\n\n“I am honored to have the opportunity to continue the strong legacy that Stephen has built at Everett over the last decade,” said Ms. Narrell-Mead. “The combined experience of professional advisors at both Everett and Workplace will offer substantial value to our banking clients. We all share a commitment to the financial services sector and with the fluid climate of the banking industry, these services are more important now than ever.”\n\nMr. Curry, now CEO of Gateway Mortgage Group, noted that “Lisa’s extensive banking background and breadth of industry contacts makes her an ideal leader for Everett Advisory. She will build on the Everett track record and further deepen talent and services in strategic planning, risk assessments, regulatory compliance, operational effectiveness, information technology and product strategies.”\n\nLisa Narrell-Mead’s firm, Workplace Advisors, LLC, will be merged with Everett Advisory Partners, and the combined firm will have more than 20 strategic advisors, and a broad network of industry connections, to assist the community and regional banking segment. The focus of the company will continue to be helping financial institutions overcome challenges they face in an ever-changing corporate landscape.\n\nAbout Everett\n\nFounded in 2009 by Mr. Curry, Everett Advisory Partners has an extensive track record of providing strategic advice and execution resources for regional and community banks, and investors. The firm has guided more than 30 banks, boards and investor groups through acquisitions, recapitalizations, and restructurings, merger integrations, information technology transformations, core system implementations and regulatory examinations. https://everettadvisory.com/\n\nAbout Workplace\n\nMs. Narrell-Mead founded Workplace Advisors in 2013 as an advisory firm serving financial service institutions, community and regional banks as well as other businesses. Ms. Narrell-Mead has a distinguished and experienced background in executive management in the financial services industry, private law practice, and business development/management. As a seasoned corporate executive in the financial services industry, she has extensive executive management experience. Lisa also serves on the Board of a number of community banks/trust companies and advises Private Equity Funds.", "title": "Lisa Narrell-Mead to Acquire Everett Advisory Partners", "images": [], "text": "\n\n![Business Wire](/images/bwlogo_extreme.png)\n\n# Lisa Narrell-Mead to Acquire Everett Advisory Partners\n\nMarch 07, 2019 10:01 AM Eastern Standard Time\n\nJENKS, Okla.--(BUSINESS WIRE)--Lisa Narrell-Mead has entered into a definitive\nagreement to acquire Everett Advisory Partners LLC (“Everett”) through the\nfirm she founded, Workplace Advisors, LLC. Lisa Narrell-Mead will serve as the\nChief Executive Officer of the combined company, which will continue under the\nEverett Advisory Partners’ name. Stephen Curry founded Everett in 2009 and\nbuilt it into a leading consulting firm specializing in community and regional\nbanking and financial services.\n\n> “I am honored to have the opportunity to continue the strong legacy that\nStephen has built at Everett over the last decade,” said Ms. Narrell-Mead.\n“The combined experience of professional advisors at both Everett and\nWorkplace will offer substantial value to our banking clients. We all share a\ncommitment to the financial services sector and with the fluid climate of the\nbanking industry, these services are more important now than ever.”\n\nMr. Curry, now CEO of Gateway Mortgage Group, noted that “Lisa’s extensive\nbanking background and breadth of industry contacts makes her an ideal leader\nfor Everett Advisory. She will build on the Everett track record and further\ndeepen talent and services in strategic planning, risk assessments, regulatory\ncompliance, operational effectiveness, information technology and product\nstrategies.”\n\nLisa Narrell-Mead’s firm, Workplace Advisors, LLC, will be merged with Everett\nAdvisory Partners, and the combined firm will have more than 20 strategic\nadvisors, and a broad network of industry connections, to assist the community\nand regional banking segment. The focus of the company will continue to be\nhelping financial institutions overcome challenges they face in an ever-\nchanging corporate landscape.\n\nAbout Everett \nFounded in 2009 by Mr. Curry, Everett Advisory Partners has an extensive track\nrecord of providing strategic advice and execution resources for regional and\ncommunity banks, and investors. The firm has guided more than 30 banks, boards\nand investor groups through acquisitions, recapitalizations, and\nrestructurings, merger integrations, information technology transformations,\ncore system implementations and regulatory examinations.\nhttps://everettadvisory.com/\n\nAbout Workplace \nMs. Narrell-Mead founded Workplace Advisors in 2013 as an advisory firm\nserving financial service institutions, community and regional banks as well\nas other businesses. Ms. Narrell-Mead has a distinguished and experienced\nbackground in executive management in the financial services industry, private\nlaw practice, and business development/management. As a seasoned corporate\nexecutive in the financial services industry, she has extensive executive\nmanagement experience. Lisa also serves on the Board of a number of community\nbanks/trust companies and advises Private Equity Funds.\n\n## Contacts\n\nMegan McKinstry \n(678) 781-7237 \nmmckinstry@williammills.com\n\n## Contacts\n\nMegan McKinstry \n(678) 781-7237 \nmmckinstry@williammills.com\n\n## Site Navigation\n\n Home\n Home\n Submit a Press Release\n Services\n News\n All News\n News with Multimedia\n News by Industry\n News by Subject\n News by Language\n Tradeshows & Events\n Education\n Overview\n Distribution & Media\n Media & Journalist Tools\n Sample Press Release\n Find Your News Online\n How-to\n Disclosure Resources\n About Us\n Overview\n Become a Member\n Contact Us\n Follow Us\n Careers\n Business Wire Newsroom\n Business Wire Events\n\n## Search\n\nAdvanced News Search\n\nAdvanced News Search ![Search](/images/icons/icon_search.gif)\n\n Log In\n Sign Up\n\n## Follow Us\n\n Twitter\n LinkedIn\n Google+\n\n## More from Business Wire\n\n Blog\n Apps\n UK/Ireland\n Deutschland\n France\n Hong Kong\n Italy\n Japan\n Tradeshownews.com\n\n## Business Wire Information\n\n Contact Us\n UK Tax Strategy\n Privacy Statement\n Terms of Use\n (C) 2019 Business Wire\n\nAccept the use of cookies Learn more\n\nI Accept\n\n", "contact_info": [{"name": "Megan McKinstry", "phone": "(678) 781-7237", "email": "mmckinstry@williammills.com"}], "date": "March 07, 2019", "time": "10:01 AM Eastern Standard Time", "published_date_time": "March 07, 2019 10:01 AM Eastern Standard Time", "entities": [], "company_1": "Lisa Narrell-Mead", "company_2": "Everett Advisory Partners LLC"}