{"url": "https://www.businesswire.com/news/home/20190308005272/en/International-Wire-Group-Acquired-Affiliates-Atlas-Holdings", "body": "CAMDEN, N.Y.--(BUSINESS WIRE)--International Wire Group Holdings, Inc. (“IWG” or the “Company”) (OTC PINK:ITWG) announced today that it has entered into a definitive merger agreement to be acquired by affiliates of Atlas Holdings LLC (“Atlas”). Atlas owns and operates 18 manufacturing and distribution businesses, which collectively employ more than 17,000 associates at over 150 facilities worldwide. Under the terms of the agreement, Atlas will acquire all outstanding shares of IWG common stock for $10.70 per share in cash.\n\nThe Company’s board of directors unanimously approved the transactions and recommended that stockholders vote in favor of the transaction.\n\nThe transaction is subject to customary closing conditions, including approval of the Company stockholders and regulatory approvals. The transaction is expected to close early in the second quarter of 2019 and is not subject to a financing condition.\n\nHoulihan Lokey has acted as financial advisor to IWG. Jones Day acted as legal advisor to IWG and Willkie Farr & Gallagher LLP acted as legal advisor to Atlas.\n\nAbout International Wire Group Holdings, Inc.\n\nInternational Wire Group Holdings, Inc., through its subsidiaries, is a manufacturer and marketer of wire products, including bare, silver-plated, nickel-plated and tin-plated copper wire, engineered wire products and high-performance conductors, for other wire suppliers, distributors and original equipment manufacturers. Its products include a broad spectrum of copper wire configurations and gauges with a variety of electrical and conductive characteristics and are utilized by a wide variety of customers primarily in the industrial and energy, electronics and data communications, automotive/specialty vehicles, aerospace and defense, medical products and consumer and appliance industries. The Company has seventeen manufacturing facilities and one distribution facility located throughout the United States, France, Italy and Poland.\n\nForward-Looking Information is Subject to Risk and Uncertainty\n\nCertain statements in this release may constitute “forward-looking” statements within the meaning of the Private Securities Litigation Reform Act of 1995. Forward-looking statements include all statements that are not historical facts and can be identified by the use of forward-looking terminology such as the words “expect,” “may,” “will,” “would,” “could,” “anticipate” or the negative of any thereof or other variations thereof or comparable terminology, or by discussions of strategy or intentions. Undue reliance should not be placed on any forward-looking statements. These statements are based on management’s current beliefs and assumptions and on information currently available to management as of the date they were made. These statements are not guarantees of future performance and involve risks, uncertainties and assumptions as to future events that may not prove to be accurate. Actual outcomes and results may differ materially from what is expressed or forecasted in these forward-looking statements. We undertake no obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by law.\n\nITWG-G", "title": "International Wire Group to Be Acquired by Affiliates of Atlas Holdings", "images": ["https://mms.businesswire.com/media/20190308005272/en/709589/4/3759417_Atlas_logo.jpg", "https://mms.businesswire.com/media/20190308005272/en/709588/4/IW_Logo_1.jpg?download=1", "https://mms.businesswire.com/media/20190308005272/en/709588/23/IW_Logo_1.jpg", "https://mms.businesswire.com/media/20190308005272/en/709588/2/IW_Logo_1.jpg", "https://mms.businesswire.com/media/20190308005272/en/709588/4/IW_Logo_1.jpg"], "text": "\n\n![Business Wire](/images/bwlogo_extreme.png)\n\n# International Wire Group to Be Acquired by Affiliates of Atlas Holdings\n\n## Download\n\n Full Size\n Small\n Preview\n Thumbnail\n\n![](https://mms.businesswire.com/media/20190308005272/en/709588/4/IW_Logo_1.jpg?download=1)\n\n ![](https://mms.businesswire.com/media/20190308005272/en/709588/4/IW_Logo_1.jpg)\n\n Full Size\n\n Small\n\n Preview\n\n Thumbnail\n\n ![](https://mms.businesswire.com/media/20190308005272/en/709589/4/3759417_Atlas_logo.jpg)\n\n Full Size\n\n Small\n\n Preview\n\n Thumbnail\n\nMarch 08, 2019 10:00 AM Eastern Standard Time\n\nCAMDEN, N.Y.--(BUSINESS WIRE)--International Wire Group Holdings, Inc. (“IWG”\nor the “Company”) (OTC PINK:ITWG) announced today that it has entered into a\ndefinitive merger agreement to be acquired by affiliates of Atlas Holdings LLC\n(“Atlas”). Atlas owns and operates 18 manufacturing and distribution\nbusinesses, which collectively employ more than 17,000 associates at over 150\nfacilities worldwide. Under the terms of the agreement, Atlas will acquire all\noutstanding shares of IWG common stock for $10.70 per share in cash.\n\nThe Company’s board of directors unanimously approved the transactions and\nrecommended that stockholders vote in favor of the transaction.\n\nThe transaction is subject to customary closing conditions, including approval\nof the Company stockholders and regulatory approvals. The transaction is\nexpected to close early in the second quarter of 2019 and is not subject to a\nfinancing condition.\n\nHoulihan Lokey has acted as financial advisor to IWG. Jones Day acted as legal\nadvisor to IWG and Willkie Farr & Gallagher LLP acted as legal advisor to\nAtlas.\n\nAbout International Wire Group Holdings, Inc.\n\nInternational Wire Group Holdings, Inc., through its subsidiaries, is a\nmanufacturer and marketer of wire products, including bare, silver-plated,\nnickel-plated and tin-plated copper wire, engineered wire products and high-\nperformance conductors, for other wire suppliers, distributors and original\nequipment manufacturers. Its products include a broad spectrum of copper wire\nconfigurations and gauges with a variety of electrical and conductive\ncharacteristics and are utilized by a wide variety of customers primarily in\nthe industrial and energy, electronics and data communications,\nautomotive/specialty vehicles, aerospace and defense, medical products and\nconsumer and appliance industries. The Company has seventeen manufacturing\nfacilities and one distribution facility located throughout the United States,\nFrance, Italy and Poland.\n\nForward-Looking Information is Subject to Risk and Uncertainty\n\nCertain statements in this release may constitute “forward-looking” statements\nwithin the meaning of the Private Securities Litigation Reform Act of 1995.\nForward-looking statements include all statements that are not historical\nfacts and can be identified by the use of forward-looking terminology such as\nthe words “expect,” “may,” “will,” “would,” “could,” “anticipate” or the\nnegative of any thereof or other variations thereof or comparable terminology,\nor by discussions of strategy or intentions. Undue reliance should not be\nplaced on any forward-looking statements. These statements are based on\nmanagement’s current beliefs and assumptions and on information currently\navailable to management as of the date they were made. These statements are\nnot guarantees of future performance and involve risks, uncertainties and\nassumptions as to future events that may not prove to be accurate. Actual\noutcomes and results may differ materially from what is expressed or\nforecasted in these forward-looking statements. We undertake no obligation to\nupdate or revise any forward-looking statements, whether as a result of new\ninformation, future events or otherwise, except as required by law.\n\nITWG-G\n\n## Contacts\n\nInternational Wire Group Holdings, Inc. \nDonald F. DeKay \nSenior Vice-President, Chief Financial Officer and Secretary \n315-245-3800\n\n![](https://mms.businesswire.com/media/20190308005272/en/709588/2/IW_Logo_1.jpg)\n\n## Contacts\n\nInternational Wire Group Holdings, Inc. \nDonald F. DeKay \nSenior Vice-President, Chief Financial Officer and Secretary \n315-245-3800\n\n## Site Navigation\n\n Home\n Home\n Submit a Press Release\n Services\n News\n All News\n News with Multimedia\n News by Industry\n News by Subject\n News by Language\n Tradeshows & Events\n Education\n Overview\n Distribution & Media\n Media & Journalist Tools\n Sample Press Release\n Find Your News Online\n How-to\n Disclosure Resources\n About Us\n Overview\n Become a Member\n Contact Us\n Follow Us\n Careers\n Business Wire Newsroom\n Business Wire Events\n\n## Search\n\nAdvanced News Search\n\nAdvanced News Search ![Search](/images/icons/icon_search.gif)\n\n Log In\n Sign Up\n\n## Follow Us\n\n Twitter\n LinkedIn\n Google+\n\n## More from Business Wire\n\n Blog\n Apps\n UK/Ireland\n Deutschland\n France\n Hong Kong\n Italy\n Japan\n Tradeshownews.com\n\n## Business Wire Information\n\n Contact Us\n UK Tax Strategy\n Privacy Statement\n Terms of Use\n (C) 2019 Business Wire\n\nAccept the use of cookies Learn more\n\nI Accept\n\n", "contact_info": [{"name": "Donald F. DeKay", "other_information": ["Senior Vice-President, Chief Financial Officer and Secretary"], "phone": "315-245-3800"}], "date": "March 08, 2019 10:00 AM Eastern Standard Time", "published_date_time": "March 08, 2019 10:00 AM Eastern Standard Time", "entities": [], "company_1": "International Wire Group Holdings", "company_2": "Atlas Holdings LLC"}