{"url": "https://www.businesswire.com/news/home/20190308005282/en/Centerbridge-Partners-Completes-Acquisition-Civitas-Solutions", "body": "BOSTON--(BUSINESS WIRE)--Civitas Solutions, Inc. (“Civitas” or the “Company”) (NYSE:CIVI) today announced that it has been acquired for $17.75 per share in cash by Celtic Intermediate Corp., an affiliate of Centerbridge Partners, L.P. and The Vistria Group, LP. The acquisition was first announced on December 18, 2018 and became effective today.\n\n“ The closing of this transaction, which followed a thorough review of alternatives by our Board of Directors, represents a new and exciting chapter for our Company, our talented and dedicated employees, and the people we serve,” said Bruce Nardella, Chief Executive Officer of Civitas. “ It strengthens our ability to execute our long-term growth strategy and fulfill our mission through the expansion of high-quality, cost-effective services. Centerbridge and Vistria bring significant resources and especially deep experience in health and human services to our partnership, and I am confident that will help us reach new heights as a premier service provider.”\n\nJeremy Gelber, Senior Managing Director at Centerbridge, said, “ We are excited to have completed the acquisition of Civitas. The Company is a leader in serving people with complex needs across a range of home- and community-based settings. We look forward to partnering with the strong Civitas team to invest in and further reinforce the company’s best-in-class history of quality care delivery with a focus on compassion and putting the person first in support of a powerful mission that is so important to the individuals and families served.”\n\n“ We look forward to working with Civitas’ management and Centerbridge in supporting the Company’s continued growth, while remaining focused on delivering exceptional care and making a positive impact on the lives of individuals that Civitas serves,” said David Schuppan, Partner at Vistria.\n\nAs a result of the completion of the merger, trading in Civitas’s common stock on the New York Stock Exchange has been suspended.\n\nAbout Civitas\n\nCivitas Solutions, Inc. is the leading national provider of home- and community-based health and human services to must-serve individuals with intellectual, developmental, physical or behavioral disabilities and other special needs. Since its founding in 1980, it has evolved from a single residential program to a diversified national network offering an array of quality services in 36 states.\n\nAbout Centerbridge Partners\n\nCenterbridge Partners, L.P. is a private investment management firm employing a flexible approach across investment disciplines – from private equity to credit and related strategies, and real estate – in an effort to find the most attractive opportunities for our investors and business partners. The firm was founded in 2005 and as of September 2018 had approximately $27 billion in capital under management with offices in New York and London. Centerbridge is dedicated to partnering with world-class management teams across targeted industry sectors and geographies to help companies achieve their operating and financial objectives. For more information, please visit www.centerbridge.com.\n\nAbout The Vistria Group\n\nThe Vistria Group, LP (“Vistria”) is a Chicago-based private investment firm focused on investing in middle market companies in the healthcare, education, and financial services sectors. Vistria’s team is comprised of highly experienced operating partners and private equity executives with proven track records of working with management teams in building innovative, market-leading companies. For more information, please visit www.vistria.com.", "title": "Centerbridge Partners Completes Acquisition of Civitas Solutions, Inc .", "images": ["https://mms.businesswire.com/media/20190308005282/en/446145/21/Civitas_1200_color-larger-01.jpg", "https://mms.businesswire.com/media/20190308005282/en/446145/2/Civitas_1200_color-larger-01.jpg"], "text": "\n\n![Business Wire](/images/bwlogo_extreme.png)\n\n# Centerbridge Partners Completes Acquisition of Civitas Solutions, Inc.\n\nMarch 08, 2019 09:35 AM Eastern Standard Time\n\nBOSTON--(BUSINESS WIRE)--Civitas Solutions, Inc. (“Civitas” or the “Company”)\n(NYSE:CIVI) today announced that it has been acquired for $17.75 per share in\ncash by Celtic Intermediate Corp., an affiliate of Centerbridge Partners, L.P.\nand The Vistria Group, LP. The acquisition was first announced on December 18,\n2018 and became effective today.\n\n“The closing of this transaction, which followed a thorough review of\nalternatives by our Board of Directors, represents a new and exciting chapter\nfor our Company, our talented and dedicated employees, and the people we\nserve,” said Bruce Nardella, Chief Executive Officer of Civitas. “It\nstrengthens our ability to execute our long-term growth strategy and fulfill\nour mission through the expansion of high-quality, cost-effective services.\nCenterbridge and Vistria bring significant resources and especially deep\nexperience in health and human services to our partnership, and I am confident\nthat will help us reach new heights as a premier service provider.”\n\nJeremy Gelber, Senior Managing Director at Centerbridge, said, “We are excited\nto have completed the acquisition of Civitas. The Company is a leader in\nserving people with complex needs across a range of home- and community-based\nsettings. We look forward to partnering with the strong Civitas team to invest\nin and further reinforce the company’s best-in-class history of quality care\ndelivery with a focus on compassion and putting the person first in support of\na powerful mission that is so important to the individuals and families\nserved.”\n\n“We look forward to working with Civitas’ management and Centerbridge in\nsupporting the Company’s continued growth, while remaining focused on\ndelivering exceptional care and making a positive impact on the lives of\nindividuals that Civitas serves,” said David Schuppan, Partner at Vistria.\n\nAs a result of the completion of the merger, trading in Civitas’s common stock\non the New York Stock Exchange has been suspended.\n\nAbout Civitas\n\nCivitas Solutions, Inc. is the leading national provider of home- and\ncommunity-based health and human services to must-serve individuals with\nintellectual, developmental, physical or behavioral disabilities and other\nspecial needs. Since its founding in 1980, it has evolved from a single\nresidential program to a diversified national network offering an array of\nquality services in 36 states.\n\nAbout Centerbridge Partners\n\nCenterbridge Partners, L.P. is a private investment management firm employing\na flexible approach across investment disciplines – from private equity to\ncredit and related strategies, and real estate – in an effort to find the most\nattractive opportunities for our investors and business partners. The firm was\nfounded in 2005 and as of September 2018 had approximately $27 billion in\ncapital under management with offices in New York and London. Centerbridge is\ndedicated to partnering with world-class management teams across targeted\nindustry sectors and geographies to help companies achieve their operating and\nfinancial objectives. For more information, please visit www.centerbridge.com.\n\nAbout The Vistria Group\n\nThe Vistria Group, LP (“Vistria”) is a Chicago-based private investment firm\nfocused on investing in middle market companies in the healthcare, education,\nand financial services sectors. Vistria’s team is comprised of highly\nexperienced operating partners and private equity executives with proven track\nrecords of working with management teams in building innovative, market-\nleading companies. For more information, please visit www.vistria.com.\n\n## Contacts\n\nFor Civitas Solutions, Inc.: \nDwight Robson \nChief Public Strategy and Marketing Officer \n617-790-4800 \ndwight.robson@civitas-solutions.com \n \n For Centerbridge: \nJeremy Fielding / Anntal Silver \nKekst CNC \n212-521-4800\n\n![](https://mms.businesswire.com/media/20190308005282/en/446145/2/Civitas_1200_color-\nlarger-01.jpg)\n\n## Contacts\n\nFor Civitas Solutions, Inc.: \nDwight Robson \nChief Public Strategy and Marketing Officer \n617-790-4800 \ndwight.robson@civitas-solutions.com \n \n For Centerbridge: \nJeremy Fielding / Anntal Silver \nKekst CNC \n212-521-4800\n\n## Site Navigation\n\n Home\n Home\n Submit a Press Release\n Services\n News\n All News\n News with Multimedia\n News by Industry\n News by Subject\n News by Language\n Tradeshows & Events\n Education\n Overview\n Distribution & Media\n Media & Journalist Tools\n Sample Press Release\n Find Your News Online\n How-to\n Disclosure Resources\n About Us\n Overview\n Become a Member\n Contact Us\n Follow Us\n Careers\n Business Wire Newsroom\n Business Wire Events\n\n## Search\n\nAdvanced News Search\n\nAdvanced News Search ![Search](/images/icons/icon_search.gif)\n\n Log In\n Sign Up\n\n## Follow Us\n\n Twitter\n LinkedIn\n Google+\n\n## More from Business Wire\n\n Blog\n Apps\n UK/Ireland\n Deutschland\n France\n Hong Kong\n Italy\n Japan\n Tradeshownews.com\n\n## Business Wire Information\n\n Contact Us\n UK Tax Strategy\n Privacy Statement\n Terms of Use\n (C) 2019 Business Wire\n\nAccept the use of cookies Learn more\n\nI Accept\n\n", "contact_info": [{"name": "Dwight Robson", "other_information": ["Chief Public Strategy and Marketing Officer"], "phone": "617-790-4800", "email": "dwight.robson@civitas-solutions.com"}, {"name": "Jeremy Fielding / Anntal", "other_information": ["Jeremy Fielding / Anntal Silver", "Kekst CNC"], "phone": "212-521-4800"}], "date": "March 08, 2019", "time": "09:35 AM Eastern Standard Time", "published_date_time": "March 08, 2019 09:35 AM Eastern Standard Time", "entities": [{"company_name": "", "stock_name": "NYSE:CIVI"}], "company_1": "Civitas Solutions", "company_2": "Celtic Intermediate Corp."}