{"url": "https://www.businesswire.com/news/home/20190308005100/en/Walt-Disney-Company-Announces-Extension-Exchange-Offers", "body": "BURBANK, Calif.--(BUSINESS WIRE)--The Walt Disney Company (“TWDC”) (NYSE: DIS) announces the extension of the expiration date of the offers to exchange (the “Exchange Offers”) any and all outstanding notes (the “21CFA Notes”) issued by 21st Century Fox America, Inc. (“21CFA”) for up to $18,128,740,000 aggregate principal amount of new notes to be issued by TWDC Holdco 613 Corp. (“New Disney”, and such new notes, the “New Disney Notes”) and cash and the related consent solicitations (the “Consent Solicitations”) being made by New Disney on behalf of 21CFA to adopt certain proposed amendments (the “Proposed Amendments”) to the indentures governing the 21CFA Notes (the “21CFA Indentures”). New Disney hereby extends such expiration date from 5:00 p.m., New York City time, on March 14, 2019, to 5:00 p.m., New York City time, on March 15, 2019 (as the same may be further extended, the “Expiration Date”).\n\nAs of 5:00 p.m., New York City time, on March 7, 2019, the principal amounts of 21CFA Notes set forth in the table below had been validly tendered and not validly withdrawn:\n\nTitle of Series/CUSIP Number of 21CFA Notes Aggregate\n\nPrincipal\n\nAmount\n\nOutstanding 21CFA Notes Tendered as of 5:00 p.m.\n\nNew York City time on March 7, 2019 Principal\n\nAmount Percentage 5.650% Senior Notes due 2020 / 90131HAP0 / 652482BV1 / U65249AS0 / U88803AC2 $400,000,000 $363,678,000 90.92% 4.500% Senior Notes due 2021 / 90131HAQ8 $1,000,000,000 $851,747,000 85.17% 3.000% Senior Notes due 2022 / 90131HAR6 $1,000,000,000 $867,808,000 86.78% 8.875% Senior Debentures due 2023 / 90131HAS4 $250,000,000 $193,415,000 77.37% 4.000% Senior Notes due 2023 / 90131HAA3 $300,000,000 $278,719,000 92.91% 7.750% Senior Debentures due 2024 / 90131HAT2 / 652478AR9 $200,000,000 $178,321,000 89.16% 7.750% Senior Debentures due 2024 / 90131HAU9 / 652478AU2 $90,000,000 $64,842,000 72.05% 9.500% Senior Debentures due 2024 / 90131HAV7 $200,000,000 $185,702,000 92.85% 3.700% Senior Notes due 2024 / 90131HAE5 / 90131HAC9 / U88803AA6 $600,000,000 $565,778,000 94.30% 8.500% Senior Debentures due 2025 / 90131HAW5 $200,000,000 $170,774,000 85.39% 3.700% Senior Notes due 2025 / 90131HBW4 $600,000,000 $576,862,000 96.14% 7.700% Senior Debentures due 2025 / 90131HAX3 $250,000,000 $223,201,000 89.28% 7.430% Senior Debentures due 2026 / 90131HAY1 $240,000,000 $230,011,000 95.84% 3.375% Senior Notes due 2026 / 90131HCB9 / 90131HCA1 / U88803AF5 $450,000,000 $425,420,000 94.54% 7.125% Senior Debentures due 2028 / 90131HAZ8 $200,000,000 $178,880,000 89.44% 7.300% Senior Debentures due 2028 / 90131HBA2 $200,000,000 $193,999,000 97.00% 7.280% Senior Debentures due 2028 / 90131HBB0 $200,000,000 $192,305,000 96.15% 7.625% Senior Debentures due 2028 / 90131HBC8 $200,000,000 $187,160,000 93.58% 6.550% Senior Notes due 2033 / 90131HBD6 $350,000,000 $323,247,000 92.36% 8.450% Senior Debentures due 2034 / 90131HBE4 $200,000,000 $178,420,000 89.21% 6.200% Senior Notes due 2034 / 90131HBF1 / 652482BH2 $1,000,000,000 $969,531,000 96.95% 6.400% Senior Notes due 2035 / 90131HBG9 / 90131HBH7 / U65249AM3 $1,150,000,000 $1,004,988,000 87.39% 8.150% Senior Debentures due 2036 / 90131HBJ3 $300,000,000 $297,032,000 99.01% 6.150% Senior Notes due 2037 / 90131HBK0 $1,000,000,000 $874,881,000 87.49% 6.650% Senior Notes due 2037 / 90131HBL8 $1,250,000,000 $1,095,756,000 87.66% 6.750% Senior Debentures due 2038 / 90131HBM6 $248,740,000 $202,173,000 81.28% 7.850% Senior Notes due 2039 / 90131HBN4 $300,000,000 $254,294,000 84.76% 6.900% Senior Notes due 2039 / 90131HBP9 $600,000,000 $550,578,000 91.76% 6.150% Senior Notes due 2041 / 90131HBQ7 $1,500,000,000 $1,403,190,000 93.55% 5.400% Senior Notes due 2043 / 90131HAB1 $700,000,000 $672,017,000 96.00% 4.750% Senior Notes due 2044 / 90131HAH8 / 90131HAF2 / U88803AB4 $600,000,000 $568,633,000 94.77% 4.950% Senior Notes due 2045 / 90131HBZ7 $400,000,000 $389,358,000 97.34% 7.750% Senior Debentures due 2045 / 90131HBR5 $600,000,000 $560,073,000 93.35% 4.750% Senior Notes due 2046 / 90131HCD5 $400,000,000 $392,667,000 98.17% 7.900% Senior Debentures due 2095 / 90131HBS3 $150,000,000 $81,361,000 54.24% 8.250% Senior Debentures due 2096 / 90131HBT1 $100,000,000 $51,631,000 51.63%\n\nTenders of 21CFA Notes made pursuant to the Exchange Offers (but not consents delivered pursuant to the Consent Solicitations) may be validly withdrawn at or prior to the Expiration Date.\n\nSupplemental indentures effecting the Proposed Amendments relating to the 21CFA Notes were executed on October 22, 2018. Such supplemental indentures were valid and enforceable upon execution but will only become operative upon the settlement of the Exchange Offers and Consent Solicitations. As a result, the Proposed Amendments effected by the supplemental indentures will be deemed to be revoked retroactive to the date thereof if the Exchange Offers and Consent Solicitations are terminated or withdrawn prior to settlement.\n\nThe Exchange Offers and Consent Solicitations are being made pursuant to the terms and subject to the conditions set forth in the offering memorandum and consent solicitation statement dated October 5, 2018 (as amended by a supplement dated October 15, 2018, the “offering memorandum and consent solicitation statement”) and the related letter of transmittal (as amended by a supplement dated October 15, 2018, the “letter of transmittal”), each as amended by the related press releases dated October 29, 2018, November 27, 2018, January 8, 2019, January 18, 2019, January 25, 2019, January 29, 2019, January 30, 2019, February 6, 2019, February 21, 2019, March 1, 2019, March 5, 2019 and as amended hereby, and are conditioned upon the closing of New Disney’s acquisition (the “Acquisition”) of Twenty-First Century Fox (“21CF”), which condition may not be waived by New Disney, and certain other conditions that may be waived by New Disney.\n\nThe settlement of the Exchange Offers and Consent Solicitations is expected to occur promptly, but at least two business days, after the Expiration Date and is expected to occur on or about the closing date of the Acquisition. The closing of the Acquisition is expected to occur in the first half of calendar year 2019 and, as a result, the Expiration Date may be further extended one or more times. TWDC currently anticipates providing notice of any such extension in advance of the Expiration Date. If, at the Expiration Date, the conditions to the Exchange Offers and Consent Solicitations (other than the consummation of the Acquisition) have been satisfied or waived, then settlement will occur on or about the date the Acquisition is consummated. If the Acquisition is not consummated, or settlement does not otherwise occur, promptly following the Expiration Date, then the 21CFA Notes will be promptly returned to the tendering holders and the Proposed Amendments will be deemed to be revoked retroactive to the date of the supplemental indentures.\n\nEach series of New Disney Notes will have the same interest payment dates and regular record dates as the corresponding series of 21CFA Notes, provided that if the regular record date for the first interest payment date of any series of New Disney Notes would be a date prior to the settlement date, the record date for such first interest payment date will be the day immediately preceding such first interest payment date.\n\nExcept as described in this press release, all other terms of the Exchange Offers and Consent Solicitations remain unchanged.\n\nDocuments relating to the Exchange Offers and Consent Solicitations will only be distributed to eligible holders of 21CFA Notes who complete and return an eligibility form confirming that they are either a “qualified institutional buyer” under Rule 144A or not a “U.S. person” and outside the United States under Regulation S for purposes of applicable securities laws. Except as amended by press releases dated October 29, 2018, November 27, 2018, January 8, 2019, January 18, 2019, January 25, 2019, January 29, 2019, January 30, 2019, February 6, 2019, February 21, 2019, March 1, 2019, March 5, 2019 and as amended hereby, the complete terms and conditions of the Exchange Offers and Consent Solicitations are described in the offering memorandum and consent solicitation statement and letter of transmittal, copies of which may be obtained by contacting Global Bondholder Services Corporation, the exchange agent and information agent in connection with the Exchange Offers and Consent Solicitations, at (866) 470-3900 (U.S. toll-free) or (212) 430-3774 (banks and brokers). The eligibility form is available electronically at: http://gbsc-usa.com/eligibility/disney.\n\nThis press release does not constitute an offer to sell or purchase, or a solicitation of an offer to sell or purchase, or the solicitation of tenders or consents with respect to, any security. No offer, solicitation, purchase or sale will be made in any jurisdiction in which such an offer, solicitation or sale would be unlawful. The Exchange Offers and Consent Solicitations are being made solely pursuant to the offering memorandum and consent solicitation statement and letter of transmittal and only to such persons and in such jurisdictions as is permitted under applicable law.\n\nThe New Disney Notes offered in the Exchange Offers have not been registered under the Securities Act of 1933, as amended, or any state securities laws. Therefore, the New Disney Notes may not be offered or sold in the United States absent registration or an applicable exemption from the registration requirements of the Securities Act of 1933, as amended, and any applicable state securities laws.\n\nCautionary Notes on Forward Looking Statements\n\nThis communication contains “forward-looking statements” within the meaning of the federal securities laws, including Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. In this context, forward-looking statements often address expected future business and financial performance and financial condition, and often contain words such as “expect”, “anticipate”, “intend”, “plan”, “believe”, “seek”, “see”, “will”, “would”, “target”, similar expressions, and variations or negatives of these words. Forward-looking statements by their nature address matters that are, to different degrees, uncertain, such as statements about the consummation of the Acquisition and the anticipated benefits thereof and the expected timing of completion of the Exchange Offers and the Consent Solicitations. These and other forward-looking statements are not guarantees of future results and are subject to risks, uncertainties and assumptions that could cause actual results to differ materially from those expressed in any forward-looking statements, including the failure to consummate the Acquisition or to make any filing or take other action required to consummate such transaction in a timely matter or at all. Important risk factors that may cause such a difference include, but are not limited to the risk: (i) that the completion of the Acquisition may not occur on the anticipated terms and timing or at all, (ii) that the regulatory approvals required for completion of the Acquisition are not obtained, or that in order to obtain such regulatory approvals, conditions are imposed that adversely affect the anticipated benefits from the Acquisition or cause the parties to abandon the Acquisition, (iii) that a condition to closing of the Acquisition may not be satisfied (including, but not limited to, the receipt of legal opinions with respect to the treatment of certain aspects of the Acquisition under U.S. and Australian tax laws), (iv) that the anticipated tax treatment of the Acquisition is not obtained, (v) that potential litigation relating to the Acquisition is instituted against 21CF, TWDC, New Disney or their respective directors, (vi) of unforeseen liabilities, future capital expenditures, revenues, expenses, earnings, synergies, economic performance, indebtedness, financial condition and losses on the future prospects, business and management strategies for the management, expansion and growth of New Disney’s operations after the consummation of the Acquisition and on the other conditions to the completion of the Acquisition, and (vii) of adverse legal and regulatory developments or determinations or adverse changes in, or interpretations of, U.S., Australian or other foreign laws, rules or regulations, including tax laws, rules and regulations, that could delay or prevent completion of the Acquisition or cause the terms of the Acquisition to be modified, as well as management’s response to any of the aforementioned factors.\n\nAdditional factors are set forth in TWDC’s Annual Report on Form 10-K for the year ended September 29, 2018 under Item 1A, “Risk Factors”, and in subsequent reports.", "title": "The Walt Disney Company Announces Extension of Exchange Offers and Consent Solicitations for 21st Century Fox America, Inc. Notes", "images": [], "text": "\n\n![Business Wire](/images/bwlogo_extreme.png)\n\n# The Walt Disney Company Announces Extension of Exchange Offers and\nConsent Solicitations for 21st Century Fox America, Inc. Notes\n\nMarch 08, 2019 09:00 AM Eastern Standard Time\n\nBURBANK, Calif.--(BUSINESS WIRE)--The Walt Disney Company (“TWDC”) (NYSE: DIS)\nannounces the extension of the expiration date of the offers to exchange (the\n“Exchange Offers”) any and all outstanding notes (the “21CFA Notes”) issued by\n21st Century Fox America, Inc. (“21CFA”) for up to $18,128,740,000 aggregate\nprincipal amount of new notes to be issued by TWDC Holdco 613 Corp. (“New\nDisney”, and such new notes, the “New Disney Notes”) and cash and the related\nconsent solicitations (the “Consent Solicitations”) being made by New Disney\non behalf of 21CFA to adopt certain proposed amendments (the “Proposed\nAmendments”) to the indentures governing the 21CFA Notes (the “21CFA\nIndentures”). New Disney hereby extends such expiration date from 5:00 p.m.,\nNew York City time, on March 14, 2019, to 5:00 p.m., New York City time, on\nMarch 15, 2019 (as the same may be further extended, the “Expiration Date”).\n\nAs of 5:00 p.m., New York City time, on March 7, 2019, the principal amounts\nof 21CFA Notes set forth in the table below had been validly tendered and not\nvalidly withdrawn:\n\nTitle of Series/CUSIP Number of 21CFA Notes | | |\n\nAggregate \n Principal \n Amount \n Outstanding\n\n| | |\n\n21CFA Notes Tendered as of 5:00 p.m. \n New York City time on March 7, 2019 \n \n---|---|---|---|---|---|--- \n| | | |\n\nPrincipal \n Amount\n\n| | |\n\nPercentage \n \n5.650% Senior Notes due 2020 / 90131HAP0 / 652482BV1 / U65249AS0 / U88803AC2\n| | | $400,000,000 | | | $363,678,000 | | | 90.92% \n4.500% Senior Notes due 2021 / 90131HAQ8 | | | $1,000,000,000 | | |\n$851,747,000 | | | 85.17% \n3.000% Senior Notes due 2022 / 90131HAR6 | | | $1,000,000,000 | | |\n$867,808,000 | | | 86.78% \n8.875% Senior Debentures due 2023 / 90131HAS4 | | | $250,000,000 | | |\n$193,415,000 | | | 77.37% \n4.000% Senior Notes due 2023 / 90131HAA3 | | | $300,000,000 | | |\n$278,719,000 | | | 92.91% \n7.750% Senior Debentures due 2024 / 90131HAT2 / 652478AR9 | | |\n$200,000,000 | | | $178,321,000 | | | 89.16% \n7.750% Senior Debentures due 2024 / 90131HAU9 / 652478AU2 | | |\n$90,000,000 | | | $64,842,000 | | | 72.05% \n9.500% Senior Debentures due 2024 / 90131HAV7 | | | $200,000,000 | | |\n$185,702,000 | | | 92.85% \n3.700% Senior Notes due 2024 / 90131HAE5 / 90131HAC9 / U88803AA6 | | |\n$600,000,000 | | | $565,778,000 | | | 94.30% \n8.500% Senior Debentures due 2025 / 90131HAW5 | | | $200,000,000 | | |\n$170,774,000 | | | 85.39% \n3.700% Senior Notes due 2025 / 90131HBW4 | | | $600,000,000 | | |\n$576,862,000 | | | 96.14% \n7.700% Senior Debentures due 2025 / 90131HAX3 | | | $250,000,000 | | |\n$223,201,000 | | | 89.28% \n7.430% Senior Debentures due 2026 / 90131HAY1 | | | $240,000,000 | | |\n$230,011,000 | | | 95.84% \n3.375% Senior Notes due 2026 / 90131HCB9 / 90131HCA1 / U88803AF5 | | |\n$450,000,000 | | | $425,420,000 | | | 94.54% \n7.125% Senior Debentures due 2028 / 90131HAZ8 | | | $200,000,000 | | |\n$178,880,000 | | | 89.44% \n7.300% Senior Debentures due 2028 / 90131HBA2 | | | $200,000,000 | | |\n$193,999,000 | | | 97.00% \n7.280% Senior Debentures due 2028 / 90131HBB0 | | | $200,000,000 | | |\n$192,305,000 | | | 96.15% \n7.625% Senior Debentures due 2028 / 90131HBC8 | | | $200,000,000 | | |\n$187,160,000 | | | 93.58% \n6.550% Senior Notes due 2033 / 90131HBD6 | | | $350,000,000 | | |\n$323,247,000 | | | 92.36% \n8.450% Senior Debentures due 2034 / 90131HBE4 | | | $200,000,000 | | |\n$178,420,000 | | | 89.21% \n6.200% Senior Notes due 2034 / 90131HBF1 / 652482BH2 | | | $1,000,000,000\n| | | $969,531,000 | | | 96.95% \n6.400% Senior Notes due 2035 / 90131HBG9 / 90131HBH7 / U65249AM3 | | |\n$1,150,000,000 | | | $1,004,988,000 | | | 87.39% \n8.150% Senior Debentures due 2036 / 90131HBJ3 | | | $300,000,000 | | |\n$297,032,000 | | | 99.01% \n6.150% Senior Notes due 2037 / 90131HBK0 | | | $1,000,000,000 | | |\n$874,881,000 | | | 87.49% \n6.650% Senior Notes due 2037 / 90131HBL8 | | | $1,250,000,000 | | |\n$1,095,756,000 | | | 87.66% \n6.750% Senior Debentures due 2038 / 90131HBM6 | | | $248,740,000 | | |\n$202,173,000 | | | 81.28% \n7.850% Senior Notes due 2039 / 90131HBN4 | | | $300,000,000 | | |\n$254,294,000 | | | 84.76% \n6.900% Senior Notes due 2039 / 90131HBP9 | | | $600,000,000 | | |\n$550,578,000 | | | 91.76% \n6.150% Senior Notes due 2041 / 90131HBQ7 | | | $1,500,000,000 | | |\n$1,403,190,000 | | | 93.55% \n5.400% Senior Notes due 2043 / 90131HAB1 | | | $700,000,000 | | |\n$672,017,000 | | | 96.00% \n4.750% Senior Notes due 2044 / 90131HAH8 / 90131HAF2 / U88803AB4 | | |\n$600,000,000 | | | $568,633,000 | | | 94.77% \n4.950% Senior Notes due 2045 / 90131HBZ7 | | | $400,000,000 | | |\n$389,358,000 | | | 97.34% \n7.750% Senior Debentures due 2045 / 90131HBR5 | | | $600,000,000 | | |\n$560,073,000 | | | 93.35% \n4.750% Senior Notes due 2046 / 90131HCD5 | | | $400,000,000 | | |\n$392,667,000 | | | 98.17% \n7.900% Senior Debentures due 2095 / 90131HBS3 | | | $150,000,000 | | |\n$81,361,000 | | | 54.24% \n8.250% Senior Debentures due 2096 / 90131HBT1 | | | $100,000,000 | | |\n$51,631,000 | | | 51.63% \n| | | | | | | | | \n| | | | | | | | | \n \nTenders of 21CFA Notes made pursuant to the Exchange Offers (but not consents\ndelivered pursuant to the Consent Solicitations) may be validly withdrawn at\nor prior to the Expiration Date.\n\nSupplemental indentures effecting the Proposed Amendments relating to the\n21CFA Notes were executed on October 22, 2018. Such supplemental indentures\nwere valid and enforceable upon execution but will only become operative upon\nthe settlement of the Exchange Offers and Consent Solicitations. As a result,\nthe Proposed Amendments effected by the supplemental indentures will be deemed\nto be revoked retroactive to the date thereof if the Exchange Offers and\nConsent Solicitations are terminated or withdrawn prior to settlement.\n\nThe Exchange Offers and Consent Solicitations are being made pursuant to the\nterms and subject to the conditions set forth in the offering memorandum and\nconsent solicitation statement dated October 5, 2018 (as amended by a\nsupplement dated October 15, 2018, the “offering memorandum and consent\nsolicitation statement”) and the related letter of transmittal (as amended by\na supplement dated October 15, 2018, the “letter of transmittal”), each as\namended by the related press releases dated October 29, 2018, November 27,\n2018, January 8, 2019, January 18, 2019, January 25, 2019, January 29, 2019,\nJanuary 30, 2019, February 6, 2019, February 21, 2019, March 1, 2019, March 5,\n2019 and as amended hereby, and are conditioned upon the closing of New\nDisney’s acquisition (the “Acquisition”) of Twenty-First Century Fox (“21CF”),\nwhich condition may not be waived by New Disney, and certain other conditions\nthat may be waived by New Disney.\n\nThe settlement of the Exchange Offers and Consent Solicitations is expected to\noccur promptly, but at least two business days, after the Expiration Date and\nis expected to occur on or about the closing date of the Acquisition. The\nclosing of the Acquisition is expected to occur in the first half of calendar\nyear 2019 and, as a result, the Expiration Date may be further extended one or\nmore times. TWDC currently anticipates providing notice of any such extension\nin advance of the Expiration Date. If, at the Expiration Date, the conditions\nto the Exchange Offers and Consent Solicitations (other than the consummation\nof the Acquisition) have been satisfied or waived, then settlement will occur\non or about the date the Acquisition is consummated. If the Acquisition is not\nconsummated, or settlement does not otherwise occur, promptly following the\nExpiration Date, then the 21CFA Notes will be promptly returned to the\ntendering holders and the Proposed Amendments will be deemed to be revoked\nretroactive to the date of the supplemental indentures.\n\nEach series of New Disney Notes will have the same interest payment dates and\nregular record dates as the corresponding series of 21CFA Notes, provided that\nif the regular record date for the first interest payment date of any series\nof New Disney Notes would be a date prior to the settlement date, the record\ndate for such first interest payment date will be the day immediately\npreceding such first interest payment date.\n\nExcept as described in this press release, all other terms of the Exchange\nOffers and Consent Solicitations remain unchanged.\n\nDocuments relating to the Exchange Offers and Consent Solicitations will only\nbe distributed to eligible holders of 21CFA Notes who complete and return an\neligibility form confirming that they are either a “qualified institutional\nbuyer” under Rule 144A or not a “U.S. person” and outside the United States\nunder Regulation S for purposes of applicable securities laws. Except as\namended by press releases dated October 29, 2018, November 27, 2018, January\n8, 2019, January 18, 2019, January 25, 2019, January 29, 2019, January 30,\n2019, February 6, 2019, February 21, 2019, March 1, 2019, March 5, 2019 and as\namended hereby, the complete terms and conditions of the Exchange Offers and\nConsent Solicitations are described in the offering memorandum and consent\nsolicitation statement and letter of transmittal, copies of which may be\nobtained by contacting Global Bondholder Services Corporation, the exchange\nagent and information agent in connection with the Exchange Offers and Consent\nSolicitations, at (866) 470-3900 (U.S. toll-free) or (212) 430-3774 (banks and\nbrokers). The eligibility form is available electronically at: http://gbsc-\nusa.com/eligibility/disney.\n\n_This press release does not constitute an offer to sell or purchase, or a\nsolicitation of an offer to sell or purchase, or the solicitation of tenders\nor consents with respect to, any security. No offer, solicitation, purchase or\nsale will be made in any jurisdiction in which such an offer, solicitation or\nsale would be unlawful. The Exchange Offers and Consent Solicitations are\nbeing made solely pursuant to the offering memorandum and consent solicitation\nstatement and letter of transmittal and only to such persons and in such\njurisdictions as is permitted under applicable law._\n\n_The New Disney Notes offered in the Exchange Offers have not been registered\nunder the Securities Act of 1933, as amended, or any state securities laws.\nTherefore, the New Disney Notes may not be offered or sold in the United\nStates absent registration or an applicable exemption from the registration\nrequirements of the Securities Act of 1933, as amended, and any applicable\nstate securities laws._\n\nCautionary Notes on Forward Looking Statements\n\nThis communication contains “forward-looking statements” within the meaning of\nthe federal securities laws, including Section 27A of the Securities Act of\n1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as\namended. In this context, forward-looking statements often address expected\nfuture business and financial performance and financial condition, and often\ncontain words such as “expect”, “anticipate”, “intend”, “plan”, “believe”,\n“seek”, “see”, “will”, “would”, “target”, similar expressions, and variations\nor negatives of these words. Forward-looking statements by their nature\naddress matters that are, to different degrees, uncertain, such as statements\nabout the consummation of the Acquisition and the anticipated benefits thereof\nand the expected timing of completion of the Exchange Offers and the Consent\nSolicitations. These and other forward-looking statements are not guarantees\nof future results and are subject to risks, uncertainties and assumptions that\ncould cause actual results to differ materially from those expressed in any\nforward-looking statements, including the failure to consummate the\nAcquisition or to make any filing or take other action required to consummate\nsuch transaction in a timely matter or at all. Important risk factors that may\ncause such a difference include, but are not limited to the risk: (i) that the\ncompletion of the Acquisition may not occur on the anticipated terms and\ntiming or at all, (ii) that the regulatory approvals required for completion\nof the Acquisition are not obtained, or that in order to obtain such\nregulatory approvals, conditions are imposed that adversely affect the\nanticipated benefits from the Acquisition or cause the parties to abandon the\nAcquisition, (iii) that a condition to closing of the Acquisition may not be\nsatisfied (including, but not limited to, the receipt of legal opinions with\nrespect to the treatment of certain aspects of the Acquisition under U.S. and\nAustralian tax laws), (iv) that the anticipated tax treatment of the\nAcquisition is not obtained, (v) that potential litigation relating to the\nAcquisition is instituted against 21CF, TWDC, New Disney or their respective\ndirectors, (vi) of unforeseen liabilities, future capital expenditures,\nrevenues, expenses, earnings, synergies, economic performance, indebtedness,\nfinancial condition and losses on the future prospects, business and\nmanagement strategies for the management, expansion and growth of New Disney’s\noperations after the consummation of the Acquisition and on the other\nconditions to the completion of the Acquisition, and (vii) of adverse legal\nand regulatory developments or determinations or adverse changes in, or\ninterpretations of, U.S., Australian or other foreign laws, rules or\nregulations, including tax laws, rules and regulations, that could delay or\nprevent completion of the Acquisition or cause the terms of the Acquisition to\nbe modified, as well as management’s response to any of the aforementioned\nfactors.\n\nAdditional factors are set forth in TWDC’s Annual Report on Form 10-K for the\nyear ended September 29, 2018 under Item 1A, “Risk Factors”, and in subsequent\nreports.\n\n## Contacts\n\nMedia Contact: \nDavid Jefferson \ndavid.j.jefferson@disney.com \n818-560-4832\n\nInvestor Contact: \nLowell Singer \nlowell.singer@disney.com \n818-560-6601\n\n## Contacts\n\nMedia Contact: \nDavid Jefferson \ndavid.j.jefferson@disney.com \n818-560-4832\n\nInvestor Contact: \nLowell Singer \nlowell.singer@disney.com \n818-560-6601\n\n## Site Navigation\n\n Home\n Home\n Submit a Press Release\n Services\n News\n All News\n News with Multimedia\n News by Industry\n News by Subject\n News by Language\n Tradeshows & Events\n Education\n Overview\n Distribution & Media\n Media & Journalist Tools\n Sample Press Release\n Find Your News Online\n How-to\n Disclosure Resources\n About Us\n Overview\n Become a Member\n Contact Us\n Follow Us\n Careers\n Business Wire Newsroom\n Business Wire Events\n\n## Search\n\nAdvanced News Search\n\nAdvanced News Search ![Search](/images/icons/icon_search.gif)\n\n Log In\n Sign Up\n\n## Follow Us\n\n Twitter\n LinkedIn\n Google+\n\n## More from Business Wire\n\n Blog\n Apps\n UK/Ireland\n Deutschland\n France\n Hong Kong\n Italy\n Japan\n Tradeshownews.com\n\n## Business Wire Information\n\n Contact Us\n UK Tax Strategy\n Privacy Statement\n Terms of Use\n (C) 2019 Business Wire\n\nAccept the use of cookies Learn more\n\nI Accept\n\n", "contact_info": [{"name": "David Jefferson", "email": "david.j.jefferson@disney.com", "phone": "818-560-4832"}, {"name": "Lowell Singer", "email": "lowell.singer@disney.com", "phone": "818-560-6601"}], "date": "March 08, 2019", "time": "09:00 AM Eastern Standard Time", "published_date_time": "March 08, 2019 09:00 AM Eastern Standard Time", "entities": [{"company_name": "", "stock_name": "NYSE: DIS"}], "company_1": "The Walt Disney Company", "company_2": "21st Century Fox America"}