{"url": "https://www.businesswire.com/news/home/20190308005225/en/Versum-Materials-Board-Comments-Merck-KGaA-Letter", "body": "TEMPE, Ariz.--(BUSINESS WIRE)--The Board of Directors of Versum Materials, Inc. (NYSE: VSM), a leading specialty materials supplier to the semiconductor industry, today issued the following statement reiterating its decision to reject Merck KGaA’s (“Merck”) unsolicited and non-binding $48 per share proposal, and reaffirming its commitment to completing the proposed merger of equals transaction with Entegris, Inc. (NASDAQ: ENTG).\n\n“ The Versum Board of Directors stands by its analysis that Merck’s unsolicited proposal for Versum is not a Superior Proposal. We believe Merck’s commentary regarding its proposal is misleading, mischaracterizes our independent financial analysis, and confuses an all-stock merger of equals with a change in control transaction,” said Seifi Ghasemi, Chairman of the Versum Board of Directors. “ The appropriate comparison is not between Merck’s proposal and the standalone value of Versum, but rather between selling now to Merck based upon their proposal and remaining invested in the combined Entegris-Versum, with participation in the significant expected value creation of the Versum-Entegris merger of equals and the potential for additional value-creating strategic options. We believe Versum’s carefully studied merger with Entegris is the superior strategic and financial combination. Our prior conclusion is further solidified by a number of key value drivers jointly announced by the two companies today including: additional cost synergies, significant revenue synergy upside, savings from tax optimization, and significant additional shareholder value creation potential through utilization of our strong balance sheet at closing.”\n\nVersum-Entegris Transaction Summary\n\nUnder the terms of the merger agreement, Versum Materials stockholders will receive 1.120 shares of Entegris for each existing Versum Materials share. Upon completion of the merger, Entegris stockholders will own approximately 52.5 percent and Versum Materials stockholders will own approximately 47.5 percent of the combined company. The transaction remains on track to close in the second half of 2019, subject to the satisfaction of customary closing conditions, including receipt of U.S. and international regulatory approvals, and approval by the stockholders of each company. As previously announced, the combined company will retain the Entegris name and will be headquartered in Billerica, Massachusetts, and will maintain a strong operational presence in Tempe, Arizona.\n\nLazard is serving as financial advisor to Versum Materials and Simpson Thacher & Bartlett LLP is serving as legal counsel.\n\nAbout Versum Materials\n\nVersum Materials, Inc. (NYSE: VSM) is a leading global specialty materials company providing high-purity chemicals and gases, delivery systems, services and materials expertise to meet the evolving needs of the global semiconductor and display industries. Derived from the Latin word for \"toward,\" the name \"Versum\" communicates the company's deep commitment to helping customers move toward the future by collaborating, innovating and creating cutting-edge solutions.\n\nA global leader in technology, quality, safety and reliability, Versum Materials is one of the world's leading suppliers of next-generation CMP slurries, ultra-thin dielectric and metal film precursors, formulated cleans and etching products, and delivery equipment that has revolutionized the semiconductor industry. Versum Materials reported fiscal year 2018 annual sales of about U.S. $1.4 billion, has approximately 2,300 employees and operates 14 major facilities in Asia and the North America. It is headquartered in Tempe, Arizona. Versum Materials had operated for more than three decades as a division of Air Products and Chemicals, Inc. (NYSE:APD).\n\nFor additional information, please visit http://www.versummaterials.com.\n\nForward Looking Statements\n\nThis communication contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 that are subject to risks and uncertainties and are made pursuant to the safe harbor provisions of Section 27A of the Securities Act of 1993, as amended and Section 21E of the Securities Exchange Act of 1934, as amended. Where a forward-looking statement expresses or implies an expectation or belief as to future events or results, such expectation or belief is expressed in good faith and believed to have a reasonable basis. The words “believe” “continue,” “could,” “expect,” “anticipate,” “intends,” “estimate,” “forecast,” “project,” “should,” “may,” “will,” “would” or the negative thereof and similar expressions are intended to identify such forward-looking statements. These forward-looking statements are only predictions and involve known and unknown risks and uncertainties, many of which are beyond Versum Materials, Inc.’s (“Versum Materials”) and Entegris, Inc.’s (“Entegris”) control. Statements in this communication regarding Versum Materials, Entegris and the combined company that are forward-looking, including projections as to the anticipated benefits of the proposed transaction, the impact of the proposed transaction on Versum Materials’ and Entegris’ business and future financial and operating results, the amount and timing of synergies from the proposed transaction, and the closing date for the proposed transaction, are based on management’s estimates, assumptions and projections, and are subject to significant uncertainties and other factors, many of which are beyond Versum Materials’ and Entegris’ control. These factors and risks include, but are not limited to, (i) weakening of global and/or regional economic conditions, generally or specifically in the semiconductor industry, which could decrease the demand for Versum Materials’ and Entegris’ products and solutions; (ii) the ability to meet rapid demand shifts; (iii) the ability to continue technological innovation and introduce new products to meet customers’ rapidly changing requirements; (iv) the concentrated customer base; (v) the ability to identify, effect and integrate acquisitions, joint ventures or other transactions; (vi) the ability to protect and enforce intellectual property rights; (vii) operational, political and legal risks of Versum Materials’ and Entegris’ international operations; (viii) Entegris’ dependence on sole source and limited source suppliers; (ix) the increasing complexity of certain manufacturing processes; (x) raw material shortages and price increases; (xi) changes in government regulations of the countries in which Versum Materials and Entegris operate; (xii) the fluctuation of currency exchange rates; (xiii) fluctuations in the market price of Entegris’ stock; (xiv) the level of, and obligations associated with, Versum Materials’ and Entegris’ indebtedness; and (xv) other risk factors and additional information. In addition, material risks that could cause actual results to differ from forward-looking statements include: the inherent uncertainty associated with financial or other projections; the prompt and effective integration of Entegris’ businesses and the ability to achieve the anticipated synergies and value-creation contemplated by the proposed transaction; the risk associated with Versum Materials’ and Entegris’ ability to obtain the approval of the proposed transaction by their shareholders required to consummate the proposed transaction and the timing of the closing of the proposed transaction, including the risk that the conditions to the transaction are not satisfied on a timely basis or at all and the failure of the transaction to close for any other reason; the risk that a consent or authorization that may be required for the proposed transaction is not obtained or is obtained subject to conditions that are not anticipated; unanticipated difficulties or expenditures relating to the transaction, the response of business partners and retention as a result of the announcement and pendency of the transaction; and the diversion of management time on transaction-related issues. For a more detailed discussion of such risks and other factors, see Versum Materials’ and Entegris’ filings with the Securities and Exchange Commission, including under the headings “Cautionary Statement Regarding Forward-Looking Statements” and “Risk Factors” in Entegris’ and Versum Materials’ preliminary joint proxy statement/prospectus that forms part of the registration statement on Form S-4 filed by Entegris, “Risks Factors” in Item 1A of Entegris’ Annual Report on Form 10-K for the fiscal year ended December 31, 2017, filed on February 15, 2018, and Versum Materials’ Annual Report on Form 10-K for the fiscal year ended September 30, 2018, filed on November 21, 2018 and in other periodic filings, available on the SEC website or www.entegris.com or www.versummaterials.com. Versum Materials and Entegris assume no obligation to update any forward-looking statements or information, which speak as of their respective dates, to reflect events or circumstances after the date of this communication, or to reflect the occurrence of unanticipated events, except as may be required under applicable securities laws. Investors should not assume that any lack of update to a previously issued “forward-looking statement” constitutes a reaffirmation of that statement.\n\nAdditional Information and Where to Find It\n\nThis communication does not constitute an offer to buy or sell or the solicitation of an offer to buy or sell any securities or a solicitation of any vote or approval. This communication relates to a proposed business combination between Versum Materials and Entegris. In connection with the proposed transaction, Entegris filed with the Securities and Exchange Commission (the “SEC”) a registration statement on Form S-4 on February 28, 2019 that includes a preliminary joint proxy statement of Versum Materials and Entegris that also constitutes a preliminary prospectus of Entegris. The registration statement has not yet become effective. Each of Versum Materials and Entegris also plan to file other relevant documents with the SEC regarding the proposed transaction. No offering of securities shall be made, except by means of a prospectus meeting the requirements of Section 10 of the U.S. Securities Act of 1933, as amended. Any definitive joint proxy statement/prospectus (if and when available) will be mailed to stockholders of Versum Materials and Entegris. INVESTORS AND SECURITY HOLDERS ARE URGED TO READ THE REGISTRATION STATEMENT, JOINT PROXY STATEMENT/PROSPECTUS AND OTHER DOCUMENTS FILED OR THAT MAY BE FILED WITH THE SEC CAREFULLY AND IN THEIR ENTIRETY IF AND WHEN THEY BECOME AVAILABLE BECAUSE THEY WILL CONTAIN IMPORTANT INFORMATION ABOUT THE PROPOSED TRANSACTION. Investors and security holders will be able to obtain free copies of these documents (if and when available) and other documents containing important information about Versum Materials and Entegris, once such documents are filed with the SEC through the website maintained by the SEC at http://www.sec.gov. Copies of the documents filed with the SEC by Entegris will be available free of charge on Entegris’ website at http://www.entegris.com or by contacting Entegris’ Investor Relations Department by email at irelations@entegris.com or by phone at 978-436-6500. Copies of the documents filed with the SEC by Versum Materials will be available free of charge on Versum Materials’ website at http://investors.versummaterials.com or by phone at 484-275-5907.\n\nParticipants in the Solicitation\n\nVersum Materials, Entegris and certain of their respective directors and executive officers may be deemed to be participants in the solicitation of proxies in respect of the proposed transaction. Information about the directors and executive officers of Versum Materials are set forth in its proxy statement for its 2019 annual meeting of shareholders, which was filed with the SEC on December 20, 2018, and Versum Materials’ Annual Report on Form 10-K for the fiscal year ended September 30, 2018, which was filed with the SEC on November 21, 2018. Information about the directors and executive officers of Entegris are set forth in Entegris’ proxy statement for its 2018 annual meeting of shareholders, which was filed with the SEC on March 28, 2018, and Entegris’ Annual Report on Form 10-K for the fiscal year ended December 31, 2017, which was filed with the SEC on February 15, 2018. Other information regarding the participants in the proxy solicitations and a description of their direct and indirect interests, by security holdings or otherwise, will be contained in the joint proxy statement/prospectus and other relevant materials to be filed with the SEC regarding the proposed transaction when such materials become available. Investors should read the joint proxy statement/prospectus carefully when it becomes available before making any voting or investment decisions. You may obtain free copies of these documents from Versum Materials or Entegris using the sources indicated above.", "title": "Versum Materials Board Comments on Merck KGaA Letter", "images": [], "text": "\n\n![Business Wire](/images/bwlogo_extreme.png)\n\n# Versum Materials Board Comments on Merck KGaA Letter\n\nMarch 08, 2019 08:30 AM Eastern Standard Time\n\nTEMPE, Ariz.--(BUSINESS WIRE)--The Board of Directors of Versum Materials,\nInc. (NYSE: VSM), a leading specialty materials supplier to the semiconductor\nindustry, today issued the following statement reiterating its decision to\nreject Merck KGaA’s (“Merck”) unsolicited and non-binding $48 per share\nproposal, and reaffirming its commitment to completing the proposed merger of\nequals transaction with Entegris, Inc. (NASDAQ: ENTG).\n\n“The Versum Board of Directors stands by its analysis that Merck’s unsolicited\nproposal for Versum is not a Superior Proposal. We believe Merck’s commentary\nregarding its proposal is misleading, mischaracterizes our independent\nfinancial analysis, and confuses an all-stock merger of equals with a change\nin control transaction,” said Seifi Ghasemi, Chairman of the Versum Board of\nDirectors. “The appropriate comparison is not between Merck’s proposal and the\nstandalone value of Versum, but rather between selling now to Merck based upon\ntheir proposal and remaining invested in the combined Entegris-Versum, with\nparticipation in the significant expected value creation of the Versum-\nEntegris merger of equals and the potential for additional value-creating\nstrategic options. We believe Versum’s carefully studied merger with Entegris\nis the superior strategic and financial combination. Our prior conclusion is\nfurther solidified by a number of key value drivers jointly announced by the\ntwo companies today including: additional cost synergies, significant revenue\nsynergy upside, savings from tax optimization, and significant additional\nshareholder value creation potential through utilization of our strong balance\nsheet at closing.”\n\nVersum-Entegris Transaction Summary\n\nUnder the terms of the merger agreement, Versum Materials stockholders will\nreceive 1.120 shares of Entegris for each existing Versum Materials share.\nUpon completion of the merger, Entegris stockholders will own approximately\n52.5 percent and Versum Materials stockholders will own approximately 47.5\npercent of the combined company. The transaction remains on track to close in\nthe second half of 2019, subject to the satisfaction of customary closing\nconditions, including receipt of U.S. and international regulatory approvals,\nand approval by the stockholders of each company. As previously announced, the\ncombined company will retain the Entegris name and will be headquartered in\nBillerica, Massachusetts, and will maintain a strong operational presence in\nTempe, Arizona.\n\nLazard is serving as financial advisor to Versum Materials and Simpson Thacher\n& Bartlett LLP is serving as legal counsel.\n\nAbout Versum Materials\n\nVersum Materials, Inc. (NYSE: VSM) is a leading global specialty materials\ncompany providing high-purity chemicals and gases, delivery systems, services\nand materials expertise to meet the evolving needs of the global semiconductor\nand display industries. Derived from the Latin word for \"toward,\" the name\n\"Versum\" communicates the company's deep commitment to helping customers move\ntoward the future by collaborating, innovating and creating cutting-edge\nsolutions.\n\nA global leader in technology, quality, safety and reliability, Versum\nMaterials is one of the world's leading suppliers of next-generation CMP\nslurries, ultra-thin dielectric and metal film precursors, formulated cleans\nand etching products, and delivery equipment that has revolutionized the\nsemiconductor industry. Versum Materials reported fiscal year 2018 annual\nsales of about U.S. $1.4 billion, has approximately 2,300 employees and\noperates 14 major facilities in Asia and the North America. It is\nheadquartered in Tempe, Arizona. Versum Materials had operated for more than\nthree decades as a division of Air Products and Chemicals, Inc. (NYSE:APD).\n\nFor additional information, please visit http://www.versummaterials.com.\n\nForward Looking Statements\n\nThis communication contains forward-looking statements within the meaning of\nthe Private Securities Litigation Reform Act of 1995 that are subject to risks\nand uncertainties and are made pursuant to the safe harbor provisions of\nSection 27A of the Securities Act of 1993, as amended and Section 21E of the\nSecurities Exchange Act of 1934, as amended. Where a forward-looking statement\nexpresses or implies an expectation or belief as to future events or results,\nsuch expectation or belief is expressed in good faith and believed to have a\nreasonable basis. The words “believe” “continue,” “could,” “expect,”\n“anticipate,” “intends,” “estimate,” “forecast,” “project,” “should,” “may,”\n“will,” “would” or the negative thereof and similar expressions are intended\nto identify such forward-looking statements. These forward-looking statements\nare only predictions and involve known and unknown risks and uncertainties,\nmany of which are beyond Versum Materials, Inc.’s (“Versum Materials”) and\nEntegris, Inc.’s (“Entegris”) control. Statements in this communication\nregarding Versum Materials, Entegris and the combined company that are\nforward-looking, including projections as to the anticipated benefits of the\nproposed transaction, the impact of the proposed transaction on Versum\nMaterials’ and Entegris’ business and future financial and operating results,\nthe amount and timing of synergies from the proposed transaction, and the\nclosing date for the proposed transaction, are based on management’s\nestimates, assumptions and projections, and are subject to significant\nuncertainties and other factors, many of which are beyond Versum Materials’\nand Entegris’ control. These factors and risks include, but are not limited\nto, (i) weakening of global and/or regional economic conditions, generally or\nspecifically in the semiconductor industry, which could decrease the demand\nfor Versum Materials’ and Entegris’ products and solutions; (ii) the ability\nto meet rapid demand shifts; (iii) the ability to continue technological\ninnovation and introduce new products to meet customers’ rapidly changing\nrequirements; (iv) the concentrated customer base; (v) the ability to\nidentify, effect and integrate acquisitions, joint ventures or other\ntransactions; (vi) the ability to protect and enforce intellectual property\nrights; (vii) operational, political and legal risks of Versum Materials’ and\nEntegris’ international operations; (viii) Entegris’ dependence on sole source\nand limited source suppliers; (ix) the increasing complexity of certain\nmanufacturing processes; (x) raw material shortages and price increases; (xi)\nchanges in government regulations of the countries in which Versum Materials\nand Entegris operate; (xii) the fluctuation of currency exchange rates; (xiii)\nfluctuations in the market price of Entegris’ stock; (xiv) the level of, and\nobligations associated with, Versum Materials’ and Entegris’ indebtedness; and\n(xv) other risk factors and additional information. In addition, material\nrisks that could cause actual results to differ from forward-looking\nstatements include: the inherent uncertainty associated with financial or\nother projections; the prompt and effective integration of Entegris’\nbusinesses and the ability to achieve the anticipated synergies and value-\ncreation contemplated by the proposed transaction; the risk associated with\nVersum Materials’ and Entegris’ ability to obtain the approval of the proposed\ntransaction by their shareholders required to consummate the proposed\ntransaction and the timing of the closing of the proposed transaction,\nincluding the risk that the conditions to the transaction are not satisfied on\na timely basis or at all and the failure of the transaction to close for any\nother reason; the risk that a consent or authorization that may be required\nfor the proposed transaction is not obtained or is obtained subject to\nconditions that are not anticipated; unanticipated difficulties or\nexpenditures relating to the transaction, the response of business partners\nand retention as a result of the announcement and pendency of the transaction;\nand the diversion of management time on transaction-related issues. For a more\ndetailed discussion of such risks and other factors, see Versum Materials’ and\nEntegris’ filings with the Securities and Exchange Commission, including under\nthe headings “Cautionary Statement Regarding Forward-Looking Statements” and\n“Risk Factors” in Entegris’ and Versum Materials’ preliminary joint proxy\nstatement/prospectus that forms part of the registration statement on Form S-4\nfiled by Entegris, “Risks Factors” in Item 1A of Entegris’ Annual Report on\nForm 10-K for the fiscal year ended December 31, 2017, filed on February 15,\n2018, and Versum Materials’ Annual Report on Form 10-K for the fiscal year\nended September 30, 2018, filed on November 21, 2018 and in other periodic\nfilings, available on the SEC website or www.entegris.com or\nwww.versummaterials.com. Versum Materials and Entegris assume no obligation to\nupdate any forward-looking statements or information, which speak as of their\nrespective dates, to reflect events or circumstances after the date of this\ncommunication, or to reflect the occurrence of unanticipated events, except as\nmay be required under applicable securities laws. Investors should not assume\nthat any lack of update to a previously issued “forward-looking statement”\nconstitutes a reaffirmation of that statement.\n\nAdditional Information and Where to Find It\n\nThis communication does not constitute an offer to buy or sell or the\nsolicitation of an offer to buy or sell any securities or a solicitation of\nany vote or approval. This communication relates to a proposed business\ncombination between Versum Materials and Entegris. In connection with the\nproposed transaction, Entegris filed with the Securities and Exchange\nCommission (the “SEC”) a registration statement on Form S-4 on February 28,\n2019 that includes a preliminary joint proxy statement of Versum Materials and\nEntegris that also constitutes a preliminary prospectus of Entegris. The\nregistration statement has not yet become effective. Each of Versum Materials\nand Entegris also plan to file other relevant documents with the SEC regarding\nthe proposed transaction. No offering of securities shall be made, except by\nmeans of a prospectus meeting the requirements of Section 10 of the U.S.\nSecurities Act of 1933, as amended. Any definitive joint proxy\nstatement/prospectus (if and when available) will be mailed to stockholders of\nVersum Materials and Entegris. INVESTORS AND SECURITY HOLDERS ARE URGED TO\nREAD THE REGISTRATION STATEMENT, JOINT PROXY STATEMENT/PROSPECTUS AND OTHER\nDOCUMENTS FILED OR THAT MAY BE FILED WITH THE SEC CAREFULLY AND IN THEIR\nENTIRETY IF AND WHEN THEY BECOME AVAILABLE BECAUSE THEY WILL CONTAIN IMPORTANT\nINFORMATION ABOUT THE PROPOSED TRANSACTION. Investors and security holders\nwill be able to obtain free copies of these documents (if and when available)\nand other documents containing important information about Versum Materials\nand Entegris, once such documents are filed with the SEC through the website\nmaintained by the SEC at http://www.sec.gov. Copies of the documents filed\nwith the SEC by Entegris will be available free of charge on Entegris’ website\nat http://www.entegris.com or by contacting Entegris’ Investor Relations\nDepartment by email at irelations@entegris.com or by phone at 978-436-6500.\nCopies of the documents filed with the SEC by Versum Materials will be\navailable free of charge on Versum Materials’ website at\nhttp://investors.versummaterials.com or by phone at 484-275-5907.\n\nParticipants in the Solicitation\n\nVersum Materials, Entegris and certain of their respective directors and\nexecutive officers may be deemed to be participants in the solicitation of\nproxies in respect of the proposed transaction. Information about the\ndirectors and executive officers of Versum Materials are set forth in its\nproxy statement for its 2019 annual meeting of shareholders, which was filed\nwith the SEC on December 20, 2018, and Versum Materials’ Annual Report on Form\n10-K for the fiscal year ended September 30, 2018, which was filed with the\nSEC on November 21, 2018. Information about the directors and executive\nofficers of Entegris are set forth in Entegris’ proxy statement for its 2018\nannual meeting of shareholders, which was filed with the SEC on March 28,\n2018, and Entegris’ Annual Report on Form 10-K for the fiscal year ended\nDecember 31, 2017, which was filed with the SEC on February 15, 2018. Other\ninformation regarding the participants in the proxy solicitations and a\ndescription of their direct and indirect interests, by security holdings or\notherwise, will be contained in the joint proxy statement/prospectus and other\nrelevant materials to be filed with the SEC regarding the proposed transaction\nwhen such materials become available. Investors should read the joint proxy\nstatement/prospectus carefully when it becomes available before making any\nvoting or investment decisions. You may obtain free copies of these documents\nfrom Versum Materials or Entegris using the sources indicated above.\n\n## Contacts\n\nVersum Materials \nSoohwan Kim, CFA \nHead of Investor Relations \n602-282-0957 \nSoohwan.Kim@versummaterials.com \nTiffany Elle \nGlobal Communications \n480-282-6475 \nTiffany.Elle@versummaterials.com \nOr \nMeghan Gavigan / Emily Claffey / Julie Rudnick \nSard Verbinnen & Co \n212-687-8080\n\n## Contacts\n\nVersum Materials \nSoohwan Kim, CFA \nHead of Investor Relations \n602-282-0957 \nSoohwan.Kim@versummaterials.com \nTiffany Elle \nGlobal Communications \n480-282-6475 \nTiffany.Elle@versummaterials.com \nOr \nMeghan Gavigan / Emily Claffey / Julie Rudnick \nSard Verbinnen & Co \n212-687-8080\n\n## Site Navigation\n\n Home\n Home\n Submit a Press Release\n Services\n News\n All News\n News with Multimedia\n News by Industry\n News by Subject\n News by Language\n Tradeshows & Events\n Education\n Overview\n Distribution & Media\n Media & Journalist Tools\n Sample Press Release\n Find Your News Online\n How-to\n Disclosure Resources\n About Us\n Overview\n Become a Member\n Contact Us\n Follow Us\n Careers\n Business Wire Newsroom\n Business Wire Events\n\n## Search\n\nAdvanced News Search\n\nAdvanced News Search ![Search](/images/icons/icon_search.gif)\n\n Log In\n Sign Up\n\n## Follow Us\n\n Twitter\n LinkedIn\n Google+\n\n## More from Business Wire\n\n Blog\n Apps\n UK/Ireland\n Deutschland\n France\n Hong Kong\n Italy\n Japan\n Tradeshownews.com\n\n## Business Wire Information\n\n Contact Us\n UK Tax Strategy\n Privacy Statement\n Terms of Use\n (C) 2019 Business Wire\n\nAccept the use of cookies Learn more\n\nI Accept\n\n", "contact_info": [{"name": "Soohwan Kim", "other_information": ["Soohwan Kim, CFA", "Head of Investor Relations", "Tiffany Elle", "Global Communications"], "phone": "480-282-6475", "email": "Tiffany.Elle@versummaterials.com"}, {"name": "Meghan Gavigan", "other_information": ["Meghan Gavigan / Emily Claffey / Julie Rudnick", "Sard Verbinnen & Co"], "phone": "212-687-8080"}], "date": "March 08, 2019", "time": "08:30 AM Eastern Standard Time", "published_date_time": "March 08, 2019 08:30 AM Eastern Standard Time", "entities": [{"company_name": "Versum Materials, Inc.", "stock_name": "NYSE: VSM"}, {"company_name": "Entegris, Inc.", "stock_name": "NASDAQ: ENTG"}], "company_1": "The Board", "company_2": "Directors"}