{"url": "https://www.businesswire.com/news/home/20190308005224/en/Versum-Materials-Entegris-Issue-Open-Letter-Shareholders", "body": "TEMPE, Ariz. & BILLERICA, Mass.--(BUSINESS WIRE)--Versum Materials, Inc. (NYSE:VSM), a leading specialty materials supplier to the semiconductor industry, and Entegris, Inc. (NASDAQ:ENTG), a leader in specialty chemicals and advanced materials solutions for the microelectronics industry, today issued the following letter to Versum and Entegris shareholders reiterating the powerful value-creation potential and compelling strategic benefits of the previously announced merger of equals:\n\nMarch 8, 2019\n\nDear Versum and Entegris Shareholders:\n\nWe are writing to you on behalf of the Versum Materials and Entegris management teams and Boards of Directors regarding the merger of equals between our two companies we announced on January 28, 2019. We believe it is important to set the record straight about the compelling strategic benefits the combined company will have as a premier specialty materials company and reiterate our confidence in the significant shareholder value we will deliver as one company. Key points are as follows:\n\nThe Entegris-Versum transaction is a true, all-stock, remain-invested, merger of equals that has tremendous upside value-creation potential. In a combination with Entegris, Versum shareholders will achieve significant value creation from the strength of the combined company, outsized revenue growth and cash flow generation, and enhanced capital returns. Given the leadership position the combined company will hold in the semiconductor and specialty chemicals industry, the combined company will retain the ability to pursue a full range of additional value-creating strategic options going forward.\n\nIn a combination with Entegris, Versum shareholders will achieve significant value creation from the strength of the combined company, outsized revenue growth and cash flow generation, and enhanced capital returns. Given the leadership position the combined company will hold in the semiconductor and specialty chemicals industry, the combined company will retain the ability to pursue a full range of additional value-creating strategic options going forward. There is significant cost, revenue and tax synergy potential within the proposed combination of Entegris and Versum. The integration teams of both companies have worked closely over the past month, and as a result of those detailed efforts, the combined company now expects to achieve more than $125 million in cost synergies from SG&A, such as facilities optimization, administrative functions and rationalization of public company costs, as well as efficiencies in commercial operations, manufacturing, logistics and procurement. Given the strength of the two companies, the enhanced offerings and the positive receptivity from customers, over the next three years we also expect revenue synergies to contribute at least $50 million of additional EBITDA annually. Revenue synergies will result initially from cross-selling across major customers and geographies and eventually through the opportunity to develop co-optimized products and solutions. In addition, the combination is expected to generate tax synergies reflecting the combined company’s ability to benefit from Entegris’ more efficient tax structure.\n\nThe integration teams of both companies have worked closely over the past month, and as a result of those detailed efforts, the combined company now expects to achieve more than $125 million in cost synergies from SG&A, such as facilities optimization, administrative functions and rationalization of public company costs, as well as efficiencies in commercial operations, manufacturing, logistics and procurement. Given the strength of the two companies, the enhanced offerings and the positive receptivity from customers, over the next three years we also expect revenue synergies to contribute at least $50 million of additional EBITDA annually. Revenue synergies will result initially from cross-selling across major customers and geographies and eventually through the opportunity to develop co-optimized products and solutions. In addition, the combination is expected to generate tax synergies reflecting the combined company’s ability to benefit from Entegris’ more efficient tax structure. The combined company will have a strong balance sheet and will generate significant excess free cash flow that will provide the flexibility necessary to allow for significant return of capital to shareholders, among other initiatives. We expect the combined company to have significant debt capacity with gross leverage at closing of only approximately 1.7x.\n\nWe expect the combined company to have significant debt capacity with gross leverage at closing of only approximately 1.7x. Importantly, both companies have experienced management teams with strong track records of successfully integrating mergers, achieving synergies and creating shareholder value. At Entegris, Bertrand Loy has led the successful integration of multiple acquisitions, including Mykrolis, POCO Graphite, and ATMI. Seifi Ghasemi has a proven track record of delivering shareholder value at multiple companies, including Rockwood Holdings and Air Products. We are confident the combined company will meet or exceed the newly stated cost synergy goals as well as realize the other benefits of this merger.\n\nAt Entegris, Bertrand Loy has led the successful integration of multiple acquisitions, including Mykrolis, POCO Graphite, and ATMI. Seifi Ghasemi has a proven track record of delivering shareholder value at multiple companies, including Rockwood Holdings and Air Products. We are confident the combined company will meet or exceed the newly stated cost synergy goals as well as realize the other benefits of this merger. The combined company will deliver unique opportunity for all stakeholders. Together Entegris and Versum will be able to provide an end-to-end portfolio of solutions for the entire semiconductor process and as such, customers will benefit from enhanced product breadth and depth, unwavering commitment to R&D, improved technical expertise as well as a much broader global scale. With the most talented team in the industry we will be able to achieve faster time to solutions and better meet the needs of our customers. With a truly equal combination of the Board of Directors and management team of both Entegris and Versum, the combined company will be the ideal home for Versum’s employees. In fact, the combined company has already committed to creating opportunities for employees of the combined company and will maintain a strong operational presence in Tempe, Arizona – reinforcing that this transaction is a true merger of equals.\n\nWe remain committed to our strategic merger. As we have outlined above, we are confident that it is a highly complementary and strategically compelling transaction that will offer substantial value to shareholders of both companies through the attractive growth profile, potential for capital deployment, a diversified portfolio and enhanced scale.\n\nSincerely,\n\nSeifi Ghasemi Bertrand Loy Chairman of the Versum Board of Directors President and CEO, Entegris\n\nAdvisors\n\nMorgan Stanley & Co. LLC is serving as exclusive financial advisor to Entegris and Wachtell, Lipton, Rosen & Katz is serving as legal counsel. Lazard is serving as financial advisor to Versum Materials and Simpson Thacher & Bartlett LLP is serving as legal counsel.\n\nAbout Entegris\n\nEntegris is a leader in specialty chemicals and advanced materials solutions for the microelectronics industry and other high-tech industries. Entegris is ISO 9001 certified and has manufacturing, customer service and/or research facilities in the United States, China, France, Germany, Israel, Japan, Malaysia, Singapore, South Korea and Taiwan. Additional information can be found at www.entegris.com.\n\nAbout Versum Materials\n\nVersum Materials, Inc. (NYSE:VSM) is a leading global specialty materials company providing high-purity chemicals and gases, delivery systems, services and materials expertise to meet the evolving needs of the global semiconductor and display industries. Derived from the Latin word for \"toward,\" the name \"Versum\" communicates the company's deep commitment to helping customers move toward the future by collaborating, innovating and creating cutting-edge solutions.\n\nA global leader in technology, quality, safety and reliability, Versum Materials is one of the world's leading suppliers of next-generation CMP slurries, ultra-thin dielectric and metal film precursors, formulated cleans and etching products, and delivery equipment that has revolutionized the semiconductor industry. Versum Materials reported fiscal year 2018 annual sales of about U.S. $1.4 billion, has approximately 2,300 employees and operates 14 major facilities in Asia and the North America. It is headquartered in Tempe, Arizona. Versum Materials had operated for more than three decades as a division of Air Products and Chemicals, Inc. (NYSE:APD).\n\nFor additional information, please visit http://www.versummaterials.com.\n\nForward Looking Statements\n\nThis communication contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 that are subject to risks and uncertainties and are made pursuant to the safe harbor provisions of Section 27A of the Securities Act of 1993, as amended and Section 21E of the Securities Exchange Act of 1934, as amended. Where a forward-looking statement expresses or implies an expectation or belief as to future events or results, such expectation or belief is expressed in good faith and believed to have a reasonable basis. The words “believe” “continue,” “could,” “expect,” “anticipate,” “intends,” “estimate,” “forecast,” “project,” “should,” “may,” “will,” “would” or the negative thereof and similar expressions are intended to identify such forward-looking statements.\n\nThese forward-looking statements are only predictions and involve known and unknown risks and uncertainties, many of which are beyond Entegris’ and Versum Materials’ control. Statements in this communication regarding Entegris, Versum Materials and the combined company that are forward-looking, including projections as to the anticipated benefits of the proposed transaction, the impact of the proposed transaction on Entegris’ and Versum Materials’ business and future financial and operating results, the amount and timing of synergies from the proposed transaction, and the closing date for the proposed transaction, are based on management’s estimates, assumptions and projections, and are subject to significant uncertainties and other factors, many of which are beyond Entegris’ and Versum Materials’ control. These factors and risks include, but are not limited to, (i) weakening of global and/or regional economic conditions, generally or specifically in the semiconductor industry, which could decrease the demand for Entegris’ and Versum Materials’ products and solutions; (ii) the ability to meet rapid demand shifts; (iii) the ability to continue technological innovation and introduce new products to meet customers’ rapidly changing requirements; (iv) the concentrated customer base; (v) the ability to identify, effect and integrate acquisitions, joint ventures or other transactions; (vi) the ability to protect and enforce intellectual property rights; (vii) operational, political and legal risks of Entegris’ and Versum Materials’ international operations; (viii) Entegris’ dependence on sole source and limited source suppliers; (ix) the increasing complexity of certain manufacturing processes; (x) raw material shortages and price increases; (xi) changes in government regulations of the countries in which Entegris and Versum Materials operate; (xii) the fluctuation of currency exchange rates; (xiii) fluctuations in the market price of Entegris’ stock; (xiv) the level of, and obligations associated with, Entegris’ and Versum Materials’ indebtedness; and (xv) other risk factors and additional information. In addition, material risks that could cause actual results to differ from forward-looking statements include: the inherent uncertainty associated with financial or other projections; the prompt and effective integration of Entegris’ businesses and the ability to achieve the anticipated synergies and value-creation contemplated by the proposed transaction; the risk associated with Entegris’ and Versum Materials’ ability to obtain the approval of the proposed transaction by their shareholders required to consummate the proposed transaction and the timing of the closing of the proposed transaction, including the risk that the conditions to the transaction are not satisfied on a timely basis or at all and the failure of the transaction to close for any other reason; the risk that a consent or authorization that may be required for the proposed transaction is not obtained or is obtained subject to conditions that are not anticipated; unanticipated difficulties or expenditures relating to the transaction, the response of business partners and retention as a result of the announcement and pendency of the transaction; and the diversion of management time on transaction-related issues. For a more detailed discussion of such risks and other factors, see Entegris’ and Versum Materials’ filings with the Securities and Exchange Commission, including under the heading “Risks Factors” in Item 1A of Entegris’ Annual Report on Form 10-K for the fiscal year ended December 31, 2018, filed on February 11, 2019, and Versum Materials’ Annual Report on Form 10-K for the fiscal year ended September 30, 2018, filed on November 21, 2018 and in other periodic filings, available on the SEC website or www.entegris.com or www.versummaterials.com. Entegris and Versum Materials’ assume no obligation to update any forward-looking statements or information, which speak as of their respective dates, to reflect events or circumstances after the date of this communication, or to reflect the occurrence of unanticipated events, except as may be required under applicable securities laws. Investors should not assume that any lack of update to a previously issued “forward-looking statement” constitutes a reaffirmation of that statement.\n\nAdditional Information about the Merger and Where to Find It\n\nThis communication does not constitute an offer to buy or sell or the solicitation of an offer to buy or sell any securities or a solicitation of any vote or approval. This communication relates to a proposed business combination between Entegris and Versum Materials. In connection with the proposed transaction, Entegris has filed a registration statement on Form S-4, which included a preliminary joint proxy statement of Entegris and Versum Materials that also constitutes a preliminary prospectus of Entegris. These materials have not yet become effective, are not yet final and may be amended. After the registration is declared effective by the Securities and Exchange Commission (the “SEC”), a definitive joint proxy statement/prospectus will be mailed to stockholders of Entegris and stockholders of Versum Materials. INVESTORS AND SECURITY HOLDERS ARE URGED TO READ THE REGISTRATION STATEMENT, JOINT PROXY STATEMENT/PROSPECTUS AND OTHER DOCUMENTS FILED OR THAT WILL BE FILED WITH THE SEC CAREFULLY AND IN THEIR ENTIRETY BECAUSE THEY CONTAIN OR WILL CONTAIN IMPORTANT INFORMATION ABOUT THE PROPOSED TRANSACTION. Investors and security holders will be able to obtain free copies of these documents and other documents containing important information about Entegris and Versum Materials filed with the SEC through the website maintained by the SEC at http://www.sec.gov. Copies of the documents filed with the SEC by Entegris will be available free of charge on Entegris’ website at http://www.entegris.com or by contacting Entegris’ Investor Relations Department by email at irelations@entegris.com or by phone at 978-436-6500. Copies of the documents filed with the SEC by Versum Materials will be available free of charge on Versum Materials’ website at investors.versummaterials.com or by phone at 484-275-5907.\n\nParticipants in the Solicitation\n\nEntegris, Versum Materials and certain of their respective directors and executive officers may be deemed to be participants in the solicitation of proxies in respect of the proposed transaction. Information about the directors and executive officers of Entegris is set forth in Entegris’ proxy statement for its 2018 annual meeting of shareholders, which was filed with the SEC on March 28, 2018, and Entegris’ Annual Report on Form 10-K for the fiscal year ended December 31, 2018, which was filed with the SEC on February 11, 2019. Information about the directors and executive officers of Versum Materials is set forth in its proxy statement for its 2019 annual meeting of shareholders, which was filed with the SEC on December 20, 2018, and Versum Materials’ Annual Report on Form 10-K for the fiscal year ended September 30, 2018, which was filed with the SEC on November 21, 2018. Other information regarding the participants in the proxy solicitations and a description of their direct and indirect interests, by security holdings or otherwise, will be contained in the joint proxy statement/prospectus and other relevant materials to be filed with the SEC regarding the proposed transaction when such materials become available. Investors should read the joint proxy statement/prospectus carefully when it becomes available before making any voting or investment decisions. You may obtain free copies of these documents from Entegris or Versum Materials using the sources indicated above.", "title": "Versum Materials and Entegris Issue Open Letter to Shareholders of Both Companies", "images": [], "text": "\n\n![Business Wire](/images/bwlogo_extreme.png)\n\n# Versum Materials and Entegris Issue Open Letter to Shareholders of Both\nCompanies\n\n_Reiterates Powerful Value-Creation Potential and Compelling Strategic\nBenefits of Merger of Equals_\n\n_Announces Additional $50 million in Cost Synergies Expected for Total of More\nthan $125 million and Significant Revenue Synergy Upside_\n\n_Significant Balance Sheet Flexibility for Return of Capital_\n\n_Committed to Maintaining a Significant Presence in Tempe, Arizona with\nOpportunities for the Combined Employee Base_\n\nMarch 08, 2019 08:30 AM Eastern Standard Time\n\nTEMPE, Ariz. & BILLERICA, Mass.--(BUSINESS WIRE)--Versum Materials, Inc.\n(NYSE:VSM), a leading specialty materials supplier to the semiconductor\nindustry, and Entegris, Inc. (NASDAQ:ENTG), a leader in specialty chemicals\nand advanced materials solutions for the microelectronics industry, today\nissued the following letter to Versum and Entegris shareholders reiterating\nthe powerful value-creation potential and compelling strategic benefits of the\npreviously announced merger of equals:\n\nMarch 8, 2019\n\nDear Versum and Entegris Shareholders:\n\nWe are writing to you on behalf of the Versum Materials and Entegris\nmanagement teams and Boards of Directors regarding the merger of equals\nbetween our two companies we announced on January 28, 2019. We believe it is\nimportant to set the record straight about the compelling strategic benefits\nthe combined company will have as a premier specialty materials company and\nreiterate our confidence in the significant shareholder value we will deliver\nas one company. Key points are as follows:\n\n The Entegris-Versum transaction is a true, all-stock, remain-invested, merger of equals that has tremendous upside value-creation potential. In a combination with Entegris, Versum shareholders will achieve significant value creation from the strength of the combined company, outsized revenue growth and cash flow generation, and enhanced capital returns. Given the leadership position the combined company will hold in the semiconductor and specialty chemicals industry, the combined company will retain the ability to pursue a full range of additional value-creating strategic options going forward. \n There is significant cost, revenue and tax synergy potential within the proposed combination of Entegris and Versum. The integration teams of both companies have worked closely over the past month, and as a result of those detailed efforts, the combined company now expects to achieve more than $125 million in cost synergies from SG&A, such as facilities optimization, administrative functions and rationalization of public company costs, as well as efficiencies in commercial operations, manufacturing, logistics and procurement. Given the strength of the two companies, the enhanced offerings and the positive receptivity from customers, over the next three years we also expect revenue synergies to contribute at least $50 million of additional EBITDA annually. Revenue synergies will result initially from cross-selling across major customers and geographies and eventually through the opportunity to develop co-optimized products and solutions. In addition, the combination is expected to generate tax synergies reflecting the combined company’s ability to benefit from Entegris’ more efficient tax structure. \n The combined company will have a strong balance sheet and will generate significant excess free cash flow that will provide the flexibility necessary to allow for significant return of capital to shareholders, among other initiatives. We expect the combined company to have significant debt capacity with gross leverage at closing of only approximately 1.7x. \n Importantly, both companies have experienced management teams with strong track records of successfully integrating mergers, achieving synergies and creating shareholder value. At Entegris, Bertrand Loy has led the successful integration of multiple acquisitions, including Mykrolis, POCO Graphite, and ATMI. Seifi Ghasemi has a proven track record of delivering shareholder value at multiple companies, including Rockwood Holdings and Air Products. We are confident the combined company will meet or exceed the newly stated cost synergy goals as well as realize the other benefits of this merger. \n The combined company will deliver unique opportunity for all stakeholders. Together Entegris and Versum will be able to provide an end-to-end portfolio of solutions for the entire semiconductor process and as such, customers will benefit from enhanced product breadth and depth, unwavering commitment to R&D, improved technical expertise as well as a much broader global scale. With the most talented team in the industry we will be able to achieve faster time to solutions and better meet the needs of our customers. With a truly equal combination of the Board of Directors and management team of both Entegris and Versum, the combined company will be the ideal home for Versum’s employees. In fact, the combined company has already committed to creating opportunities for employees of the combined company and will maintain a strong operational presence in Tempe, Arizona – reinforcing that this transaction is a true merger of equals. \n\nWe remain committed to our strategic merger. As we have outlined above, we are\nconfident that it is a highly complementary and strategically compelling\ntransaction that will offer substantial value to shareholders of both\ncompanies through the attractive growth profile, potential for capital\ndeployment, a diversified portfolio and enhanced scale.\n\nSincerely,\n\nSeifi Ghasemi | | | | Bertrand Loy \n---|---|---|---|--- \nChairman of the Versum Board of Directors | | | | President and CEO,\nEntegris \n| | | | \n \nAdvisors\n\nMorgan Stanley & Co. LLC is serving as exclusive financial advisor to\nEntegris and Wachtell, Lipton, Rosen & Katz is serving as legal counsel.\nLazard is serving as financial advisor to Versum Materials and Simpson Thacher\n& Bartlett LLP is serving as legal counsel.\n\nAbout Entegris\n\nEntegris is a leader in specialty chemicals and advanced materials solutions\nfor the microelectronics industry and other high-tech industries. Entegris is\nISO 9001 certified and has manufacturing, customer service and/or research\nfacilities in the United States, China, France, Germany, Israel, Japan,\nMalaysia, Singapore, South Korea and Taiwan. Additional information can be\nfound at www.entegris.com.\n\nAbout Versum Materials\n\nVersum Materials, Inc. (NYSE:VSM) is a leading global specialty materials\ncompany providing high-purity chemicals and gases, delivery systems, services\nand materials expertise to meet the evolving needs of the global semiconductor\nand display industries. Derived from the Latin word for \"toward,\" the name\n\"Versum\" communicates the company's deep commitment to helping customers move\ntoward the future by collaborating, innovating and creating cutting-edge\nsolutions.\n\nA global leader in technology, quality, safety and reliability, Versum\nMaterials is one of the world's leading suppliers of next-generation CMP\nslurries, ultra-thin dielectric and metal film precursors, formulated cleans\nand etching products, and delivery equipment that has revolutionized the\nsemiconductor industry. Versum Materials reported fiscal year 2018 annual\nsales of about U.S. $1.4 billion, has approximately 2,300 employees and\noperates 14 major facilities in Asia and the North America. It is\nheadquartered in Tempe, Arizona. Versum Materials had operated for more than\nthree decades as a division of Air Products and Chemicals, Inc. (NYSE:APD).\n\nFor additional information, please visit http://www.versummaterials.com.\n\nForward Looking Statements\n\nThis communication contains forward-looking statements within the meaning of\nthe Private Securities Litigation Reform Act of 1995 that are subject to risks\nand uncertainties and are made pursuant to the safe harbor provisions of\nSection 27A of the Securities Act of 1993, as amended and Section 21E of the\nSecurities Exchange Act of 1934, as amended. Where a forward-looking statement\nexpresses or implies an expectation or belief as to future events or results,\nsuch expectation or belief is expressed in good faith and believed to have a\nreasonable basis. The words “believe” “continue,” “could,” “expect,”\n“anticipate,” “intends,” “estimate,” “forecast,” “project,” “should,” “may,”\n“will,” “would” or the negative thereof and similar expressions are intended\nto identify such forward-looking statements.\n\nThese forward-looking statements are only predictions and involve known and\nunknown risks and uncertainties, many of which are beyond Entegris’ and Versum\nMaterials’ control. Statements in this communication regarding Entegris,\nVersum Materials and the combined company that are forward-looking, including\nprojections as to the anticipated benefits of the proposed transaction, the\nimpact of the proposed transaction on Entegris’ and Versum Materials’ business\nand future financial and operating results, the amount and timing of synergies\nfrom the proposed transaction, and the closing date for the proposed\ntransaction, are based on management’s estimates, assumptions and projections,\nand are subject to significant uncertainties and other factors, many of which\nare beyond Entegris’ and Versum Materials’ control. These factors and risks\ninclude, but are not limited to, (i) weakening of global and/or regional\neconomic conditions, generally or specifically in the semiconductor industry,\nwhich could decrease the demand for Entegris’ and Versum Materials’ products\nand solutions; (ii) the ability to meet rapid demand shifts; (iii) the ability\nto continue technological innovation and introduce new products to meet\ncustomers’ rapidly changing requirements; (iv) the concentrated customer base;\n(v) the ability to identify, effect and integrate acquisitions, joint ventures\nor other transactions; (vi) the ability to protect and enforce intellectual\nproperty rights; (vii) operational, political and legal risks of Entegris’ and\nVersum Materials’ international operations; (viii) Entegris’ dependence on\nsole source and limited source suppliers; (ix) the increasing complexity of\ncertain manufacturing processes; (x) raw material shortages and price\nincreases; (xi) changes in government regulations of the countries in which\nEntegris and Versum Materials operate; (xii) the fluctuation of currency\nexchange rates; (xiii) fluctuations in the market price of Entegris’ stock;\n(xiv) the level of, and obligations associated with, Entegris’ and Versum\nMaterials’ indebtedness; and (xv) other risk factors and additional\ninformation. In addition, material risks that could cause actual results to\ndiffer from forward-looking statements include: the inherent uncertainty\nassociated with financial or other projections; the prompt and effective\nintegration of Entegris’ businesses and the ability to achieve the anticipated\nsynergies and value-creation contemplated by the proposed transaction; the\nrisk associated with Entegris’ and Versum Materials’ ability to obtain the\napproval of the proposed transaction by their shareholders required to\nconsummate the proposed transaction and the timing of the closing of the\nproposed transaction, including the risk that the conditions to the\ntransaction are not satisfied on a timely basis or at all and the failure of\nthe transaction to close for any other reason; the risk that a consent or\nauthorization that may be required for the proposed transaction is not\nobtained or is obtained subject to conditions that are not anticipated;\nunanticipated difficulties or expenditures relating to the transaction, the\nresponse of business partners and retention as a result of the announcement\nand pendency of the transaction; and the diversion of management time on\ntransaction-related issues. For a more detailed discussion of such risks and\nother factors, see Entegris’ and Versum Materials’ filings with the Securities\nand Exchange Commission, including under the heading “Risks Factors” in Item\n1A of Entegris’ Annual Report on Form 10-K for the fiscal year ended December\n31, 2018, filed on February 11, 2019, and Versum Materials’ Annual Report on\nForm 10-K for the fiscal year ended September 30, 2018, filed on November 21,\n2018 and in other periodic filings, available on the SEC website or\nwww.entegris.com or www.versummaterials.com. Entegris and Versum Materials’\nassume no obligation to update any forward-looking statements or information,\nwhich speak as of their respective dates, to reflect events or circumstances\nafter the date of this communication, or to reflect the occurrence of\nunanticipated events, except as may be required under applicable securities\nlaws. Investors should not assume that any lack of update to a previously\nissued “forward-looking statement” constitutes a reaffirmation of that\nstatement.\n\nAdditional Information about the Merger and Where to Find It\n\nThis communication does not constitute an offer to buy or sell or the\nsolicitation of an offer to buy or sell any securities or a solicitation of\nany vote or approval. This communication relates to a proposed business\ncombination between Entegris and Versum Materials. In connection with the\nproposed transaction, Entegris has filed a registration statement on Form S-4,\nwhich included a preliminary joint proxy statement of Entegris and Versum\nMaterials that also constitutes a preliminary prospectus of Entegris. These\nmaterials have not yet become effective, are not yet final and may be amended.\nAfter the registration is declared effective by the Securities and Exchange\nCommission (the “SEC”), a definitive joint proxy statement/prospectus will be\nmailed to stockholders of Entegris and stockholders of Versum Materials.\nINVESTORS AND SECURITY HOLDERS ARE URGED TO READ THE REGISTRATION STATEMENT,\nJOINT PROXY STATEMENT/PROSPECTUS AND OTHER DOCUMENTS FILED OR THAT WILL BE\nFILED WITH THE SEC CAREFULLY AND IN THEIR ENTIRETY BECAUSE THEY CONTAIN OR\nWILL CONTAIN IMPORTANT INFORMATION ABOUT THE PROPOSED TRANSACTION. Investors\nand security holders will be able to obtain free copies of these documents and\nother documents containing important information about Entegris and Versum\nMaterials filed with the SEC through the website maintained by the SEC at\nhttp://www.sec.gov. Copies of the documents filed with the SEC by Entegris\nwill be available free of charge on Entegris’ website at\nhttp://www.entegris.com or by contacting Entegris’ Investor Relations\nDepartment by email at irelations@entegris.com or by phone at 978-436-6500.\nCopies of the documents filed with the SEC by Versum Materials will be\navailable free of charge on Versum Materials’ website at\ninvestors.versummaterials.com or by phone at 484-275-5907.\n\nParticipants in the Solicitation\n\nEntegris, Versum Materials and certain of their respective directors and\nexecutive officers may be deemed to be participants in the solicitation of\nproxies in respect of the proposed transaction. Information about the\ndirectors and executive officers of Entegris is set forth in Entegris’ proxy\nstatement for its 2018 annual meeting of shareholders, which was filed with\nthe SEC on March 28, 2018, and Entegris’ Annual Report on Form 10-K for the\nfiscal year ended December 31, 2018, which was filed with the SEC on February\n11, 2019. Information about the directors and executive officers of Versum\nMaterials is set forth in its proxy statement for its 2019 annual meeting of\nshareholders, which was filed with the SEC on December 20, 2018, and Versum\nMaterials’ Annual Report on Form 10-K for the fiscal year ended September 30,\n2018, which was filed with the SEC on November 21, 2018. Other information\nregarding the participants in the proxy solicitations and a description of\ntheir direct and indirect interests, by security holdings or otherwise, will\nbe contained in the joint proxy statement/prospectus and other relevant\nmaterials to be filed with the SEC regarding the proposed transaction when\nsuch materials become available. Investors should read the joint proxy\nstatement/prospectus carefully when it becomes available before making any\nvoting or investment decisions. You may obtain free copies of these documents\nfrom Entegris or Versum Materials using the sources indicated above.\n\n## Contacts\n\nEntegris \nBill Seymour \nVP of Investor Relations \n952-556-1844 \nbill.seymour@entegris.com \nOr \nMichael Freitag / Kelly Sullivan \nJoele Frank, Wilkinson Brimmer Katcher \n212-355-4449 \n \n Versum Materials Contacts \nSoohwan Kim, CFA \nHead of Investor Relations \n602-282-0957 \nSoohwan.Kim@versummaterials.com \nOr \nTiffany Elle \nGlobal Communications \n480-282-6475 \nTiffany.Elle@versummaterials.com \nOr \nMeghan Gavigan / Emily Claffey / Julie Rudnick \nSard Verbinnen & Co \n212-687-8080\n\n## Contacts\n\nEntegris \nBill Seymour \nVP of Investor Relations \n952-556-1844 \nbill.seymour@entegris.com \nOr \nMichael Freitag / Kelly Sullivan \nJoele Frank, Wilkinson Brimmer Katcher \n212-355-4449 \n \n Versum Materials Contacts \nSoohwan Kim, CFA \nHead of Investor Relations \n602-282-0957 \nSoohwan.Kim@versummaterials.com \nOr \nTiffany Elle \nGlobal Communications \n480-282-6475 \nTiffany.Elle@versummaterials.com \nOr \nMeghan Gavigan / Emily Claffey / Julie Rudnick \nSard Verbinnen & Co \n212-687-8080\n\n## Site Navigation\n\n Home\n Home\n Submit a Press Release\n Services\n News\n All News\n News with Multimedia\n News by Industry\n News by Subject\n News by Language\n Tradeshows & Events\n Education\n Overview\n Distribution & Media\n Media & Journalist Tools\n Sample Press Release\n Find Your News Online\n How-to\n Disclosure Resources\n About Us\n Overview\n Become a Member\n Contact Us\n Follow Us\n Careers\n Business Wire Newsroom\n Business Wire Events\n\n## Search\n\nAdvanced News Search\n\nAdvanced News Search ![Search](/images/icons/icon_search.gif)\n\n Log In\n Sign Up\n\n## Follow Us\n\n Twitter\n LinkedIn\n Google+\n\n## More from Business Wire\n\n Blog\n Apps\n UK/Ireland\n Deutschland\n France\n Hong Kong\n Italy\n Japan\n Tradeshownews.com\n\n## Business Wire Information\n\n Contact Us\n UK Tax Strategy\n Privacy Statement\n Terms of Use\n (C) 2019 Business Wire\n\nAccept the use of cookies Learn more\n\nI Accept\n\n", "contact_info": [{"name": "Bill Seymour", "other_information": ["VP of Investor Relations"], "phone": "952-556-1844", "email": "bill.seymour@entegris.com"}, {"name": "Michael Freitag / Kelly Sullivan"}, {"name": "Joele Frank", "other_information": ["Joele Frank, Wilkinson Brimmer Katcher"], "phone": "212-355-4449"}, {"name": "Soohwan Kim", "other_information": ["Soohwan Kim, CFA", "Head of Investor Relations", "Tiffany Elle", "Global Communications"], "phone": "480-282-6475", "email": "Tiffany.Elle@versummaterials.com"}, {"name": "Meghan Gavigan", "other_information": ["Meghan Gavigan / Emily Claffey / Julie Rudnick", "Sard Verbinnen & Co"], "phone": "212-687-8080"}], "date": "March 08, 2019", "time": "08:30 AM Eastern Standard Time", "published_date_time": "March 08, 2019 08:30 AM Eastern Standard Time", "sub_title": "Reiterates Powerful Value-Creation Potential and Compelling Strategic \n      Benefits of Merger of Equals\n\n\nAnnounces Additional $50 million in Cost Synergies Expected for Total \n      of More than $125 million and Significant Revenue Synergy Upside\n\n\nSignificant Balance Sheet Flexibility for Return of Capital\n\n\nCommitted to Maintaining a Significant Presence in Tempe, Arizona \n      with Opportunities for the Combined Employee Base", "entities": [{"company_name": "BILLERICA, Mass.--(BUSINESS WIRE)--Versum Materials, Inc.", "stock_name": "NYSE:VSM"}, {"company_name": "Entegris, Inc.", "stock_name": "NASDAQ:ENTG"}], "company_1": "Versum Materials", "company_2": "Versum"}